export const address = {
    "กรุงเทพมหานคร": {
        "สัมพันธวงศ์": {
            "PostCode": 10100,
            "Tambons": [
                "จักรวรรดิ",
                "ตลาดน้อย",
                "สัมพันธวงศ์"
            ]
        },
        "ป้อมปราบศัตรูพ่าย": {
            "PostCode": 10100,
            "Tambons": [
                "บ้านบาตร",
                "ป้อมปราบ",
                "วัดเทพศิรินทร์",
                "คลองมหานาค",
                "วัดโสมนัส"
            ]
        },
        "คลองเตย": {
            "PostCode": 10110,
            "Tambons": [
                "คลองตัน",
                "คลองเตย",
                "พระโขนง",
                "พระโขนง"
            ]
        },
        "วัฒนา": {
            "PostCode": 10110,
            "Tambons": [
                "คลองตันเหนือ",
                "คลองเตยเหนือ",
                "พระโขนงเหนือ",
                "พระโขนงเหนือ"
            ]
        },
        "ปทุมวัน": {
            "PostCode": 10110,
            "Tambons": [
                "วังใหม่",
                "วังใหม่",
                "รองเมือง",
                "ปทุมวัน",
                "ลุมพินี",
                "วังใหม่",
                "วังใหม่",
                "วังใหม่"
            ]
        },
        "ยานนาวา": {
            "PostCode": 10120,
            "Tambons": [
                "ช่องนนทรี",
                "บางโพงพาง"
            ]
        },
        "บางคอแหลม": {
            "PostCode": 10120,
            "Tambons": [
                "บางโคล่",
                "บางคอแหลม",
                "วัดพระยาไกร"
            ]
        },
        "สาทร": {
            "PostCode": 10120,
            "Tambons": [
                "ทุ่งวัดดอน",
                "ยานนาวา",
                "ทุ่งมหาเมฆ"
            ]
        },
        "ราษฎร์บูรณะ": {
            "PostCode": 10140,
            "Tambons": [
                "ราษฎร์บูรณะ",
                "บางปะกอก"
            ]
        },
        "ทุ่งครุ": {
            "PostCode": 10140,
            "Tambons": [
                "ทุ่งครุ",
                "บางมด"
            ]
        },
        "บางขุนเทียน": {
            "PostCode": 10150,
            "Tambons": [
                "แสมดำ",
                "ท่าข้าม"
            ]
        },
        "บางบอน": {
            "PostCode": 10150,
            "Tambons": [
                "คลองบางบอน",
                "คลองบางพราน",
                "บางบอนใต้",
                "บางบอนเหนือ"
            ]
        },
        "จอมทอง": {
            "PostCode": 10150,
            "Tambons": [
                "จอมทอง",
                "บางมด",
                "บางค้อ",
                "บางขุนเทียน"
            ]
        },
        "ภาษีเจริญ": {
            "PostCode": 10160,
            "Tambons": [
                "ปากคลองภาษีเจริญ",
                "บางหว้า",
                "คลองขวาง",
                "บางด้วน",
                "บางจาก",
                "บางแวก",
                "คูหาสวรรค์"
            ]
        },
        "บางแค": {
            "PostCode": 10160,
            "Tambons": [
                "หลักสอง",
                "บางไผ่",
                "บางแคเหนือ",
                "บางแค"
            ]
        },
        "หนองแขม": {
            "PostCode": 10160,
            "Tambons": [
                "หนองแขม",
                "หนองค้างพลู"
            ]
        },
        "ทวีวัฒนา": {
            "PostCode": 10170,
            "Tambons": [
                "ศาลาธรรมสพน์",
                "ทวีวัฒนา"
            ]
        },
        "ตลิ่งชัน": {
            "PostCode": 10170,
            "Tambons": [
                "บางระมาด",
                "บางเชือกหนัง",
                "ตลิ่งชัน",
                "คลองชักพระ",
                "ฉิมพลี",
                "บางพรม"
            ]
        },
        "พระนคร": {
            "PostCode": 10200,
            "Tambons": [
                "พระบรมมหาราชวัง",
                "ตลาดยอด",
                "บวรนิเวศ",
                "เสาชิงช้า",
                "ศาลเจ้าพ่อเสือ",
                "บางขุนพรหม",
                "วัดสามพระยา",
                "สำราญราษฎร์",
                "บ้านพานถม",
                "ชนะสงคราม",
                "วัดราชบพิธ",
                "วังบูรพาภิรมย์"
            ]
        },
        "ดอนเมือง": {
            "PostCode": 10210,
            "Tambons": [
                "สีกัน",
                "สนามบิน",
                "ดอนเมือง"
            ]
        },
        "หลักสี่": {
            "PostCode": 10210,
            "Tambons": [
                "ทุ่งสองห้อง",
                "ตลาดบางเขน"
            ]
        },
        "สายไหม": {
            "PostCode": 10220,
            "Tambons": [
                "คลองถนน",
                "ออเงิน",
                "สายไหม"
            ]
        },
        "บางเขน": {
            "PostCode": 10220,
            "Tambons": [
                "อนุสาวรีย์",
                "ท่าแร้ง",
                "ท่าแร้ง"
            ]
        },
        "คันนายาว": {
            "PostCode": 10230,
            "Tambons": [
                "รามอินทรา",
                "คันนายาว"
            ]
        },
        "บึงกุ่ม": {
            "PostCode": 10230,
            "Tambons": [
                "นวลจันทร์",
                "คลองกุ่ม",
                "นวมินทร์",
                "คลองกุ่ม"
            ]
        },
        "ลาดพร้าว": {
            "PostCode": 10230,
            "Tambons": [
                "จรเข้บัว",
                "ลาดพร้าว"
            ]
        },
        "สะพานสูง": {
            "PostCode": 10240,
            "Tambons": [
                "ราษฎร์พัฒนา",
                "สะพานสูง",
                "ทับช้าง",
                "สะพานสูง"
            ]
        },
        "บางกะปิ": {
            "PostCode": 10240,
            "Tambons": [
                "คลองจั่น",
                "หัวหมาก",
                "หัวหมาก"
            ]
        },
        "สวนหลวง": {
            "PostCode": 10250,
            "Tambons": [
                "อ่อนนุช",
                "สวนหลวง",
                "พัฒนาการ"
            ]
        },
        "ประเวศ": {
            "PostCode": 10250,
            "Tambons": [
                "ดอกไม้",
                "หนองบอน",
                "ประเวศ"
            ]
        },
        "พระโขนง": {
            "PostCode": 10260,
            "Tambons": [
                "พระโขนงใต้",
                "บางจาก"
            ]
        },
        "บางนา": {
            "PostCode": 10260,
            "Tambons": [
                "บางนาใต้",
                "บางนาเหนือ"
            ]
        },
        "ดุสิต": {
            "PostCode": 10300,
            "Tambons": [
                "ถนนนครไชยศรี",
                "สี่แยกมหานาค",
                "วชิรพยาบาล",
                "ดุสิต",
                "สวนจิตรลดา",
                "สวนจิตรลดา"
            ]
        },
        "ห้วยขวาง": {
            "PostCode": 10310,
            "Tambons": [
                "ห้วยขวาง",
                "บางกะปิ",
                "สามเสนนอก"
            ]
        },
        "วังทองหลาง": {
            "PostCode": 10310,
            "Tambons": [
                "พลับพลา",
                "คลองเจ้าคุณสิงห์",
                "สะพานสอง",
                "วังทองหลาง"
            ]
        },
        "ดินแดง": {
            "PostCode": 10400,
            "Tambons": [
                "ดินแดง",
                "รัชดาภิเษก"
            ]
        },
        "ราชเทวี": {
            "PostCode": 10400,
            "Tambons": [
                "มักกะสัน",
                "ถนนเพชรบุรี",
                "ถนนพญาไท",
                "ทุ่งพญาไท"
            ]
        },
        "พญาไท": {
            "PostCode": 10400,
            "Tambons": [
                "สามเสนใน",
                "พญาไท"
            ]
        },
        "บางรัก": {
            "PostCode": 10500,
            "Tambons": [
                "สุริยวงศ์",
                "สีลม",
                "บางรัก",
                "สี่พระยา",
                "มหาพฤฒาราม"
            ]
        },
        "คลองสามวา": {
            "PostCode": 10510,
            "Tambons": [
                "ทรายกองดิน",
                "บางชัน",
                "ทรายกองดินใต้",
                "สามวาตะวันออก",
                "สามวาตะวันตก"
            ]
        },
        "มีนบุรี": {
            "PostCode": 10510,
            "Tambons": [
                "มีนบุรี",
                "แสนแสบ"
            ]
        },
        "ลาดกระบัง": {
            "PostCode": 10520,
            "Tambons": [
                "ทับยาว",
                "ลำปลาทิว",
                "ขุมทอง",
                "ลาดกระบัง",
                "คลองสองต้นนุ่น",
                "คลองสามประเวศ"
            ]
        },
        "หนองจอก": {
            "PostCode": 10530,
            "Tambons": [
                "ลำผักชี",
                "กระทุ่มราย",
                "หนองจอก",
                "คลองสิบ",
                "คลองสิบสอง",
                "โคกแฝด",
                "คู้ฝั่งเหนือ",
                "ลำต้อยติ่ง"
            ]
        },
        "บางกอกใหญ่": {
            "PostCode": 10600,
            "Tambons": [
                "วัดอรุณ",
                "วัดท่าพระ"
            ]
        },
        "ธนบุรี": {
            "PostCode": 10600,
            "Tambons": [
                "วัดกัลยาณ์",
                "หิรัญรูจี",
                "สำเหร่",
                "ดาวคะนอง",
                "ตลาดพลู",
                "บุคคโล",
                "บางยี่เรือ"
            ]
        },
        "คลองสาน": {
            "PostCode": 10600,
            "Tambons": [
                "คลองต้นไทร",
                "บางลำภูล่าง",
                "คลองสาน",
                "สมเด็จเจ้าพระยา"
            ]
        },
        "บางพลัด": {
            "PostCode": 10700,
            "Tambons": [
                "บางยี่ขัน",
                "บางบำหรุ",
                "บางอ้อ",
                "บางพลัด"
            ]
        },
        "บางกอกน้อย": {
            "PostCode": 10700,
            "Tambons": [
                "บางขุนศรี",
                "ศิริราช",
                "บ้านช่างหล่อ",
                "อรุณอมรินทร์",
                "บางขุนนนท์"
            ]
        },
        "บางซื่อ": {
            "PostCode": 10800,
            "Tambons": [
                "บางซื่อ",
                "วงศ์สว่าง"
            ]
        },
        "จตุจักร": {
            "PostCode": 10900,
            "Tambons": [
                "จอมพล",
                "จตุจักร",
                "จันทรเกษม",
                "เสนานิคม",
                "ลาดยาว"
            ]
        }
    },
    "สมุทรปราการ": {
        "พระประแดง": {
            "PostCode": 10130,
            "Tambons": [
                "บางหัวเสือ",
                "สำโรง",
                "ทรงคนอง",
                "บางพึ่ง",
                "บางกอบัว",
                "บางครุ",
                "บางกระสอบ",
                "สำโรงใต้",
                "บางน้ำผึ้ง",
                "บางกะเจ้า",
                "บางยอ",
                "บางจาก",
                "บางหญ้าแพรก",
                "ตลาด",
                "สำโรงกลาง"
            ]
        },
        "เมืองสมุทรปราการ": {
            "PostCode": 10270,
            "Tambons": [
                "บางโปรง",
                "บางด้วน",
                "บางเมืองใหม่",
                "เทพารักษ์",
                "บางเมือง",
                "สำโรงเหนือ",
                "ปากน้ำ",
                "แพรกษาใหม่",
                "ท้ายบ้าน",
                "บางปูใหม่",
                "แพรกษา",
                "ท้ายบ้านใหม่",
                "บางปู"
            ]
        },
        "พระสมุทรเจดีย์": {
            "PostCode": 10290,
            "Tambons": [
                "นาเกลือ",
                "บ้านคลองสวน",
                "แหลมฟ้าผ่า",
                "ปากคลองบางปลากด",
                "ในคลองบางปลากด"
            ]
        },
        "บางพลี": {
            "PostCode": 10540,
            "Tambons": [
                "บางพลีใหญ่",
                "บางแก้ว",
                "ราชาเทวะ",
                "บางปลา",
                "บางโฉลง",
                "หนองปรือ"
            ]
        },
        "บางบ่อ": {
            "PostCode": 10550,
            "Tambons": [
                "คลองด่าน",
                "คลองนิยมยาตรา",
                "เปร็ง",
                "คลองสวน",
                "บางเพรียง",
                "บางพลีน้อย",
                "บ้านระกาศ",
                "บางบ่อ"
            ]
        },
        "บางเสาธง": {
            "PostCode": 10570,
            "Tambons": [
                "ศีรษะจรเข้ใหญ่",
                "ศีรษะจรเข้น้อย",
                "บางเสาธง"
            ]
        }
    },
    "นนทบุรี": {
        "เมืองนนทบุรี": {
            "PostCode": 11000,
            "Tambons": [
                "บางรักน้อย",
                "ไทรม้า",
                "บางกร่าง",
                "บางศรีเมือง",
                "บางไผ่",
                "บางกระสอ",
                "บางเขน",
                "ตลาดขวัญ",
                "สวนใหญ่",
                "ท่าทราย"
            ]
        },
        "บางบัวทอง": {
            "PostCode": 11110,
            "Tambons": [
                "โสนลอย",
                "พิมลราช",
                "บางรักพัฒนา",
                "ลำโพ",
                "บางบัวทอง",
                "ละหาร",
                "บางคูรัด",
                "บางรักใหญ่"
            ]
        },
        "ปากเกร็ด": {
            "PostCode": 11120,
            "Tambons": [
                "คลองเกลือ",
                "คลองข่อย",
                "อ้อมเกร็ด",
                "เกาะเกร็ด",
                "ปากเกร็ด",
                "บางพลับ",
                "คลองพระอุดม",
                "บางตะไนย์",
                "บางพูด",
                "บ้านใหม่",
                "บางตลาด",
                "ท่าอิฐ"
            ]
        },
        "บางกรวย": {
            "PostCode": 11130,
            "Tambons": [
                "ปลายบาง",
                "มหาสวัสดิ์",
                "บางคูเวียง",
                "บางขุนกอง",
                "ศาลากลาง",
                "บางสีทอง",
                "บางกรวย",
                "วัดชลอ",
                "บางขนุน"
            ]
        },
        "บางใหญ่": {
            "PostCode": 11140,
            "Tambons": [
                "เสาธงหิน",
                "บางเลน",
                "บ้านใหม่",
                "บางใหญ่",
                "บางแม่นาง",
                "บางม่วง"
            ]
        },
        "ไทรน้อย": {
            "PostCode": 11150,
            "Tambons": [
                "ขุนศรี",
                "หนองเพรางาย",
                "ราษฎร์นิยม",
                "ไทรน้อย",
                "ทวีวัฒนา",
                "คลองขวาง",
                "ไทรใหญ่"
            ]
        }
    },
    "ปทุมธานี": {
        "เมืองปทุมธานี": {
            "PostCode": 12000,
            "Tambons": [
                "บ้านกระแชง",
                "บางขะแยง",
                "บ้านฉาง",
                "บางหลวง",
                "บางเดื่อ",
                "บางพูน",
                "บางกะดี",
                "สวนพริกไทย",
                "หลักหก",
                "บ้านกลาง",
                "บ้านใหม่",
                "บางปรอก",
                "บางพูด",
                "บางคูวัด"
            ]
        },
        "ธัญบุรี": {
            "PostCode": 12110,
            "Tambons": [
                "รังสิต",
                "ลำผักกูด",
                "บึงน้ำรักษ์",
                "บึงสนั่น",
                "ประชาธิปัตย์",
                "บึงยี่โถ"
            ]
        },
        "คลองหลวง": {
            "PostCode": 12110,
            "Tambons": [
                "คลองห้า",
                "คลองหก",
                "คลองเจ็ด",
                "คลองสอง",
                "คลองสาม",
                "คลองสี่",
                "คลองหนึ่ง",
                "คลองห้า",
                "คลองหก",
                "คลองหนึ่ง",
                "คลองหนึ่ง"
            ]
        },
        "ลำลูกกา": {
            "PostCode": 12130,
            "Tambons": [
                "คูคต",
                "ลาดสวาย",
                "พืชอุดม",
                "ลำไทร",
                "บึงคำพร้อย",
                "ลำลูกกา",
                "บึงทองหลาง",
                "บึงคอไห"
            ]
        },
        "ลาดหลุมแก้ว": {
            "PostCode": 12140,
            "Tambons": [
                "ระแหง",
                "บ่อเงิน",
                "คลองพระอุดม",
                "คูขวาง",
                "คูบางหลวง",
                "หน้าไม้",
                "ลาดหลุมแก้ว"
            ]
        },
        "สามโคก": {
            "PostCode": 12160,
            "Tambons": [
                "บางกระบือ",
                "สามโคก",
                "ท้ายเกาะ",
                "บางโพธิ์เหนือ",
                "คลองควาย",
                "เชียงรากใหญ่",
                "เชียงรากน้อย",
                "บางเตย",
                "บ้านปทุม",
                "บ้านงิ้ว",
                "กระแชง"
            ]
        },
        "หนองเสือ": {
            "PostCode": 12170,
            "Tambons": [
                "บึงบา",
                "นพรัตน์",
                "ศาลาครุ",
                "หนองสามวัง",
                "บึงชำอ้อ",
                "บึงกาสาม",
                "บึงบอน"
            ]
        }
    },
    "พระนครศรีอยุธยา": {
        "พระนครศรีอยุธยา": {
            "PostCode": 13000,
            "Tambons": [
                "หอรัตนไชย",
                "กะมัง",
                "บ้านเกาะ",
                "คลองสวนพลู",
                "ลุมพลี",
                "คลองสระบัว",
                "เกาะเรียน",
                "หันตรา",
                "บ้านป้อม",
                "บ้านรุน",
                "วัดตูม",
                "คลองตะเคียน",
                "ประตูชัย",
                "สำเภาล่ม",
                "ภูเขาทอง",
                "สวนพริก",
                "บ้านใหม่",
                "หัวรอ",
                "ท่าวาสุกรี",
                "ไผ่ลิง",
                "ปากกราน"
            ]
        },
        "อุทัย": {
            "PostCode": 13000,
            "Tambons": [
                "ข้าวเม่า",
                "ธนู",
                "บ้านหีบ",
                "อุทัย",
                "เสนา",
                "หนองน้ำส้ม",
                "สามบัณฑิต",
                "โพสาวหาญ",
                "หนองไม้ซุง",
                "บ้านช้าง",
                "คานหาม",
                "ธนู",
                "ข้าวเม่า"
            ]
        },
        "เสนา": {
            "PostCode": 13110,
            "Tambons": [
                "เจ้าเสด็จ",
                "บ้านหลวง",
                "ดอนทอง",
                "ลาดงา",
                "เสนา",
                "บ้านแพน",
                "เจ้าเจ็ด",
                "สามกอ",
                "สามตุ่ม",
                "บางนมโค",
                "หัวเวียง",
                "มารวิชัย",
                "ชายนา",
                "บ้านโพธิ์",
                "บ้านกระทุ่ม",
                "รางจรเข้",
                "บ้านแถว"
            ]
        },
        "ผักไห่": {
            "PostCode": 13120,
            "Tambons": [
                "หน้าโคก",
                "บ้านใหญ่",
                "โคกช้าง",
                "กุฎี",
                "ท่าดินแดง",
                "ตาลาน",
                "บ้านแค",
                "ลาดชิด",
                "อมฤต",
                "ผักไห่",
                "ลาดน้ำเค็ม",
                "หนองน้ำใหญ่",
                "จักราช",
                "ลำตะเคียน",
                "ดอนลาน",
                "นาคู"
            ]
        },
        "ท่าเรือ": {
            "PostCode": 13130,
            "Tambons": [
                "ท่าเรือ",
                "จำปา",
                "หนองขนาก",
                "ท่าเจ้าสนุก",
                "ปากท่า",
                "วังแดง",
                "ศาลาลอย",
                "โพธิ์เอน",
                "บ้านร่อม",
                "ท่าหลวง",
                "ท่าหลวง"
            ]
        },
        "ภาชี": {
            "PostCode": 13140,
            "Tambons": [
                "โคกม่วง",
                "หนองน้ำใส",
                "ดอนหญ้านาง",
                "ไผ่ล้อม",
                "กระจิว",
                "พระแก้ว",
                "ภาชี",
                "ระโสม",
                "ระโสม"
            ]
        },
        "มหาราช": {
            "PostCode": 13150,
            "Tambons": [
                "หัวไผ่",
                "กะทุ่ม",
                "ท่าตอ",
                "บางนา",
                "โรงช้าง",
                "เจ้าปลุก",
                "พิตเพียน",
                "บ้านนา",
                "บ้านขวาง",
                "บ้านใหม่",
                "มหาราช",
                "น้ำเต้า"
            ]
        },
        "บางปะอิน": {
            "PostCode": 13160,
            "Tambons": [
                "วัดยม",
                "บางประแดง",
                "สามเรือน",
                "เกาะเกิด",
                "บ้านพลับ",
                "บ้านหว้า",
                "คลองจิก",
                "บางกระสั้น",
                "บ้านกรด",
                "คุ้งลาน",
                "ตลิ่งชัน",
                "บ้านเลน",
                "บ้านโพ",
                "ตลาดเกรียบ",
                "ขนอนหลวง",
                "บ้านแป้ง",
                "บ้านสร้าง",
                "เชียงรากน้อย"
            ]
        },
        "วังน้อย": {
            "PostCode": 13170,
            "Tambons": [
                "สนับทึบ",
                "ข้าวงาม",
                "หันตะเภา",
                "ชะแมบ",
                "ลำตาเสา",
                "บ่อตาโล่",
                "วังน้อย",
                "ลำไทร",
                "วังจุฬา",
                "พยอม",
                "พยอม"
            ]
        },
        "บางไทร": {
            "PostCode": 13190,
            "Tambons": [
                "บ้านแป้ง",
                "บางไทร",
                "โคกช้าง",
                "สนามชัย",
                "บางพลี",
                "บ้านเกาะ",
                "บ้านม้า",
                "ไม้ตรา",
                "ไผ่พระ",
                "ห่อหมก",
                "กกแก้วบูรพา",
                "บ้านกลึง",
                "หน้าไม้",
                "บางยี่โท",
                "กระแชง",
                "ช่างเหล็ก",
                "แคออก",
                "แคตก",
                "ช้างน้อย",
                "ราชคราม",
                "ช้างใหญ่",
                "เชียงรากน้อย",
                "โพแตง"
            ]
        },
        "บางปะหัน": {
            "PostCode": 13220,
            "Tambons": [
                "บ้านลี่",
                "หันสัง",
                "บางเพลิง",
                "บางนางร้า",
                "ทางกลาง",
                "เสาธง",
                "บางเดื่อ",
                "ขยาย",
                "ตานิม",
                "บ้านม้า",
                "บ้านขล้อ",
                "ตาลเอน",
                "พุทเลา",
                "โพธิ์สามต้น",
                "ขวัญเมือง",
                "บางปะหัน",
                "ทับน้ำ"
            ]
        },
        "ลาดบัวหลวง": {
            "PostCode": 13230,
            "Tambons": [
                "คลองพระยาบันลือ",
                "คู้สลอด",
                "สิงหนาท",
                "พระยาบันลือ",
                "สามเมือง",
                "หลักชัย",
                "ลาดบัวหลวง"
            ]
        },
        "บ้านแพรก": {
            "PostCode": 13240,
            "Tambons": [
                "สองห้อง",
                "คลองน้อย",
                "สำพะเนียง",
                "บ้านใหม่",
                "บ้านแพรก"
            ]
        },
        "บางบาล": {
            "PostCode": 13250,
            "Tambons": [
                "บ้านกุ่ม",
                "บางชะนี",
                "บางบาล",
                "วัดยม",
                "บ้านคลัง",
                "ไทรน้อย",
                "กบเจา",
                "น้ำเต้า",
                "มหาพราหมณ์",
                "ทางช้าง",
                "สะพานไทย",
                "บางหลวง",
                "บางหลวงโดด",
                "บางหัก",
                "วัดตะกู",
                "พระขาว"
            ]
        },
        "นครหลวง": {
            "PostCode": 13260,
            "Tambons": [
                "นครหลวง",
                "แม่ลา",
                "บ่อโพง",
                "บ้านชุ้ง",
                "ปากจั่น",
                "บางระกำ",
                "บางพระครู",
                "คลองสะแก",
                "สามไถ",
                "พระนอน",
                "หนองปลิง",
                "ท่าช้าง"
            ]
        },
        "บางซ้าย": {
            "PostCode": 13270,
            "Tambons": [
                "วังพัฒนา",
                "เทพมงคล",
                "ปลายกลัด",
                "เต่าเล่า",
                "แก้วฟ้า",
                "บางซ้าย"
            ]
        }
    },
    "ลพบุรี": {
        "เมืองลพบุรี": {
            "PostCode": 13240,
            "Tambons": [
                "โก่งธนู",
                "เขาสามยอด",
                "ทะเลชุบศร",
                "ถนนใหญ่",
                "โคกลำพาน",
                "โพธิ์ตรุ",
                "นิคมสร้างตนเอง",
                "ท้ายตลาด",
                "ป่าตาล",
                "สี่คลอง",
                "บ้านข่อย",
                "กกโก",
                "ท่าศาลา",
                "ตะลุง",
                "ดอนโพธิ์",
                "พรหมมาสตร์",
                "งิ้วราย",
                "โพธิ์เก้าต้น",
                "ท่าหิน",
                "บางขันหมาก",
                "ท่าแค",
                "เขาพระงาม",
                "โคกกะเทียม",
                "บางขันหมาก",
                "ท่าแค",
                "โคกตูม"
            ]
        },
        "บ้านหมี่": {
            "PostCode": 15110,
            "Tambons": [
                "โพนทอง",
                "ดอนดึง",
                "ชอนม่วง",
                "บ้านหมี่",
                "สายห้วยแก้ว",
                "มหาสอน",
                "เชียงงา",
                "หนองเมือง",
                "สนามแจง",
                "หนองกระเบียน",
                "หนองเต่า",
                "หินปัก",
                "หนองทรายขาว",
                "พุคา",
                "ดงพลับ",
                "บ้านกล้วย",
                "บ้านทราย",
                "ไผ่ใหญ่",
                "บางกะพี้",
                "บางพึ่ง",
                "บางขาม",
                "บ้านชี",
                "บางพึ่ง"
            ]
        },
        "โคกสำโรง": {
            "PostCode": 15120,
            "Tambons": [
                "โคกสำโรง",
                "เกาะแก้ว",
                "ถลุงเหล็ก",
                "หลุมข้าว",
                "ห้วยโป่ง",
                "ดงมะรุม",
                "สะแกราบ",
                "เพนียด",
                "วังขอนขว้าง",
                "หนองแขม",
                "คลองเกตุ",
                "วังจั่น",
                "วังเพลิง"
            ]
        },
        "ชัยบาดาล": {
            "PostCode": 15130,
            "Tambons": [
                "บ้านใหม่สามัคคี",
                "ลำนารายณ์",
                "ศิลาทิพย์",
                "ห้วยหิน",
                "บัวชุม",
                "ท่าดินดำ",
                "ชัยนารายณ์",
                "ซับตะเคียน",
                "เขาแหลม",
                "หนองยายโต๊ะ",
                "เกาะรัง",
                "นิคมลำนารายณ์",
                "ท่ามะนาว",
                "นาโสม",
                "ชัยบาดาล",
                "ม่วงค่อม",
                "มะกอกหวาน"
            ]
        },
        "ลำสนธิ": {
            "PostCode": 15130,
            "Tambons": [
                "เขาน้อย",
                "ลำสนธิ",
                "ซับสมบูรณ์",
                "หนองรี",
                "กุดตาเพชร",
                "เขารวก"
            ]
        },
        "พัฒนานิคม": {
            "PostCode": 15140,
            "Tambons": [
                "หนองบัว",
                "ชอนน้อย",
                "โคกสลุง",
                "มะนาวหวาน",
                "พัฒนานิคม",
                "น้ำสุด",
                "ช่องสาริกา",
                "ดีลัง",
                "ห้วยขุนราม"
            ]
        },
        "ท่าวุ้ง": {
            "PostCode": 15150,
            "Tambons": [
                "ลาดสาลี่",
                "บ้านเบิก",
                "หัวสำโรง",
                "มุจลินท์",
                "ท่าวุ้ง",
                "โคกสลุด",
                "บางลี่",
                "โพตลาดแก้ว",
                "บางงา",
                "บางคู้",
                "เขาสมอคอน"
            ]
        },
        "หนองม่วง": {
            "PostCode": 15170,
            "Tambons": [
                "ยางโทน",
                "หนองม่วง",
                "บ่อทอง",
                "ดงดินแดง",
                "ชอนสมบูรณ์",
                "ชอนสารเดช"
            ]
        },
        "ท่าหลวง": {
            "PostCode": 15230,
            "Tambons": [
                "หนองผักแว่น",
                "หัวลำ",
                "ทะเลวังวัด",
                "ซับจำปา",
                "แก่งผักกูด",
                "ท่าหลวง"
            ]
        },
        "สระโบสถ์": {
            "PostCode": 15240,
            "Tambons": [
                "ห้วยใหญ่",
                "ทุ่งท่าช้าง",
                "สระโบสถ์",
                "นิยมชัย",
                "มหาโพธิ",
                "มหาโพธิ"
            ]
        },
        "โคกเจริญ": {
            "PostCode": 15250,
            "Tambons": [
                "หนองมะค่า",
                "ยางราก",
                "วังทอง",
                "โคกแสมสาร",
                "โคกเจริญ"
            ]
        }
    },
    "อ่างทอง": {
        "เมืองอ่างทอง": {
            "PostCode": 14000,
            "Tambons": [
                "หัวไผ่",
                "มหาดไทย",
                "ตลาดกรวด",
                "บ้านแห",
                "ป่างิ้ว",
                "ศาลาแดง",
                "บางแก้ว",
                "ตลาดหลวง",
                "โพสะ",
                "บ้านรี",
                "คลองวัว",
                "ย่านซื่อ",
                "จำปาหล่อ",
                "บ้านอิฐ"
            ]
        },
        "วิเศษชัยชาญ": {
            "PostCode": 14110,
            "Tambons": [
                "ไผ่จำศีล",
                "ท่าช้าง",
                "สาวร้องไห้",
                "สี่ร้อย",
                "ยี่ล้น",
                "บางจัก",
                "ห้วยคันแหลน",
                "คลองขนาก",
                "หลักแก้ว",
                "หัวตะพาน",
                "ไผ่วง",
                "ม่วงเตี้ย",
                "ศาลเจ้าโรงทอง",
                "ไผ่ดำพัฒนา",
                "ตลาดใหม่"
            ]
        },
        "โพธิ์ทอง": {
            "PostCode": 14120,
            "Tambons": [
                "สามง่าม",
                "ทางพระ",
                "หนองแม่ไก่",
                "ยางช้าย",
                "โคกพุทรา",
                "องครักษ์",
                "โพธิ์รังนก",
                "บางระกำ",
                "รำมะสัก",
                "บางเจ้าฉ่า",
                "บางพลับ",
                "อ่างแก้ว",
                "บ่อแร่",
                "คำหยาด",
                "อินทประมูล"
            ]
        },
        "ป่าโมก": {
            "PostCode": 14130,
            "Tambons": [
                "โรงช้าง",
                "บางปลากด",
                "ป่าโมก",
                "สายทอง",
                "บางเสด็จ",
                "นรสิงห์",
                "เอกราช",
                "โผงเผง"
            ]
        },
        "ไชโย": {
            "PostCode": 14140,
            "Tambons": [
                "หลักฟ้า",
                "เทวราช",
                "ชัยฤทธิ์",
                "ไชยภูมิ",
                "จรเข้ร้อง",
                "ชะไว",
                "ตรีณรงค์",
                "ไชโย",
                "ราชสถิตย์"
            ]
        },
        "แสวงหา": {
            "PostCode": 14150,
            "Tambons": [
                "ศรีพราน",
                "แสวงหา",
                "วังน้ำเย็น",
                "สีบัวทอง",
                "ห้วยไผ่",
                "จำลอง",
                "บ้านพราน"
            ]
        },
        "สามโก้": {
            "PostCode": 14160,
            "Tambons": [
                "สามโก้",
                "ราษฎรพัฒนา",
                "อบทม",
                "โพธิ์ม่วงพันธ์",
                "มงคลธรรมนิมิต"
            ]
        }
    },
    "สิงห์บุรี": {
        "เมืองสิงห์บุรี": {
            "PostCode": 16000,
            "Tambons": [
                "บางมัญ",
                "โพกรวม",
                "บางกระบือ",
                "จักรสีห์",
                "ต้นโพธิ์",
                "หัวไผ่",
                "ม่วงหมู่",
                "บางพุทรา"
            ]
        },
        "อินทร์บุรี": {
            "PostCode": 16110,
            "Tambons": [
                "ทองเอน",
                "โพธิ์ชัย",
                "น้ำตาล",
                "ห้วยชัน",
                "ท่างาม",
                "งิ้วราย",
                "ชีน้ำร้าย",
                "ทับยา",
                "ประศุก",
                "อินทร์บุรี"
            ]
        },
        "พรหมบุรี": {
            "PostCode": 16120,
            "Tambons": [
                "หัวป่า",
                "บ้านแป้ง",
                "บางน้ำเชี่ยว",
                "พระงาม",
                "โรงช้าง",
                "บ้านหม้อ",
                "พรหมบุรี"
            ]
        },
        "บางระจัน": {
            "PostCode": 16130,
            "Tambons": [
                "ไม้ดัด",
                "สิงห์",
                "เชิงกลัด",
                "โพชนไก่",
                "แม่ลา",
                "บ้านจ่า",
                "พักทัน",
                "สระแจง"
            ]
        },
        "ท่าช้าง": {
            "PostCode": 16140,
            "Tambons": [
                "วิหารขาว",
                "ถอนสมอ",
                "โพประจักษ์",
                "พิกุลทอง"
            ]
        },
        "ค่ายบางระจัน": {
            "PostCode": 16150,
            "Tambons": [
                "โพทะเล",
                "บางระจัน",
                "โพสังโฆ",
                "ท่าข้าม",
                "คอทราย",
                "หนองกระทุ่ม"
            ]
        }
    },
    "ชัยนาท": {
        "เมืองชัยนาท": {
            "PostCode": 17000,
            "Tambons": [
                "บ้านกล้วย",
                "ในเมือง",
                "ท่าชัย",
                "ชัยนาท",
                "เขาท่าพระ",
                "เสือโฮก",
                "นางลือ",
                "ธรรมามูล",
                "หาดท่าเสา",
                "หาดท่าเสา"
            ]
        },
        "มโนรมย์": {
            "PostCode": 17110,
            "Tambons": [
                "คุ้งสำเภา",
                "ท่าฉนวน",
                "ศิลาดาน",
                "วัดโคก",
                "อู่ตะเภา",
                "หางน้ำสาคร",
                "ไร่พัฒนา",
                "วัดโคก"
            ]
        },
        "วัดสิงห์": {
            "PostCode": 17120,
            "Tambons": [
                "หนองน้อย",
                "มะขามเฒ่า",
                "หนองบัว",
                "วัดสิงห์",
                "บ่อแร่",
                "วังหมัน",
                "หนองขุ่น"
            ]
        },
        "หนองมะโมง": {
            "PostCode": 17120,
            "Tambons": [
                "หนองมะโมง",
                "กุดจอก",
                "สะพานหิน",
                "วังตะเคียน"
            ]
        },
        "เนินขาม": {
            "PostCode": 17130,
            "Tambons": [
                "เนินขาม",
                "กะบกเตี้ย",
                "สุขเดือนห้า"
            ]
        },
        "หันคา": {
            "PostCode": 17130,
            "Tambons": [
                "หันคา",
                "เด่นใหญ่",
                "วังไก่เถื่อน",
                "บ้านเชี่ยน",
                "ไพรนกยูง",
                "หนองแซง",
                "ห้วยงู",
                "สามง่ามท่าโบสถ์"
            ]
        },
        "สรรคบุรี": {
            "PostCode": 17140,
            "Tambons": [
                "บางขุด",
                "ดงคอน",
                "ห้วยกรด",
                "เที่ยงแท้",
                "แพรกศรีราชา",
                "ดอนกำ",
                "ห้วยกรดพัฒนา",
                "โพงาม"
            ]
        },
        "สรรพยา": {
            "PostCode": 17150,
            "Tambons": [
                "เขาแก้ว",
                "หาดอาษา",
                "โพนางดำตก",
                "บางหลวง",
                "โพนางดำออก",
                "ตลุก",
                "สรรพยา"
            ]
        }
    },
    "สระบุรี": {
        "เมืองสระบุรี": {
            "PostCode": 18000,
            "Tambons": [
                "ปากข้าวสาร",
                "หนองปลาไหล",
                "หนองโน",
                "หนองยาว",
                "กุดนกเปล้า",
                "ตลิ่งชัน",
                "นาโฉง",
                "ดาวเรือง",
                "ปากเพรียว",
                "โคกสว่าง",
                "ตะกุด"
            ]
        },
        "เฉลิมพระเกียรติ": {
            "PostCode": 18000,
            "Tambons": [
                "เขาดินพัฒนา",
                "บ้านแก้ง",
                "ผึ้งรวง",
                "ห้วยบง",
                "พุแค",
                "หน้าพระลาน",
                "ห้วยบง"
            ]
        },
        "แก่งคอย": {
            "PostCode": 18110,
            "Tambons": [
                "บ้านป่า",
                "ท่าตูม",
                "ท่ามะปราง",
                "ตาลเดี่ยว",
                "แก่งคอย",
                "ห้วยแห้ง",
                "หินซ้อน",
                "ท่าคล้อ",
                "เตาปูน",
                "บ้านธาตุ",
                "ชะอม",
                "ชำผักแพว",
                "สองคอน",
                "ทับกวาง"
            ]
        },
        "พระพุทธบาท": {
            "PostCode": 18120,
            "Tambons": [
                "หนองแก",
                "พุกร่าง",
                "ห้วยป่าหวาย",
                "เขาวง",
                "พุคำจาน",
                "นายาว",
                "ธารเกษม",
                "ขุนโขลน",
                "พระพุทธบาท"
            ]
        },
        "บ้านหมอ": {
            "PostCode": 18130,
            "Tambons": [
                "สร่างโศก",
                "โคกใหญ่",
                "บ้านหมอ",
                "ตลาดน้อย",
                "ไผ่ขวาง",
                "หนองบัว",
                "หรเทพ",
                "บางโขมด",
                "หรเทพ",
                "บ้านครัว",
                "บางโขมด"
            ]
        },
        "หนองแค": {
            "PostCode": 18140,
            "Tambons": [
                "หนองแขม",
                "หนองปลาหมอ",
                "หนองปลิง",
                "หนองแค",
                "กุ่มหัก",
                "หนองไข่น้ำ",
                "หนองจรเข้",
                "หนองโรง",
                "ไผ่ต่ำ",
                "บัวลอย",
                "โคกแย้",
                "หนองนาก",
                "หนองจิก",
                "ห้วยขมิ้น",
                "ห้วยทราย",
                "บัวลอย",
                "คชสิทธิ์",
                "โคกตูม",
                "โพนทอง"
            ]
        },
        "วิหารแดง": {
            "PostCode": 18150,
            "Tambons": [
                "หนองหมู",
                "เจริญธรรม",
                "บ้านลำ",
                "คลองเรือ",
                "หนองสรวง",
                "วิหารแดง"
            ]
        },
        "เสาไห้": {
            "PostCode": 18160,
            "Tambons": [
                "ศาลารีไทย",
                "ท่าช้าง",
                "ม่วงงาม",
                "เริงราง",
                "เมืองเก่า",
                "เสาไห้",
                "สวนดอกไม้",
                "บ้านยาง",
                "ต้นตาล",
                "หัวปลวก",
                "พระยาทด",
                "งิ้วงาม"
            ]
        },
        "หนองแซง": {
            "PostCode": 18170,
            "Tambons": [
                "หนองสีดา",
                "หนองควายโซ",
                "หนองกบ",
                "ไก่เส่า",
                "โคกสะอาด",
                "ม่วงหวาน",
                "หนองแซง",
                "เขาดิน",
                "หนองหัวโพ"
            ]
        },
        "มวกเหล็ก": {
            "PostCode": 18180,
            "Tambons": [
                "หนองย่างเสือ",
                "มิตรภาพ",
                "มวกเหล็ก",
                "ซับสนุ่น",
                "ลำพญากลาง",
                "ลำสมพุง"
            ]
        },
        "หนองโดน": {
            "PostCode": 18190,
            "Tambons": [
                "บ้านโปร่ง",
                "ดอนทอง",
                "บ้านกลับ",
                "หนองโดน"
            ]
        },
        "ดอนพุด": {
            "PostCode": 18210,
            "Tambons": [
                "ดงตะงาว",
                "บ้านหลวง",
                "ไผ่หลิ่ว",
                "ดอนพุด"
            ]
        },
        "วังม่วง": {
            "PostCode": 18220,
            "Tambons": [
                "แสลงพัน",
                "คำพราน",
                "วังม่วง"
            ]
        }
    },
    "ชลบุรี": {
        "เมืองชลบุรี": {
            "PostCode": 20000,
            "Tambons": [
                "คลองตำหรุ",
                "สำนักบก",
                "บางปลาสร้อย",
                "มะขามหย่ง",
                "บ้านโขด",
                "บางทราย",
                "บ้านสวน",
                "หนองไม้แดง",
                "ดอนหัวฬ่อ",
                "หนองรี",
                "นาป่า",
                "หนองข้างคอก",
                "อ่างศิลา",
                "เสม็ด",
                "ห้วยกะปิ",
                "เหมือง",
                "บ้านปึก",
                "ห้วยกะปิ",
                "เสม็ด",
                "แสนสุข"
            ]
        },
        "พานทอง": {
            "PostCode": 20000,
            "Tambons": [
                "บ้านเก่า",
                "โคกขี้หนอน",
                "เกาะลอย",
                "บางนาง",
                "บางหัก",
                "พานทอง",
                "หน้าประดู่",
                "หนองตำลึง",
                "มาบโป่ง",
                "หนองหงษ์",
                "หนองกะขะ",
                "บ้านเก่า"
            ]
        },
        "ศรีราชา": {
            "PostCode": 20110,
            "Tambons": [
                "เขาคันทรง",
                "สุรศักดิ์",
                "ศรีราชา",
                "บางพระ",
                "หนองขาม",
                "บึง",
                "ทุ่งสุขลา",
                "บ่อวิน",
                "หนองขาม"
            ]
        },
        "เกาะสีชัง": {
            "PostCode": 20120,
            "Tambons": [
                "ท่าเทววงษ์"
            ]
        },
        "พนัสนิคม": {
            "PostCode": 20140,
            "Tambons": [
                "บ้านเซิด",
                "หมอนนาง",
                "สระสี่เหลี่ยม",
                "วัดโบสถ์",
                "บ้านช้าง",
                "หนองปรือ",
                "หนองขยาด",
                "หน้าพระธาตุ",
                "หนองเหียง",
                "ไร่หลักทอง",
                "หัวถนน",
                "วัดหลวง",
                "พนัสนิคม",
                "นามะตูม",
                "ท่าข้าม",
                "ทุ่งขวาง",
                "กุฎโง้ง",
                "โคกเพลาะ",
                "นาเริก",
                "นาวังหิน",
                "นาวังหิน",
                "นาเริก"
            ]
        },
        "บางละมุง": {
            "PostCode": 20150,
            "Tambons": [
                "นาเกลือ",
                "ตะเคียนเตี้ย",
                "เขาไม้แก้ว",
                "หนองปรือ",
                "หนองปลาไหล",
                "ห้วยใหญ่",
                "บางละมุง",
                "โป่ง"
            ]
        },
        "บ้านบึง": {
            "PostCode": 20170,
            "Tambons": [
                "หนองบอนแดง",
                "หนองซ้ำซาก",
                "มาบไผ่",
                "บ้านบึง",
                "หนองชาก",
                "หนองอิรุณ",
                "คลองกิ่ว",
                "หนองไผ่แก้ว"
            ]
        },
        "สัตหีบ": {
            "PostCode": 20180,
            "Tambons": [
                "พลูตาหลวง",
                "แสมสาร",
                "สัตหีบ",
                "สัตหีบ",
                "นาจอมเทียน",
                "บางเสร่",
                "บางเสร่"
            ]
        },
        "หนองใหญ่": {
            "PostCode": 20190,
            "Tambons": [
                "หนองเสือช้าง",
                "คลองพลู",
                "หนองใหญ่",
                "ห้างสูง",
                "เขาซก"
            ]
        },
        "เกาะจันทร์": {
            "PostCode": 20240,
            "Tambons": [
                "เกาะจันทร์",
                "ท่าบุญมี"
            ]
        },
        "บ่อทอง": {
            "PostCode": 20270,
            "Tambons": [
                "เกษตรสุวรรณ",
                "ธาตุทอง",
                "บ่อกวางทอง",
                "บ่อทอง",
                "พลวงทอง",
                "วัดสุวรรณ"
            ]
        }
    },
    "ระยอง": {
        "เมืองระยอง": {
            "PostCode": 21000,
            "Tambons": [
                "น้ำคอก",
                "ทับมา",
                "ตะพง",
                "บ้านแลง",
                "ท่าประดู่",
                "ปากน้ำ",
                "เชิงเนิน",
                "นาตาขวัญ",
                "เนินพระ",
                "กะเฉด",
                "สำนักทอง",
                "ห้วยโป่ง",
                "มาบตาพุด",
                "เนินพระ",
                "เพ",
                "แกลง"
            ]
        },
        "แกลง": {
            "PostCode": 21110,
            "Tambons": [
                "เนินฆ้อ",
                "กระแสบน",
                "บ้านนา",
                "ชากโดน",
                "วังหว้า",
                "ทางเกวียน",
                "ทุ่งควายกิน",
                "ห้วยยาง",
                "สองสลึง",
                "คลองปูน",
                "ปากน้ำกระแส",
                "พังราด",
                "ชากพง",
                "กร่ำ",
                "กองดิน"
            ]
        },
        "เขาชะเมา": {
            "PostCode": 21110,
            "Tambons": [
                "ชำฆ้อ",
                "น้ำเป็น",
                "ห้วยทับมอญ",
                "เขาน้อย"
            ]
        },
        "บ้านค่าย": {
            "PostCode": 21120,
            "Tambons": [
                "บ้านค่าย",
                "หนองตะพาน",
                "ตาขัน",
                "บางบุตร",
                "หนองบัว",
                "ชากบก",
                "หนองละลอก"
            ]
        },
        "บ้านฉาง": {
            "PostCode": 21130,
            "Tambons": [
                "พลา",
                "บ้านฉาง",
                "สำนักท้อน"
            ]
        },
        "ปลวกแดง": {
            "PostCode": 21140,
            "Tambons": [
                "ปลวกแดง",
                "มาบยางพร",
                "หนองไร่",
                "แม่น้ำคู้",
                "ละหาร",
                "ตาสิทธิ์"
            ]
        },
        "นิคมพัฒนา": {
            "PostCode": 21180,
            "Tambons": [
                "มาบข่า",
                "นิคมพัฒนา",
                "พนานิคม",
                "มะขามคู่"
            ]
        },
        "วังจันทร์": {
            "PostCode": 21210,
            "Tambons": [
                "ชุมแสง",
                "ป่ายุบใน",
                "วังจันทร์",
                "พลงตาเอี่ยม"
            ]
        }
    },
    "จันทบุรี": {
        "เมืองจันทบุรี": {
            "PostCode": 22000,
            "Tambons": [
                "เกาะขวาง",
                "คมบาง",
                "คลองนารายณ์",
                "จันทนิมิต",
                "บางกะจะ",
                "ท่าช้าง",
                "พลับพลา",
                "วัดใหม่",
                "แสลง",
                "ตลาด",
                "หนองบัว"
            ]
        },
        "ขลุง": {
            "PostCode": 22110,
            "Tambons": [
                "ตรอกนอง",
                "บ่อ",
                "ตกพรม",
                "ขลุง",
                "ซึ้ง",
                "บางชัน",
                "วันยาว",
                "มาบไพ",
                "วังสรรพรส",
                "เกวียนหัก",
                "ตะปอน",
                "บ่อเวฬุ"
            ]
        },
        "ท่าใหม่": {
            "PostCode": 22120,
            "Tambons": [
                "สีพยา",
                "เขาบายศรี",
                "เขาวัว",
                "คลองขุด",
                "ตะกาดเง้า",
                "ท่าใหม่",
                "บ่อพุ",
                "พลอยแหวน",
                "ยายร้า",
                "สองพี่น้อง",
                "เขาแก้ว",
                "โขมง",
                "ทุ่งเบญจา",
                "รำพัน"
            ]
        },
        "แหลมสิงห์": {
            "PostCode": 22120,
            "Tambons": [
                "บางกะไชย",
                "ปากน้ำแหลมสิงห์",
                "หนองชิ่ม",
                "เกาะเปริด",
                "บางสระเก้า",
                "พลิ้ว",
                "คลองน้ำเค็ม"
            ]
        },
        "โป่งน้ำร้อน": {
            "PostCode": 22140,
            "Tambons": [
                "หนองตาคง",
                "โป่งน้ำร้อน",
                "คลองใหญ่",
                "ทับไทร",
                "เทพนิมิต"
            ]
        },
        "มะขาม": {
            "PostCode": 22150,
            "Tambons": [
                "ท่าหลวง",
                "ปัถวี",
                "วังแซ้ม",
                "อ่างคีรี",
                "ฉมัน",
                "มะขาม"
            ]
        },
        "แก่งหางแมว": {
            "PostCode": 22160,
            "Tambons": [
                "ขุนซ่อง",
                "พวา",
                "แก่งหางแมว",
                "สามพี่น้อง",
                "เขาวงกต"
            ]
        },
        "นายายอาม": {
            "PostCode": 22160,
            "Tambons": [
                "นายายอาม",
                "ช้างข้าม",
                "สนามไชย",
                "วังโตนด",
                "วังใหม่",
                "กระแจะ"
            ]
        },
        "สอยดาว": {
            "PostCode": 22180,
            "Tambons": [
                "สะตอน",
                "ทรายขาว",
                "ทับช้าง",
                "ทุ่งขนาน",
                "ปะตง"
            ]
        },
        "เขาคิชฌกูฏ": {
            "PostCode": 22210,
            "Tambons": [
                "พลวง",
                "ชากไทย",
                "ตะเคียนทอง",
                "จันทเขลม",
                "คลองพลู"
            ]
        }
    },
    "ตราด": {
        "เมืองตราด": {
            "PostCode": 23000,
            "Tambons": [
                "ตะกาง",
                "หนองคันทรง",
                "หนองโสน",
                "หนองเสม็ด",
                "บางพระ",
                "ห้วงน้ำขาว",
                "อ่าวใหญ่",
                "ห้วยแร้ง",
                "เนินทราย",
                "ท่าพริก",
                "ท่ากุ่ม",
                "วังกระแจะ",
                "แหลมกลัด",
                "ชำราก"
            ]
        },
        "เกาะกูด": {
            "PostCode": 23000,
            "Tambons": [
                "เกาะกูด",
                "เกาะหมาก"
            ]
        },
        "คลองใหญ่": {
            "PostCode": 23110,
            "Tambons": [
                "คลองใหญ่",
                "หาดเล็ก",
                "ไม้รูด"
            ]
        },
        "แหลมงอบ": {
            "PostCode": 23120,
            "Tambons": [
                "คลองใหญ่",
                "บางปิด",
                "น้ำเชี่ยว",
                "แหลมงอบ"
            ]
        },
        "เขาสมิง": {
            "PostCode": 23130,
            "Tambons": [
                "วังตะเคียน",
                "เขาสมิง",
                "ทุ่งนนทรี",
                "เทพนิมิต",
                "แสนตุ้ง",
                "ท่าโสม",
                "สะตอ",
                "ประณีต"
            ]
        },
        "บ่อไร่": {
            "PostCode": 23140,
            "Tambons": [
                "นนทรีย์",
                "ช้างทูน",
                "ด่านชุมพล",
                "หนองบอน",
                "บ่อพลอย"
            ]
        },
        "เกาะช้าง": {
            "PostCode": 23170,
            "Tambons": [
                "เกาะช้าง",
                "เกาะช้างใต้"
            ]
        }
    },
    "ฉะเชิงเทรา": {
        "เมืองฉะเชิงเทรา": {
            "PostCode": 24000,
            "Tambons": [
                "คลองเปรง",
                "คลองหลวงแพ่ง",
                "คลองอุดมชลจร",
                "คลองนครเนื่องเขต",
                "คลองจุกกระเฌอ",
                "คลองนา",
                "หนามแดง",
                "บางกะไห",
                "บางแก้ว",
                "บางขวัญ",
                "บางตีนเป็ด",
                "บางเตย",
                "บางไผ่",
                "บางพระ",
                "บ้านใหม่",
                "วังตะเคียน",
                "โสธร",
                "ท่าไข่",
                "หน้าเมือง"
            ]
        },
        "บางน้ำเปรี้ยว": {
            "PostCode": 24000,
            "Tambons": [
                "ศาลาแดง",
                "บางน้ำเปรี้ยว",
                "โพรงอากาศ",
                "โยธะกา",
                "สิงโตทอง",
                "หมอนทอง",
                "บางขนาก",
                "บึงน้ำรักษ์",
                "ดอนฉิมพลี",
                "ดอนเกาะกา"
            ]
        },
        "คลองเขื่อน": {
            "PostCode": 24000,
            "Tambons": [
                "ก้อนแก้ว",
                "บางโรง",
                "บางเล่า",
                "คลองเขื่อน",
                "บางตลาด"
            ]
        },
        "บางคล้า": {
            "PostCode": 24110,
            "Tambons": [
                "บางสวน",
                "เสม็ดใต้",
                "สาวชะโงก",
                "ปากน้ำ",
                "หัวไทร",
                "บางคล้า",
                "บางกระเจ็ด",
                "เสม็ดเหนือ",
                "ท่าทองหลาง"
            ]
        },
        "ราชสาส์น": {
            "PostCode": 24120,
            "Tambons": [
                "เมืองใหม่",
                "ดงน้อย",
                "บางคา"
            ]
        },
        "พนมสารคาม": {
            "PostCode": 24120,
            "Tambons": [
                "หนองแหน",
                "หนองยาว",
                "เมืองเก่า",
                "พนมสารคาม",
                "บ้านซ่อง",
                "ท่าถ่าน",
                "เขาหินซ้อน",
                "เกาะขนุน"
            ]
        },
        "บางปะกง": {
            "PostCode": 24130,
            "Tambons": [
                "หนองจอก",
                "เขาดิน",
                "บางผึ้ง",
                "สองคลอง",
                "บางปะกง",
                "ท่าสะอ้าน",
                "ท่าข้าม",
                "บางเกลือ",
                "บางวัว",
                "บางสมัคร",
                "พิมพา",
                "หอมศีล"
            ]
        },
        "บ้านโพธิ์": {
            "PostCode": 24140,
            "Tambons": [
                "สิบเอ็ดศอก",
                "แหลมประดู่",
                "หนองบัว",
                "เกาะไร่",
                "คลองบ้านโพธิ์",
                "คลองประเวศ",
                "ดอนทราย",
                "คลองขุด",
                "สนามจันทร์",
                "ท่าพลับ",
                "ลาดขวาง",
                "บ้านโพธิ์",
                "แสนภูดาษ",
                "บางซ่อน",
                "บางกรูด",
                "เทพราช",
                "หนองตีนนก"
            ]
        },
        "สนามชัยเขต": {
            "PostCode": 24160,
            "Tambons": [
                "ลาดกระทิง",
                "ทุ่งพระยา",
                "ท่ากระดาน",
                "คู้ยายหมี"
            ]
        },
        "ท่าตะเกียบ": {
            "PostCode": 24160,
            "Tambons": [
                "คลองตะเกรา",
                "ท่าตะเกียบ"
            ]
        },
        "แปลงยาว": {
            "PostCode": 24190,
            "Tambons": [
                "หัวสำโรง",
                "หนองไม้แก่น",
                "วังเย็น",
                "แปลงยาว"
            ]
        }
    },
    "ปราจีนบุรี": {
        "เมืองปราจีนบุรี": {
            "PostCode": 25000,
            "Tambons": [
                "โนนห้อม",
                "ดงขี้เหล็ก",
                "รอบเมือง",
                "บางบริบูรณ์",
                "ท่างาม",
                "ดงพระราม",
                "บางเดชะ",
                "วัดโบสถ์",
                "หน้าเมือง",
                "บ้านพระ",
                "โคกไม้ลาย",
                "เนินหอม",
                "ไม้เค็ด"
            ]
        },
        "กบินทร์บุรี": {
            "PostCode": 25110,
            "Tambons": [
                "วังท่าช้าง",
                "เขาไม้แก้ว",
                "นาแขม",
                "หนองกี่",
                "บ้านนา",
                "ลาดตะเคียน",
                "หาดนางแก้ว",
                "บ่อทอง",
                "วังดาล",
                "กบินทร์",
                "วังตะเคียน",
                "ย่านรี",
                "นนทรี",
                "เมืองเก่า"
            ]
        },
        "ประจันตคาม": {
            "PostCode": 25130,
            "Tambons": [
                "บุฝ้าย",
                "โพธิ์งาม",
                "บ้านหอย",
                "ดงบัง",
                "คำโตนด",
                "ประจันตคาม",
                "หนองแสง",
                "เกาะลอย",
                "หนองแก้ว"
            ]
        },
        "ศรีมหาโพธิ": {
            "PostCode": 25140,
            "Tambons": [
                "ท่าตูม",
                "ศรีมหาโพธิ",
                "บางกุ้ง",
                "กรอกสมบูรณ์",
                "หนองโพรง",
                "หัวหว้า",
                "หาดยาง",
                "ดงกระทงยาม",
                "บ้านทาม",
                "สัมพันธ์"
            ]
        },
        "บ้านสร้าง": {
            "PostCode": 25150,
            "Tambons": [
                "บางยาง",
                "บางขาม",
                "กระทุ่มแพ้ว",
                "บางปลาร้า",
                "บ้านสร้าง",
                "บางกระเบา",
                "บางเตย",
                "บางพลวง",
                "บางแตน"
            ]
        },
        "ศรีมโหสถ": {
            "PostCode": 25190,
            "Tambons": [
                "คู้ลำพัน",
                "โคกปีบ",
                "ไผ่ชะเลือด",
                "โคกไทย"
            ]
        },
        "นาดี": {
            "PostCode": 25220,
            "Tambons": [
                "แก่งดินสอ",
                "บุพราหมณ์",
                "นาดี",
                "สำพันตา",
                "สะพานหิน",
                "ทุ่งโพธิ์"
            ]
        }
    },
    "นครนายก": {
        "เมืองนครนายก": {
            "PostCode": 26000,
            "Tambons": [
                "นครนายก",
                "เขาพระ",
                "หินตั้ง",
                "สาริกา",
                "ดงละคร",
                "ศรีนาวา",
                "ดอนยอ",
                "ท่าทราย",
                "วังกระโจม",
                "ท่าช้าง",
                "บ้านใหญ่",
                "ศรีจุฬา",
                "พรหมณี",
                "พรหมณี"
            ]
        },
        "บ้านนา": {
            "PostCode": 26110,
            "Tambons": [
                "บ้านพริก",
                "เขาเพิ่ม",
                "บ้านนา",
                "บ้านพร้าว",
                "อาษา",
                "ศรีกะอาง",
                "ป่าขะ",
                "พิกุลออก",
                "บางอ้อ",
                "ทองหลาง"
            ]
        },
        "องครักษ์": {
            "PostCode": 26120,
            "Tambons": [
                "บึงศาล",
                "ทรายมูล",
                "ศีรษะกระบือ",
                "บางปลากด",
                "บางลูกเสือ",
                "องครักษ์",
                "พระอาจารย์",
                "โพธิ์แทน",
                "คลองใหญ่",
                "บางสมบูรณ์",
                "ชุมพล"
            ]
        },
        "ปากพลี": {
            "PostCode": 26130,
            "Tambons": [
                "เกาะโพธิ์",
                "ปากพลี",
                "โคกกรวด",
                "ท่าเรือ",
                "หนองแสง",
                "นาหินลาด",
                "เกาะหวาย"
            ]
        }
    },
    "สระแก้ว": {
        "เมืองสระแก้ว": {
            "PostCode": 27000,
            "Tambons": [
                "บ้านแก้ง",
                "สระแก้ว",
                "ศาลาลำดวน",
                "โคกปี่ฆ้อง",
                "ท่าแยก",
                "ท่าเกษม",
                "หนองบอน",
                "สระขวัญ"
            ]
        },
        "เขาฉกรรจ์": {
            "PostCode": 27000,
            "Tambons": [
                "หนองหว้า",
                "พระเพลิง",
                "เขาสามสิบ",
                "เขาฉกรรจ์"
            ]
        },
        "โคกสูง": {
            "PostCode": 27120,
            "Tambons": [
                "โคกสูง",
                "โนนหมากมุ่น",
                "หนองแวง",
                "หนองม่วง"
            ]
        },
        "อรัญประเทศ": {
            "PostCode": 27120,
            "Tambons": [
                "หันทราย",
                "ท่าข้าม",
                "เมืองไผ่",
                "อรัญประเทศ",
                "บ้านด่าน",
                "ป่าไร่",
                "ฟากห้วย",
                "คลองทับจันทร์",
                "ทับพริก",
                "คลองน้ำใส",
                "ผ่านศึก",
                "บ้านใหม่หนองไทร",
                "หนองสังข์"
            ]
        },
        "วัฒนานคร": {
            "PostCode": 27160,
            "Tambons": [
                "ช่องกุ่ม",
                "หนองตะเคียนบอน",
                "วัฒนานคร",
                "ห้วยโจด",
                "แซร์ออ",
                "หนองน้ำใส",
                "ท่าเกวียน",
                "ผักขะ",
                "หนองหมากฝ้าย",
                "โนนหมากเค็ง",
                "หนองแวง"
            ]
        },
        "ตาพระยา": {
            "PostCode": 27180,
            "Tambons": [
                "ทัพเสด็จ",
                "ทัพไทย",
                "ทัพราช",
                "โคคลาน",
                "ตาพระยา"
            ]
        },
        "วังน้ำเย็น": {
            "PostCode": 27210,
            "Tambons": [
                "ทุ่งมหาเจริญ",
                "ตาหลังใน",
                "คลองหินปูน",
                "วังน้ำเย็น"
            ]
        },
        "วังสมบูรณ์": {
            "PostCode": 27210,
            "Tambons": [
                "วังใหม่",
                "วังทอง",
                "วังสมบูรณ์",
                "วังใหม่"
            ]
        },
        "คลองหาด": {
            "PostCode": 27260,
            "Tambons": [
                "คลองหาด",
                "ไทยอุดม",
                "ซับมะกรูด",
                "ไทรเดี่ยว",
                "เบญจขร",
                "คลองไก่เถื่อน",
                "ไทรทอง"
            ]
        }
    },
    "นครราชสีมา": {
        "เมืองนครราชสีมา": {
            "PostCode": 30000,
            "Tambons": [
                "หัวทะเล",
                "หนองกระทุ่ม",
                "พะเนา",
                "สีมุม",
                "สุรนารี",
                "หมื่นไวย",
                "ปรุใหญ่",
                "หนองระเวียง",
                "มะเริง",
                "ไชยมงคล",
                "พุดซา",
                "บ้านใหม่",
                "หนองจะบก",
                "บ้านเกาะ",
                "โพธิ์กลาง",
                "หนองไผ่ล้อม",
                "ในเมือง",
                "หนองบัวศาลา",
                "พลกรัง",
                "โคกกรวด",
                "หนองไข่น้ำ",
                "ตลาด",
                "โคกสูง",
                "บ้านโพธิ์",
                "จอหอ"
            ]
        },
        "เฉลิมพระเกียรติ": {
            "PostCode": 30000,
            "Tambons": [
                "หนองงูเหลือม",
                "ช้างทอง",
                "ท่าช้าง",
                "พระพุทธ",
                "หนองยาง"
            ]
        },
        "พิมาย": {
            "PostCode": 30110,
            "Tambons": [
                "ชีวาน",
                "ท่าหลวง",
                "หนองระเวียง",
                "ธารละหลอด",
                "ดงใหญ่",
                "กระชอน",
                "นิคมสร้างตนเอง",
                "รังกาใหญ่",
                "กระเบื้องใหญ่",
                "โบสถ์",
                "สัมฤทธิ์",
                "ในเมือง"
            ]
        },
        "บัวใหญ่": {
            "PostCode": 30120,
            "Tambons": [
                "กุดจอก",
                "ด่านช้าง",
                "หนองบัวสะอาด",
                "ห้วยยาง",
                "เสมาใหญ่",
                "ดอนตะหนิน",
                "หนองแจ้งใหญ่",
                "โนนทองหลาง",
                "ขุนทอง",
                "บัวใหญ่"
            ]
        },
        "บัวลาย": {
            "PostCode": 30120,
            "Tambons": [
                "บัวลาย",
                "หนองหว้า",
                "โนนจาน",
                "เมืองพะไล"
            ]
        },
        "ปากช่อง": {
            "PostCode": 30130,
            "Tambons": [
                "ขนงพระ",
                "หนองสาหร่าย",
                "ปากช่อง",
                "จันทึก",
                "วังกะทะ",
                "หมูสี",
                "หนองน้ำแดง",
                "คลองม่วง",
                "โป่งตาลอง",
                "วังไทร",
                "กลางดง",
                "พญาเย็น"
            ]
        },
        "สีคิ้ว": {
            "PostCode": 30140,
            "Tambons": [
                "หนองบัวน้อย",
                "ดอนเมือง",
                "มิตรภาพ",
                "วังโรงใหญ่",
                "กุดน้อย",
                "หนองหญ้าขาว",
                "กฤษณา",
                "บ้านหัน",
                "สีคิ้ว",
                "หนองน้ำใส",
                "ลาดบัวขาว",
                "คลองไผ่"
            ]
        },
        "วังน้ำเขียว": {
            "PostCode": 30150,
            "Tambons": [
                "ระเริง",
                "ไทยสามัคคี",
                "อุดมทรัพย์",
                "วังหมี",
                "วังน้ำเขียว"
            ]
        },
        "ปักธงชัย": {
            "PostCode": 30150,
            "Tambons": [
                "สะแกราช",
                "ลำนางแก้ว",
                "ตะคุ",
                "นกออก",
                "ดอน",
                "ตูม",
                "งิ้ว",
                "เมืองปัก",
                "สำโรง",
                "บ่อปลาทอง",
                "เกษมทรัพย์",
                "โคกไทย",
                "สุขเกษม",
                "ธงชัยเหนือ",
                "ภูหลวง",
                "ตะขบ"
            ]
        },
        "โนนสูง": {
            "PostCode": 30160,
            "Tambons": [
                "หลุมข้าว",
                "มะค่า",
                "ดอนหวาย",
                "พลสงคราม",
                "ดอนชมพู",
                "ลำมูล",
                "บิง",
                "จันอัด",
                "ขามเฒ่า",
                "เมืองปราสาท",
                "ด่านคล้า",
                "โตนด",
                "โนนสูง",
                "ใหม่",
                "ลำคอหงษ์",
                "ธารปราสาท"
            ]
        },
        "สูงเนิน": {
            "PostCode": 30170,
            "Tambons": [
                "มะเกลือเก่า",
                "โค้งยาง",
                "โนนค่า",
                "บุ่งขี้เหล็ก",
                "โคราช",
                "เสมา",
                "มะเกลือใหม่",
                "สูงเนิน",
                "หนองตะไก้",
                "นากลาง",
                "กุดจิก"
            ]
        },
        "ประทาย": {
            "PostCode": 30180,
            "Tambons": [
                "โนนเพ็ด",
                "หันห้วยทราย",
                "ประทาย",
                "กระทุ่มราย",
                "วังไม้แดง",
                "เมืองโดน",
                "โคกกลาง",
                "ทุ่งสว่าง",
                "นางรำ",
                "ดอนมัน",
                "ตลาดไทร",
                "หนองพลวง",
                "หนองค่าย"
            ]
        },
        "โชคชัย": {
            "PostCode": 30190,
            "Tambons": [
                "ท่าลาดขาว",
                "พลับพลา",
                "ทุ่งอรุณ",
                "ท่าอ่าง",
                "ด่านเกวียน",
                "โชคชัย",
                "ท่าจะหลุง",
                "กระโทก",
                "ท่าเยี่ยม",
                "ละลมใหม่พัฒนา"
            ]
        },
        "เทพารักษ์": {
            "PostCode": 30210,
            "Tambons": [
                "หนองแวง",
                "สำนักตะคร้อ",
                "วังยายทอง",
                "บึงปรือ"
            ]
        },
        "ด่านขุนทด": {
            "PostCode": 30210,
            "Tambons": [
                "บ้านเก่า",
                "ด่านนอก",
                "พันชนะ",
                "ด่านขุนทด",
                "สระจรเข้",
                "กุดพิมาน",
                "หนองกราด",
                "หนองบัวตะเกียด",
                "ด่านใน",
                "หนองบัวละคร",
                "หินดาด",
                "ห้วยบง",
                "โนนเมืองพัฒนา",
                "ตะเคียน",
                "หนองไทร",
                "บ้านแปรง"
            ]
        },
        "โนนไทย": {
            "PostCode": 30220,
            "Tambons": [
                "กำปัง",
                "สำโรง",
                "ด่านจาก",
                "บ้านวัง",
                "ถนนโพธิ์",
                "สายออ",
                "มะค่า",
                "ค้างพลู",
                "โนนไทย",
                "บัลลังก์"
            ]
        },
        "พระทองคำ": {
            "PostCode": 30220,
            "Tambons": [
                "สระพระ",
                "มาบกราด",
                "พังเทียม",
                "ทัพรั้ง",
                "หนองหอย"
            ]
        },
        "จักราช": {
            "PostCode": 30230,
            "Tambons": [
                "ศรีละกอ",
                "หนองพลวง",
                "หนองขาม",
                "สีสุก",
                "ทองหลาง",
                "คลองเมือง",
                "จักราช",
                "หินโคน"
            ]
        },
        "ห้วยแถลง": {
            "PostCode": 30240,
            "Tambons": [
                "ตะโก",
                "ห้วยแถลง",
                "ทับสวาย",
                "เมืองพลับพลา",
                "หลุ่งตะเคียน",
                "หินดาด",
                "งิ้ว",
                "กงรถ",
                "หลุ่งประดู่",
                "ห้วยแคน"
            ]
        },
        "ครบุรี": {
            "PostCode": 30250,
            "Tambons": [
                "สระว่านพระยา",
                "แชะ",
                "บ้านใหม่",
                "ครบุรี",
                "ตะแบกบาน",
                "เฉลียง",
                "ลำเพียก",
                "ครบุรีใต้",
                "มาบตะโกเอน",
                "จระเข้หิน",
                "โคกกระชาย",
                "อรพิมพ์"
            ]
        },
        "คง": {
            "PostCode": 30260,
            "Tambons": [
                "เทพาลัย",
                "คูขาด",
                "ตาจั่น",
                "บ้านปรางค์",
                "หนองมะนาว",
                "หนองบัว",
                "โนนเต็ง",
                "เมืองคง",
                "ขามสมบูรณ์",
                "ดอนใหญ่"
            ]
        },
        "เมืองยาง": {
            "PostCode": 30270,
            "Tambons": [
                "ละหานปลาค้าว",
                "โนนอุดม",
                "เมืองยาง",
                "กระเบื้องนอก"
            ]
        },
        "ชุมพวง": {
            "PostCode": 30270,
            "Tambons": [
                "โนนยอ",
                "โนนตูม",
                "หนองหลัก",
                "โนนรัง",
                "ตลาดไทร",
                "สาหร่าย",
                "ท่าลาด",
                "ประสุข",
                "ชุมพวง"
            ]
        },
        "ลำทะเมนชัย": {
            "PostCode": 30270,
            "Tambons": [
                "ไพล",
                "บ้านยาง",
                "ขุย",
                "ช่องแมว"
            ]
        },
        "ขามทะเลสอ": {
            "PostCode": 30280,
            "Tambons": [
                "หนองสรวง",
                "ขามทะเลสอ",
                "พันดุง",
                "บึงอ้อ",
                "โป่งแดง"
            ]
        },
        "ขามสะแกแสง": {
            "PostCode": 30290,
            "Tambons": [
                "พะงาด",
                "เมืองเกษตร",
                "ชีวึก",
                "หนองหัวฟาน",
                "เมืองนาท",
                "ขามสะแกแสง",
                "โนนเมือง"
            ]
        },
        "เสิงสาง": {
            "PostCode": 30330,
            "Tambons": [
                "บ้านราษฎร์",
                "กุดโบสถ์",
                "โนนสมบูรณ์",
                "สระตะเคียน",
                "เสิงสาง",
                "สุขไพบูลย์"
            ]
        },
        "บ้านเหลื่อม": {
            "PostCode": 30350,
            "Tambons": [
                "ช่อระกา",
                "โคกกระเบื้อง",
                "วังโพธิ์",
                "บ้านเหลื่อม"
            ]
        },
        "โนนแดง": {
            "PostCode": 30360,
            "Tambons": [
                "ดอนยาวใหญ่",
                "สำพะเนียง",
                "โนนตาเถร",
                "โนนแดง",
                "วังหิน"
            ]
        },
        "หนองบุญมาก": {
            "PostCode": 30410,
            "Tambons": [
                "หนองบุนนาก",
                "สารภี",
                "ไทยเจริญ",
                "ลุงเขว้า",
                "หนองหัวแรต",
                "หนองไม้ไผ่",
                "บ้านใหม่",
                "แหลมทอง",
                "หนองตะไก้"
            ]
        },
        "สีดา": {
            "PostCode": 30430,
            "Tambons": [
                "หนองตาดใหญ่",
                "สามเมือง",
                "โนนประดู่",
                "โพนทอง",
                "สีดา"
            ]
        },
        "แก้งสนามนาง": {
            "PostCode": 30440,
            "Tambons": [
                "สีสุก",
                "แก้งสนามนาง",
                "โนนสำราญ",
                "บึงพะไล",
                "บึงสำโรง"
            ]
        }
    },
    "บุรีรัมย์": {
        "ห้วยราช": {
            "PostCode": 31000,
            "Tambons": [
                "ห้วยราชา",
                "โคกเหล็ก",
                "เมืองโพธิ์",
                "สนวน",
                "ห้วยราช",
                "สามแวง",
                "ตาเสา",
                "บ้านตะโก"
            ]
        },
        "บ้านด่าน": {
            "PostCode": 31000,
            "Tambons": [
                "บ้านด่าน",
                "ปราสาท",
                "วังเหนือ",
                "โนนขวาง"
            ]
        },
        "เมืองบุรีรัมย์": {
            "PostCode": 31000,
            "Tambons": [
                "เมืองฝาง",
                "กระสัง",
                "กลันทา",
                "สะแกซำ",
                "หลักเขต",
                "ชุมเห็ด",
                "บัวทอง",
                "ลุมปุ๊ก",
                "สองห้อง",
                "หนองตาด",
                "ในเมือง",
                "อิสาณ",
                "เสม็ด",
                "สะแกโพรง",
                "บ้านบัว",
                "บ้านยาง",
                "พระครู",
                "ถลุงเหล็ก",
                "สวายจีก"
            ]
        },
        "โนนสุวรรณ": {
            "PostCode": 31110,
            "Tambons": [
                "ทุ่งจังหัน",
                "โนนสุวรรณ",
                "โกรกแก้ว",
                "ดงอีจาน"
            ]
        },
        "นางรอง": {
            "PostCode": 31110,
            "Tambons": [
                "หนองกง",
                "ถนนหัก",
                "หนองโบสถ์",
                "ชุมแสง",
                "สะเดา",
                "นางรอง",
                "หนองไทร",
                "บ้านสิงห์",
                "ก้านเหลือง",
                "ทรัพย์พระยา",
                "หนองยายพิมพ์",
                "หัวถนน",
                "ทุ่งแสงทอง",
                "หนองโสน",
                "ลำไทรโยง"
            ]
        },
        "ชำนิ": {
            "PostCode": 31110,
            "Tambons": [
                "หนองปล่อง",
                "ชำนิ",
                "โคกสนวน",
                "ละลวด",
                "ช่อผกา",
                "เมืองยาง"
            ]
        },
        "เฉลิมพระเกียรติ": {
            "PostCode": 31110,
            "Tambons": [
                "อีสานเขต",
                "ตาเป๊ก",
                "เจริญสุข",
                "ยายแย้มวัฒนา",
                "ถาวร"
            ]
        },
        "พุทไธสง": {
            "PostCode": 31120,
            "Tambons": [
                "บ้านยาง",
                "พุทไธสง",
                "บ้านจาน",
                "บ้านเป้า",
                "บ้านแวง",
                "หายโศก",
                "มะเฟือง"
            ]
        },
        "บ้านใหม่ไชยพจน์": {
            "PostCode": 31120,
            "Tambons": [
                "แดงใหญ่",
                "หนองแวง",
                "หนองเยือง",
                "กู่สวนแตง",
                "ทองหลาง"
            ]
        },
        "ลำปลายมาศ": {
            "PostCode": 31130,
            "Tambons": [
                "แสลงพัน",
                "ทะเมนชัย",
                "ตลาดโพธิ์",
                "หนองกะทิง",
                "บุโพธิ์",
                "โคกกลาง",
                "โคกสะอาด",
                "เมืองแฝก",
                "บ้านยาง",
                "ผไทรินทร์",
                "โคกล่าม",
                "หินโคน",
                "หนองคู",
                "ลำปลายมาศ",
                "หนองโดน",
                "หนองบัวโคก"
            ]
        },
        "ประโคนชัย": {
            "PostCode": 31140,
            "Tambons": [
                "แสลงโทน",
                "ละเวี้ย",
                "จรเข้มาก",
                "ปังกู",
                "สี่เหลี่ยม",
                "โคกย่าง",
                "ประทัดบุ",
                "โคกตูม",
                "โคกมะขาม",
                "หนองบอน",
                "เขาคอก",
                "ตะโกตาพิ",
                "ไพศาล",
                "ประโคนชัย",
                "บ้านไทร",
                "โคกม้า"
            ]
        },
        "แคนดง": {
            "PostCode": 31150,
            "Tambons": [
                "สระบัว",
                "หัวฝาย",
                "ดงพลอง",
                "แคนดง"
            ]
        },
        "สตึก": {
            "PostCode": 31150,
            "Tambons": [
                "เมืองแก",
                "หนองใหญ่",
                "ร่อนทอง",
                "ดอนมนต์",
                "สตึก",
                "นิคม",
                "ชุมแสง",
                "ท่าม่วง",
                "สะแก",
                "สนามชัย",
                "กระสัง",
                "ทุ่งวัง"
            ]
        },
        "กระสัง": {
            "PostCode": 31160,
            "Tambons": [
                "กระสัง",
                "เมืองไผ่",
                "หนองเต็ง",
                "สองชั้น",
                "ศรีภูมิ",
                "สูงเนิน",
                "ลำดวน",
                "บ้านปรือ",
                "ชุมแสง",
                "กันทรารมย์",
                "ห้วยสำราญ"
            ]
        },
        "ละหานทราย": {
            "PostCode": 31170,
            "Tambons": [
                "สำโรงใหม่",
                "หนองแวง",
                "ตาจง",
                "ละหานทราย",
                "โคกว่าน",
                "หนองตะครอง"
            ]
        },
        "บ้านกรวด": {
            "PostCode": 31180,
            "Tambons": [
                "ปราสาท",
                "สายตะกู",
                "บึงเจริญ",
                "จันทบเพชร",
                "หินลาด",
                "เขาดินเหนือ",
                "หนองไม้งาม",
                "โนนเจริญ",
                "บ้านกรวด"
            ]
        },
        "คูเมือง": {
            "PostCode": 31190,
            "Tambons": [
                "พรสำราญ",
                "บ้านแพ",
                "ปะเคียบ",
                "คูเมือง",
                "ตูมใหญ่",
                "หนองขมาร",
                "หินเหล็กไฟ"
            ]
        },
        "หนองกี่": {
            "PostCode": 31210,
            "Tambons": [
                "ทุ่งกระตาดพัฒนา",
                "เมืองไผ่",
                "โคกสว่าง",
                "โคกสูง",
                "บุกระสัง",
                "ทุ่งกระเต็น",
                "เย้ยปราสาท",
                "ดอนอะราง",
                "ท่าโพธิ์ชัย",
                "หนองกี่"
            ]
        },
        "ปะคำ": {
            "PostCode": 31220,
            "Tambons": [
                "ปะคำ",
                "โคกมะม่วง",
                "ไทยเจริญ",
                "หนองบัว",
                "หูทำนบ"
            ]
        },
        "นาโพธิ์": {
            "PostCode": 31230,
            "Tambons": [
                "นาโพธิ์",
                "บ้านคู",
                "บ้านดู่",
                "ดอนกอก",
                "ศรีสว่าง"
            ]
        },
        "หนองหงส์": {
            "PostCode": 31240,
            "Tambons": [
                "สระแก้ว",
                "ห้วยหิน",
                "สระทอง",
                "เมืองฝ้าย",
                "หนองชัยศรี",
                "ไทยสามัคคี",
                "เสาเดียว"
            ]
        },
        "พลับพลาชัย": {
            "PostCode": 31250,
            "Tambons": [
                "โคกขมิ้น",
                "จันดุม",
                "ป่าชัน",
                "สำโรง",
                "สะเดา"
            ]
        },
        "โนนดินแดง": {
            "PostCode": 31260,
            "Tambons": [
                "ลำนางรอง",
                "โนนดินแดง",
                "ส้มป่อย"
            ]
        }
    },
    "สุรินทร์": {
        "เขวาสินรินทร์": {
            "PostCode": 32000,
            "Tambons": [
                "เขวาสินรินทร์",
                "ตากูก",
                "ปราสาททอง",
                "บ้านแร่",
                "บึง"
            ]
        },
        "เมืองสุรินทร์": {
            "PostCode": 32000,
            "Tambons": [
                "บุฤาษี",
                "ในเมือง",
                "คอโค",
                "สำโรง",
                "ตาอ็อง",
                "สวาย",
                "สลักได",
                "ท่าสว่าง",
                "เฉนียง",
                "นาดี",
                "เพี้ยราม",
                "เทนมีย์",
                "ตั้งใจ",
                "นาบัว",
                "เมืองที",
                "นอกเมือง",
                "ตระแสง",
                "แกใหญ่",
                "แสลงพันธ์",
                "กาเกาะ",
                "ราม"
            ]
        },
        "ศีขรภูมิ": {
            "PostCode": 32110,
            "Tambons": [
                "กุดหวาย",
                "แตล",
                "หนองเหล็ก",
                "ยาง",
                "จารพัต",
                "ผักไหม",
                "ตรมไพร",
                "ระแงง",
                "ตรึม",
                "นารุ่ง",
                "ช่างปี่",
                "ขวาวใหญ่",
                "คาละแมะ",
                "หนองขวาว",
                "หนองบัว"
            ]
        },
        "ท่าตูม": {
            "PostCode": 32120,
            "Tambons": [
                "บะ",
                "โพนครก",
                "ทุ่งกุลา",
                "หนองเมธี",
                "กระโพ",
                "บัวโคก",
                "ท่าตูม",
                "พรมเทพ",
                "หนองบัว",
                "เมืองแก"
            ]
        },
        "รัตนบุรี": {
            "PostCode": 32130,
            "Tambons": [
                "ทับใหญ่",
                "ดอนแรด",
                "กุดขาคีม",
                "น้ำเขียว",
                "เบิด",
                "หนองบัวบาน",
                "หนองบัวทอง",
                "ยางสว่าง",
                "ไผ่",
                "ธาตุ",
                "รัตนบุรี",
                "แก"
            ]
        },
        "โนนนารายณ์": {
            "PostCode": 32130,
            "Tambons": [
                "ระเวียง",
                "หนองเทพ",
                "โนน",
                "คำผง",
                "หนองหลวง"
            ]
        },
        "พนมดงรัก": {
            "PostCode": 32140,
            "Tambons": [
                "ตาเมียง",
                "จีกแดก",
                "โคกกลาง",
                "บักได"
            ]
        },
        "ปราสาท": {
            "PostCode": 32140,
            "Tambons": [
                "โคกสะอาด",
                "ตาเบา",
                "บ้านพลวง",
                "ทุ่งมน",
                "ปรือ",
                "กันตวจระมวล",
                "ไพล",
                "บ้านไทร",
                "โชคนาสาม",
                "กังแอน",
                "เชื้อเพลิง",
                "ปราสาททนง",
                "โคกยาง",
                "ตานี",
                "ประทัดบุ",
                "สมุด",
                "ทมอ",
                "หนองใหญ่"
            ]
        },
        "สังขะ": {
            "PostCode": 32150,
            "Tambons": [
                "ขอนแตก",
                "ดม",
                "สังขะ",
                "พระแก้ว",
                "บ้านจารย์",
                "กระเทียม",
                "สะกาด",
                "ตาตุม",
                "ทับทัน",
                "ตาคง",
                "บ้านชบ",
                "เทพรักษา"
            ]
        },
        "ศรีณรงค์": {
            "PostCode": 32150,
            "Tambons": [
                "แจนแวน",
                "ศรีสุข",
                "ตรวจ",
                "ณรงค์",
                "หนองแวง"
            ]
        },
        "สนม": {
            "PostCode": 32160,
            "Tambons": [
                "หนองอียอ",
                "หัวงัว",
                "แคน",
                "นานวน",
                "สนม",
                "หนองระฆัง",
                "โพนโก"
            ]
        },
        "สำโรงทาบ": {
            "PostCode": 32170,
            "Tambons": [
                "ศรีสุข",
                "สำโรงทาบ",
                "กระออม",
                "สะโน",
                "หนองฮะ",
                "หนองไผ่ล้อม",
                "เสม็จ",
                "เกาะแก้ว",
                "หมื่นศรี",
                "ประดู่"
            ]
        },
        "จอมพระ": {
            "PostCode": 32180,
            "Tambons": [
                "หนองสนิท",
                "จอมพระ",
                "กระหาด",
                "บุแกรง",
                "ชุมแสง",
                "เมืองลีง",
                "เป็นสุข",
                "ลุ่มระวี",
                "บ้านผือ"
            ]
        },
        "ชุมพลบุรี": {
            "PostCode": 32190,
            "Tambons": [
                "ยะวึก",
                "เมืองบัว",
                "นาหนองไผ่",
                "ชุมพลบุรี",
                "สระขุด",
                "กระเบื้อง",
                "ศรีณรงค์",
                "ไพรขลา",
                "หนองเรือ"
            ]
        },
        "กาบเชิง": {
            "PostCode": 32210,
            "Tambons": [
                "กาบเชิง",
                "ด่าน",
                "แนงมุด",
                "คูตัน",
                "โคกตะเคียน",
                "ตะเคียน"
            ]
        },
        "ลำดวน": {
            "PostCode": 32220,
            "Tambons": [
                "ตรำดม",
                "ลำดวน",
                "โชคเหนือ",
                "อู่โลก",
                "ตระเปียงเตีย"
            ]
        },
        "บัวเชด": {
            "PostCode": 32230,
            "Tambons": [
                "สำเภาลูน",
                "บัวเชด",
                "จรัส",
                "ตาวัง",
                "สะเดา",
                "อาโพน"
            ]
        }
    },
    "ศรีสะเกษ": {
        "เมืองศรีสะเกษ": {
            "PostCode": 33000,
            "Tambons": [
                "ทุ่ม",
                "โพนข่า",
                "เมืองเหนือ",
                "หมากเขียบ",
                "ซำ",
                "เมืองใต้",
                "โพธิ์",
                "โพนค้อ",
                "จาน",
                "คูซอด",
                "ตะดอบ",
                "หนองครก",
                "หนองไฮ",
                "หญ้าปล้อง",
                "โพนเขวา",
                "น้ำคำ",
                "หนองแก้ว",
                "หนองไผ่"
            ]
        },
        "กันทรลักษ์": {
            "PostCode": 33110,
            "Tambons": [
                "บึงมะลู",
                "เมือง",
                "สังเม็ก",
                "น้ำอ้อม",
                "ละลาย",
                "รุง",
                "ตระกาจ",
                "จานใหญ่",
                "กระแชง",
                "ชำ",
                "โนนสำราญ",
                "หนองหญ้าลาด",
                "ขนุน",
                "สวนกล้วย",
                "เวียงเหนือ",
                "ทุ่งใหญ่",
                "ภูผาหมอก",
                "ภูเงิน",
                "เสาธงชัย",
                "กุดเสลา"
            ]
        },
        "เบญจลักษ์": {
            "PostCode": 33110,
            "Tambons": [
                "ท่าคล้อ",
                "หนองฮาง",
                "หนองงูเหลือม",
                "หนองหว้า",
                "เสียว"
            ]
        },
        "อุทุมพรพิสัย": {
            "PostCode": 33120,
            "Tambons": [
                "แข้",
                "สระกำแพงใหญ่",
                "หนองห้าง",
                "ปะอาว",
                "โพธิ์ชัย",
                "แต้",
                "รังแร้ง",
                "หัวช้าง",
                "ตาเกษ",
                "ขะยูง",
                "โคกหล่าม",
                "โคกจาน",
                "อี่หล่ำ",
                "ก้านเหลือง",
                "ทุ่งไชย",
                "สำโรง",
                "แขม",
                "หนองไฮ",
                "กำแพง"
            ]
        },
        "เมืองจันทร์": {
            "PostCode": 33120,
            "Tambons": [
                "หนองใหญ่",
                "ตาโกน",
                "เมืองจันทร์"
            ]
        },
        "โพธิ์ศรีสุวรรณ": {
            "PostCode": 33120,
            "Tambons": [
                "อีเซ",
                "ผือใหญ่",
                "หนองม้า",
                "เสียว",
                "โดด"
            ]
        },
        "กันทรารมย์": {
            "PostCode": 33130,
            "Tambons": [
                "ดูน",
                "โนนสัง",
                "ยาง",
                "ละทาย",
                "เมืองน้อย",
                "อีปาด",
                "บัวน้อย",
                "หนองหัวช้าง",
                "ทาม",
                "หนองบัว",
                "ดู่",
                "ผักแพว",
                "จาน",
                "คำเนียม",
                "หนองแวง",
                "หนองแก้ว"
            ]
        },
        "น้ำเกลี้ยง": {
            "PostCode": 33130,
            "Tambons": [
                "เขิน",
                "คูบ",
                "รุ่งระวี",
                "ตองปิด",
                "ละเอาะ",
                "น้ำเกลี้ยง"
            ]
        },
        "ขุขันธ์": {
            "PostCode": 33140,
            "Tambons": [
                "ตะเคียน",
                "หัวเสือ",
                "หนองฉลอง",
                "ห้วยใต้",
                "นิคมพัฒนา",
                "ห้วยเหนือ",
                "กฤษณา",
                "โคกเพชร",
                "ห้วยสำราญ",
                "สำโรงตาเจ็น",
                "ปราสาท",
                "ลมศักดิ์",
                "ตาอุด",
                "ปรือใหญ่",
                "โสน",
                "ดองกำเม็ด",
                "ใจดี",
                "จะกง",
                "กันทรารมย์",
                "ศรีตระกูล",
                "สะเดาใหญ่",
                "ศรีสะอาด"
            ]
        },
        "ภูสิงห์": {
            "PostCode": 33140,
            "Tambons": [
                "โคกตาล",
                "ห้วยตามอญ",
                "ไพรพัฒนา",
                "ดงรัก",
                "ตะเคียนราม",
                "ละลม",
                "ห้วยตึ๊กชู"
            ]
        },
        "ขุนหาญ": {
            "PostCode": 33150,
            "Tambons": [
                "กันทรอม",
                "ห้วยจันทร์",
                "โพธิ์กระสังข์",
                "ภูฝ้าย",
                "โนนสูง",
                "ขุนหาญ",
                "กระหวัน",
                "ไพร",
                "โพธิ์วงศ์",
                "พราน",
                "บักดอง",
                "สิ"
            ]
        },
        "ราษีไศล": {
            "PostCode": 33160,
            "Tambons": [
                "เมืองแคน",
                "เมืองคง",
                "จิกสังข์ทอง",
                "ด่าน",
                "หนองอึ่ง",
                "บัวหุ่ง",
                "ไผ่",
                "ส้มป่อย",
                "หนองหมี",
                "หว้านคำ",
                "สร้างปี่",
                "ดู่",
                "หนองแค"
            ]
        },
        "ศิลาลาด": {
            "PostCode": 33160,
            "Tambons": [
                "กุง",
                "คลีกลิ้ง",
                "หนองบัวดง",
                "โจดม่วง"
            ]
        },
        "ปรางค์กู่": {
            "PostCode": 33170,
            "Tambons": [
                "โพธิ์ศรี",
                "สมอ",
                "พิมายเหนือ",
                "สวาย",
                "ดู่",
                "สำโรงปราสาท",
                "กู่",
                "พิมาย",
                "ตูม",
                "หนองเชียงทูน"
            ]
        },
        "ไพรบึง": {
            "PostCode": 33180,
            "Tambons": [
                "ไพรบึง",
                "ดินแดง",
                "ปราสาทเยอ",
                "สำโรงพลัน",
                "สุขสวัสดิ์",
                "โนนปูน"
            ]
        },
        "ยางชุมน้อย": {
            "PostCode": 33190,
            "Tambons": [
                "ยางชุมใหญ่",
                "คอนกาม",
                "กุดเมืองฮาม",
                "โนนคูณ",
                "ลิ้นฟ้า",
                "บึงบอน",
                "ยางชุมน้อย"
            ]
        },
        "ห้วยทับทัน": {
            "PostCode": 33210,
            "Tambons": [
                "ห้วยทับทัน",
                "เมืองหลวง",
                "กล้วยกว้าง",
                "ผักไหม",
                "จานแสนไชย",
                "ปราสาท"
            ]
        },
        "บึงบูรพ์": {
            "PostCode": 33220,
            "Tambons": [
                "เป๊าะ",
                "บึงบูรพ์"
            ]
        },
        "พยุห์": {
            "PostCode": 33230,
            "Tambons": [
                "พยุห์",
                "หนองค้า",
                "โนนเพ็ก",
                "ตำแย",
                "พรหมสวัสดิ์"
            ]
        },
        "ศรีรัตนะ": {
            "PostCode": 33240,
            "Tambons": [
                "ศรีแก้ว",
                "เสื่องข้าว",
                "พิงพวย",
                "สระเยาว์",
                "ตูม",
                "ศรีโนนงาม",
                "สะพุง"
            ]
        },
        "โนนคูณ": {
            "PostCode": 33250,
            "Tambons": [
                "หนองกุง",
                "บก",
                "โนนค้อ",
                "เหล่ากวาง",
                "โพธิ์"
            ]
        },
        "วังหิน": {
            "PostCode": 33270,
            "Tambons": [
                "ทุ่งสว่าง",
                "บุสูง",
                "ธาตุ",
                "ดวนใหญ่",
                "บ่อแก้ว",
                "ศรีสำราญ",
                "โพนยาง",
                "วังหิน"
            ]
        }
    },
    "อุบลราชธานี": {
        "เมืองอุบลราชธานี": {
            "PostCode": 34000,
            "Tambons": [
                "ไร่น้อย",
                "ปะอาว",
                "ขี้เหล็ก",
                "กุดลาด",
                "ในเมือง",
                "หัวเรือ",
                "หนองขอน",
                "ปทุม",
                "ขามใหญ่",
                "กระโสบ",
                "หนองบ่อ",
                "แจระแม"
            ]
        },
        "เหล่าเสือโก้ก": {
            "PostCode": 34000,
            "Tambons": [
                "โพนเมือง",
                "เหล่าเสือโก้ก",
                "แพงใหญ่",
                "หนองบก"
            ]
        },
        "ดอนมดแดง": {
            "PostCode": 34000,
            "Tambons": [
                "ดอนมดแดง",
                "คำไฮใหญ่",
                "ท่าเมือง",
                "เหล่าแดง"
            ]
        },
        "พิบูลมังสาหาร": {
            "PostCode": 34110,
            "Tambons": [
                "โพธิ์ไทร",
                "กุดชมภู",
                "ระเว",
                "ไร่ใต้",
                "หนองบัวฮี",
                "อ่างศิลา",
                "โนนกาหลง",
                "บ้านแขม",
                "ดอนจิก",
                "ทรายมูล",
                "นาโพธิ์",
                "พิบูล",
                "โพธิ์ศรี",
                "โนนกลาง"
            ]
        },
        "ตระการพืชผล": {
            "PostCode": 34130,
            "Tambons": [
                "นาสะไม",
                "ตระการ",
                "ตากแดด",
                "คอนสาย",
                "ไหล่ทุ่ง",
                "เป้า",
                "ขามเปี้ย",
                "นาพิน",
                "เซเป็ด",
                "ห้วยฝ้ายพัฒนา",
                "สะพือ",
                "เกษม",
                "ท่าหลวง",
                "ถ้ำแข้",
                "หนองเต่า",
                "กุดยาลวน",
                "บ้านแดง",
                "กุศกร",
                "โนนกุง",
                "ขุหลุ",
                "โคกจาน",
                "คำเจริญ",
                "กระเดียน"
            ]
        },
        "ม่วงสามสิบ": {
            "PostCode": 34140,
            "Tambons": [
                "หนองฮาง",
                "ม่วงสามสิบ",
                "เหล่าบก",
                "ดุมใหญ่",
                "หนองช้างใหญ่",
                "หนองเมือง",
                "เตย",
                "ยางสักกระโพหลุ่ม",
                "หนองไข่นก",
                "หนองเหล่า",
                "โพนแพง",
                "นาเลิง",
                "ยางโยภาพ",
                "ไผ่ใหญ่"
            ]
        },
        "เขื่องใน": {
            "PostCode": 34150,
            "Tambons": [
                "ธาตุน้อย",
                "สหธาตุ",
                "ศรีสุข",
                "ยางขี้นก",
                "ชีทวน",
                "เขื่องใน",
                "สร้างถ่อ",
                "ค้อทอง",
                "ก่อเอ้",
                "ท่าไห",
                "หนองเหล่า",
                "หัวดอน",
                "แดงหม้อ",
                "นาคำใหญ่",
                "บ้านไทย",
                "โนนรัง",
                "กลางใหญ่",
                "บ้านกอก"
            ]
        },
        "เดชอุดม": {
            "PostCode": 34160,
            "Tambons": [
                "นาส่วง",
                "บัวงาม",
                "ท่าโพธิ์ศรี",
                "โพนงาม",
                "ป่าโมง",
                "โนนสมบูรณ์",
                "แก้ง",
                "เมืองเดช",
                "ตบหู",
                "กุดประทาย",
                "สมสะอาด",
                "ทุ่งเทิง",
                "นาเจริญ",
                "กลาง",
                "นากระแซง",
                "คำครั่ง"
            ]
        },
        "นาเยีย": {
            "PostCode": 34160,
            "Tambons": [
                "นาเรือง",
                "นาเยีย",
                "นาดี"
            ]
        },
        "ทุ่งศรีอุดม": {
            "PostCode": 34160,
            "Tambons": [
                "นาห่อม",
                "โคกชำแระ",
                "กุดเรือ",
                "นาเกษม",
                "หนองอ้ม"
            ]
        },
        "นาตาล": {
            "PostCode": 34170,
            "Tambons": [
                "กองโพน",
                "นาตาล",
                "พะลาน",
                "พังเคน"
            ]
        },
        "เขมราฐ": {
            "PostCode": 34170,
            "Tambons": [
                "หนองนกทา",
                "แก้งเหนือ",
                "หนองสิม",
                "นาแวง",
                "เจียด",
                "ขามป้อม",
                "เขมราฐ",
                "หนองผือ",
                "หัวนา"
            ]
        },
        "วารินชำราบ": {
            "PostCode": 34190,
            "Tambons": [
                "โนนโหนน",
                "คูเมือง",
                "สระสมิง",
                "โพธิ์ใหญ่",
                "คำน้ำแซบ",
                "วารินชำราบ",
                "ธาตุ",
                "คำขวาง",
                "เมืองศรีไค",
                "โนนผึ้ง",
                "บุ่งไหม",
                "แสนสุข",
                "หนองกินเพล",
                "ห้วยขะยุง",
                "บุ่งหวาย",
                "ท่าลาด"
            ]
        },
        "สว่างวีระวงศ์": {
            "PostCode": 34190,
            "Tambons": [
                "สว่าง",
                "บุ่งมะแลง",
                "ท่าช้าง",
                "แก่งโดม"
            ]
        },
        "โขงเจียม": {
            "PostCode": 34220,
            "Tambons": [
                "หนองแสงใหญ่",
                "นาโพธิ์กลาง",
                "ห้วยไผ่",
                "ห้วยยาง",
                "โขงเจียม"
            ]
        },
        "บุณฑริก": {
            "PostCode": 34230,
            "Tambons": [
                "บ้านแมด",
                "บัวงาม",
                "โนนค้อ",
                "นาโพธิ์",
                "คอแลน",
                "หนองสะโน",
                "ห้วยข่า",
                "โพนงาม"
            ]
        },
        "ศรีเมืองใหม่": {
            "PostCode": 34250,
            "Tambons": [
                "เอือดใหญ่",
                "วาริน",
                "แก้งกอก",
                "คำไหล",
                "สงยาง",
                "ตะบ่าย",
                "หนามแท่ง",
                "นาเลิน",
                "ลาดควาย",
                "ดอนใหญ่",
                "นาคำ"
            ]
        },
        "น้ำยืน": {
            "PostCode": 34260,
            "Tambons": [
                "ยาง",
                "สีวิเชียร",
                "ยางใหญ่",
                "เก่าขาม",
                "บุเปือย",
                "โซง",
                "โดมประดิษฐ์"
            ]
        },
        "น้ำขุ่น": {
            "PostCode": 34260,
            "Tambons": [
                "ขี้เหล็ก",
                "โคกสะอาด",
                "ไพบูลย์",
                "ตาเกา"
            ]
        },
        "กุดข้าวปุ้น": {
            "PostCode": 34270,
            "Tambons": [
                "แก่งเค็ง",
                "กาบิน",
                "หนองทันน้ำ",
                "โนนสวาง",
                "ข้าวปุ้น"
            ]
        },
        "นาจะหลวย": {
            "PostCode": 34280,
            "Tambons": [
                "พรสวรรค์",
                "โนนสมบูรณ์",
                "นาจะหลวย",
                "โสกแสง",
                "โนนสวรรค์",
                "บ้านตูม"
            ]
        },
        "ตาลสุม": {
            "PostCode": 34330,
            "Tambons": [
                "สำโรง",
                "จิกเทิง",
                "หนองกุง",
                "นาคาย",
                "คำหว้า",
                "ตาลสุม"
            ]
        },
        "โพธิ์ไทร": {
            "PostCode": 34340,
            "Tambons": [
                "เหล่างาม",
                "สำโรง",
                "ม่วงใหญ่",
                "สารภี",
                "โพธิ์ไทร",
                "สองคอน"
            ]
        },
        "สิรินธร": {
            "PostCode": 34350,
            "Tambons": [
                "ช่องเม็ก",
                "ฝางคำ",
                "คำเขื่อนแก้ว",
                "นิคมสร้างตนเองลำโดมน้อย",
                "โนนก่อ",
                "คันไร่"
            ]
        },
        "สำโรง": {
            "PostCode": 34360,
            "Tambons": [
                "โนนกลาง",
                "ค้อน้อย",
                "ขามป้อม",
                "บอน",
                "หนองไฮ",
                "สำโรง",
                "โนนกาเล็น",
                "โคกสว่าง",
                "โคกก่อง"
            ]
        }
    },
    "ยโสธร": {
        "เมืองยโสธร": {
            "PostCode": 35000,
            "Tambons": [
                "ในเมือง",
                "หนองเรือ",
                "ทุ่งนางโอก",
                "ขุมเงิน",
                "หนองคู",
                "หนองหิน",
                "เขื่องคำ",
                "นาสะไมย์",
                "สิงห์",
                "ขั้นไดใหญ่",
                "เดิด",
                "ดู่ทุ่ง",
                "ค้อเหนือ",
                "สำราญ",
                "ตาดทอง",
                "น้ำคำใหญ่",
                "ทุ่งแต้",
                "หนองเป็ด"
            ]
        },
        "คำเขื่อนแก้ว": {
            "PostCode": 35110,
            "Tambons": [
                "เหล่าไฮ",
                "กุดกุง",
                "ดงเจริญ",
                "กู่จาน",
                "ทุ่งมน",
                "โพนทัน",
                "สงเปือย",
                "ย่อ",
                "ลุมพุก",
                "นาคำ",
                "ดงแคนใหญ่",
                "แคนน้อย",
                "นาแก"
            ]
        },
        "ไทยเจริญ": {
            "PostCode": 35120,
            "Tambons": [
                "ไทยเจริญ",
                "คำไผ่",
                "คำเตย",
                "ส้มผ่อ",
                "น้ำคำ"
            ]
        },
        "เลิงนกทา": {
            "PostCode": 35120,
            "Tambons": [
                "ศรีแก้ว",
                "สร้างมิ่ง",
                "โคกสำราญ",
                "ห้องแซง",
                "สามแยก",
                "กุดเชียงหมี",
                "สามัคคี",
                "กุดแห่",
                "บุ่งค้า",
                "สวาท"
            ]
        },
        "มหาชนะชัย": {
            "PostCode": 35130,
            "Tambons": [
                "สงยาง",
                "ฟ้าหยาด",
                "หัวเมือง",
                "คูเมือง",
                "บากเรือ",
                "บึงแก",
                "โนนทราย",
                "ม่วง",
                "ผือฮี",
                "พระเสาร์"
            ]
        },
        "กุดชุม": {
            "PostCode": 35140,
            "Tambons": [
                "โพนงาม",
                "คำน้ำสร้าง",
                "หนองแหน",
                "หนองหมี",
                "กุดชุม",
                "โนนเปือย",
                "กำแมด",
                "นาโส่",
                "ห้วยแก้ง"
            ]
        },
        "ป่าติ้ว": {
            "PostCode": 35150,
            "Tambons": [
                "กระจาย",
                "โพธิ์ไทร",
                "ศรีฐาน",
                "เชียงเพ็ง",
                "โคกนาโก"
            ]
        },
        "ค้อวัง": {
            "PostCode": 35160,
            "Tambons": [
                "ฟ้าห่วน",
                "ค้อวัง",
                "น้ำอ้อม",
                "กุดน้ำใส"
            ]
        },
        "ทรายมูล": {
            "PostCode": 35170,
            "Tambons": [
                "ดงมะไฟ",
                "นาเวียง",
                "ทรายมูล",
                "ไผ่",
                "ดู่ลาด"
            ]
        }
    },
    "ชัยภูมิ": {
        "เมืองชัยภูมิ": {
            "PostCode": 36000,
            "Tambons": [
                "โพนทอง",
                "รอบเมือง",
                "นาฝาย",
                "หนองนาแซง",
                "นาเสียว",
                "ห้วยบง",
                "กุดตุ้ม",
                "ลาดใหญ่",
                "ชีลอง",
                "ซับสีทอง",
                "บุ่งคล้า",
                "โคกสูง",
                "ในเมือง",
                "ห้วยต้อน",
                "ท่าหินโงม",
                "บ้านเล่า",
                "หนองไผ่",
                "บ้านค่าย",
                "โนนสำราญ"
            ]
        },
        "ภูเขียว": {
            "PostCode": 36110,
            "Tambons": [
                "หนองคอนไทย",
                "บ้านดอน",
                "ธาตุทอง",
                "กุดยม",
                "หนองตูม",
                "โคกสะอาด",
                "บ้านแก้ง",
                "บ้านเพชร",
                "โอโล",
                "กวางโจน",
                "ผักปัง"
            ]
        },
        "เกษตรสมบูรณ์": {
            "PostCode": 36120,
            "Tambons": [
                "โนนกอก",
                "สระโพนทอง",
                "บ้านยาง",
                "บ้านหัน",
                "บ้านเดื่อ",
                "หนองข่า",
                "โนนทอง",
                "บ้านบัว",
                "หนองโพนงาม",
                "บ้านเป้า",
                "กุดเลาะ"
            ]
        },
        "จัตุรัส": {
            "PostCode": 36130,
            "Tambons": [
                "ส้มป่อย",
                "หนองบัวใหญ่",
                "หนองโดน",
                "กุดน้ำใส",
                "ละหาน",
                "หนองบัวบาน",
                "บ้านขาม",
                "บ้านกอก",
                "หนองบัวโคก"
            ]
        },
        "ซับใหญ่": {
            "PostCode": 36130,
            "Tambons": [
                "ตะโกทอง",
                "ท่ากูบ",
                "ซับใหญ่"
            ]
        },
        "เนินสง่า": {
            "PostCode": 36130,
            "Tambons": [
                "รังงาม",
                "หนองฉิม",
                "กะฮาด",
                "ตาเนิน"
            ]
        },
        "คอนสวรรค์": {
            "PostCode": 36140,
            "Tambons": [
                "ยางหวาย",
                "ช่องสามหมอ",
                "โนนสะอาด",
                "คอนสวรรค์",
                "บ้านโสก",
                "ศรีสำราญ",
                "หนองขาม",
                "โคกมั่งงอย",
                "ห้วยไร่"
            ]
        },
        "แก้งคร้อ": {
            "PostCode": 36150,
            "Tambons": [
                "นาหนองทุ่ม",
                "บ้านแก้ง",
                "หนองสังข์",
                "หลุบคา",
                "หนองขาม",
                "โคกกุง",
                "เก่าย่าดี",
                "ท่ามะไฟหวาน",
                "หนองไผ่",
                "ช่องสามหมอ"
            ]
        },
        "บำเหน็จณรงค์": {
            "PostCode": 36160,
            "Tambons": [
                "เกาะมะนาว",
                "โคกเพชรพัฒนา",
                "บ้านชวน",
                "บ้านเพชร",
                "โคกเริงรมย์",
                "บ้านตาล",
                "หัวทะเล"
            ]
        },
        "บ้านเขว้า": {
            "PostCode": 36170,
            "Tambons": [
                "โนนแดง",
                "ภูแลนคา",
                "ชีบน",
                "ตลาดแร้ง",
                "บ้านเขว้า",
                "ลุ่มลำชี"
            ]
        },
        "คอนสาร": {
            "PostCode": 36180,
            "Tambons": [
                "ทุ่งพระ",
                "โนนคูณ",
                "ห้วยยาง",
                "ทุ่งลุยลาย",
                "ดงบัง",
                "ทุ่งนาเลา",
                "ดงกลาง",
                "คอนสาร"
            ]
        },
        "บ้านแท่น": {
            "PostCode": 36190,
            "Tambons": [
                "สามสวน",
                "บ้านเต่า",
                "สระพัง",
                "บ้านแท่น",
                "หนองคู"
            ]
        },
        "หนองบัวแดง": {
            "PostCode": 36210,
            "Tambons": [
                "นางแดด",
                "ถ้ำวัวแดง",
                "กุดชุมแสง",
                "หนองแวง",
                "คูเมือง",
                "วังชมภู",
                "ท่าใหญ่",
                "หนองบัวแดง"
            ]
        },
        "เทพสถิต": {
            "PostCode": 36230,
            "Tambons": [
                "บ้านไร่",
                "โป่งนก",
                "นายางกลัก",
                "ห้วยยายจิ๋ว",
                "วะตะแบก"
            ]
        },
        "หนองบัวระเหว": {
            "PostCode": 36250,
            "Tambons": [
                "วังตะเฆ่",
                "หนองบัวระเหว",
                "โสกปลาดุก",
                "โคกสะอาด",
                "ห้วยแย้"
            ]
        },
        "ภักดีชุมพล": {
            "PostCode": 36260,
            "Tambons": [
                "บ้านเจียง",
                "เจาทอง",
                "แหลมทอง",
                "วังทอง"
            ]
        }
    },
    "อำนาจเจริญ": {
        "เมืองอำนาจเจริญ": {
            "PostCode": 37000,
            "Tambons": [
                "โนนหนามแท่ง",
                "สร้างนกทา",
                "โนนโพธิ์",
                "บุ่ง",
                "นาผือ",
                "นาหมอม้า",
                "ห้วยไร่",
                "น้ำปลีก",
                "นาวัง",
                "เหล่าพรวน",
                "คึมใหญ่",
                "ปลาค้าว",
                "นาแต้",
                "นายม",
                "ไก่คำ",
                "ดอนเมย",
                "กุดปลาดุก",
                "หนองมะแซว",
                "นาจิก"
            ]
        },
        "ปทุมราชวงศา": {
            "PostCode": 37110,
            "Tambons": [
                "หนองข่า",
                "ห้วย",
                "นาหว้า",
                "โนนงาม",
                "ลือ",
                "นาป่าแซง",
                "คำโพน"
            ]
        },
        "ลืออำนาจ": {
            "PostCode": 37120,
            "Tambons": [
                "เปือย",
                "โคกกลาง",
                "แมด",
                "อำนาจ",
                "ไร่ขี",
                "ดงมะยาง",
                "ดงบัง"
            ]
        },
        "พนา": {
            "PostCode": 37180,
            "Tambons": [
                "จานลาน",
                "พนา",
                "พระเหลา",
                "ไม้กลอน"
            ]
        },
        "ชานุมาน": {
            "PostCode": 37210,
            "Tambons": [
                "โคกสาร",
                "ป่าก่อ",
                "โคกก่ง",
                "คำเขื่อนแก้ว",
                "ชานุมาน"
            ]
        },
        "หัวตะพาน": {
            "PostCode": 37240,
            "Tambons": [
                "โพนเมืองน้อย",
                "สร้างถ่อน้อย",
                "หนองแก้ว",
                "เค็งใหญ่",
                "คำพระ",
                "หัวตะพาน",
                "จิกดู่",
                "รัตนวารี"
            ]
        },
        "เสนางคนิคม": {
            "PostCode": 37290,
            "Tambons": [
                "เสนางคนิคม",
                "หนองสามสี",
                "โพนทอง",
                "ไร่สีสุก",
                "หนองไฮ",
                "นาเวียง"
            ]
        }
    },
    "บึงกาฬ": {
        "เมืองบึงกาฬ": {
            "PostCode": 38000,
            "Tambons": [
                "วิศิษฐ์",
                "บึงกาฬ",
                "โนนสมบูรณ์",
                "หอคำ",
                "คำนาดี",
                "หนองเลิง",
                "โคกก่อง",
                "โป่งเปือย",
                "ไคสี",
                "ชัยพร",
                "โนนสว่าง",
                "นาสวรรค์"
            ]
        },
        "บุ่งคล้า": {
            "PostCode": 38000,
            "Tambons": [
                "หนองเดิ่น",
                "โคกกว้าง",
                "บุ่งคล้า"
            ]
        },
        "เซกา": {
            "PostCode": 38150,
            "Tambons": [
                "โสกก่าม",
                "หนองทุ่ม",
                "ท่าสะอาด",
                "ป่งไฮ",
                "น้ำจั้น",
                "ท่ากกแดง",
                "ซาง",
                "เซกา",
                "บ้านต้อง"
            ]
        },
        "โซ่พิสัย": {
            "PostCode": 38170,
            "Tambons": [
                "คำแก้ว",
                "ถ้ำเจริญ",
                "บัวตูม",
                "ศรีชมภู",
                "เหล่าทอง",
                "หนองพันทา",
                "โซ่"
            ]
        },
        "พรเจริญ": {
            "PostCode": 38180,
            "Tambons": [
                "วังชมภู",
                "ศรีสำราญ",
                "ป่าแฝก",
                "พรเจริญ",
                "ดอนหญ้านาง",
                "ศรีชมภู",
                "หนองหัวช้าง"
            ]
        },
        "ปากคาด": {
            "PostCode": 38190,
            "Tambons": [
                "นาดง",
                "สมสนุก",
                "โนนศิลา",
                "นากั้ง",
                "ปากคาด",
                "หนองยอง"
            ]
        },
        "ศรีวิไล": {
            "PostCode": 38210,
            "Tambons": [
                "นาสิงห์",
                "นาสะแบง",
                "นาแสง",
                "ชุมภูพร",
                "ศรีวิไล"
            ]
        },
        "บึงโขงหลง": {
            "PostCode": 38220,
            "Tambons": [
                "บึงโขงหลง",
                "ท่าดอกคำ",
                "ดงบัง",
                "โพธิ์หมากแข้ง"
            ]
        }
    },
    "หนองบัวลำภู": {
        "เมืองหนองบัวลำภู": {
            "PostCode": 39000,
            "Tambons": [
                "หนองบัว",
                "หนองภัยศูนย์",
                "โพธิ์ชัย",
                "หนองหว้า",
                "โนนขมิ้น",
                "หนองสวรรค์",
                "กุดจิก",
                "ลำภู",
                "นาคำไฮ",
                "บ้านพร้าว",
                "หัวนา",
                "ป่าไม้งาม",
                "นามะเฟือง",
                "โนนทัน",
                "บ้านขาม"
            ]
        },
        "โนนสัง": {
            "PostCode": 39140,
            "Tambons": [
                "โนนสัง",
                "นิคมพัฒนา",
                "โคกม่วง",
                "โคกใหญ่",
                "โนนเมือง",
                "บ้านค้อ",
                "กุดดู่",
                "หนองเรือ",
                "บ้านถิ่น",
                "ปางกู่"
            ]
        },
        "นาวัง": {
            "PostCode": 39170,
            "Tambons": [
                "นาแก",
                "วังทอง",
                "วังปลาป้อม",
                "เทพคีรี",
                "นาเหล่า"
            ]
        },
        "นากลาง": {
            "PostCode": 39170,
            "Tambons": [
                "ฝั่งแดง",
                "นากลาง",
                "ด่านช้าง",
                "กุดแห่",
                "อุทัยสวรรค์",
                "โนนเมือง",
                "เก่ากลอย",
                "ดงสวรรค์",
                "กุดดินจี่"
            ]
        },
        "ศรีบุญเรือง": {
            "PostCode": 39180,
            "Tambons": [
                "โนนสะอาด",
                "หนองบัวใต้",
                "กุดสะเทียน",
                "นากอก",
                "เมืองใหม่",
                "ยางหล่อ",
                "ศรีบุญเรือง",
                "หนองแก",
                "หนองกุงแก้ว",
                "ทรายทอง",
                "หันนางาม",
                "โนนม่วง"
            ]
        },
        "สุวรรณคูหา": {
            "PostCode": 39270,
            "Tambons": [
                "นาด่าน",
                "นาดี",
                "บ้านโคก",
                "สุวรรณคูหา",
                "นาสี",
                "ดงมะไฟ",
                "บุญทัน",
                "กุดผึ้ง"
            ]
        }
    },
    "ขอนแก่น": {
        "เมืองขอนแก่น": {
            "PostCode": 40000,
            "Tambons": [
                "แดงใหญ่",
                "ดอนช้าง",
                "โคกสี",
                "หนองตูม",
                "โนนท่อน",
                "สำราญ",
                "ศิลา",
                "บ้านค้อ",
                "บ้านทุ่ม",
                "บ้านเป็ด",
                "บ้านหว้า",
                "สาวะถี",
                "พระลับ",
                "บึงเนียม",
                "เมืองเก่า",
                "ในเมือง",
                "ในเมือง",
                "ท่าพระ",
                "ดอนหัน"
            ]
        },
        "บ้านไผ่": {
            "PostCode": 40110,
            "Tambons": [
                "บ้านลาน",
                "ป่าปอ",
                "ภูเหล็ก",
                "หัวหนอง",
                "หนองน้ำใส",
                "เมืองเพีย",
                "หินตั้ง",
                "บ้านไผ่",
                "ในเมือง",
                "แคนเหนือ"
            ]
        },
        "โนนศิลา": {
            "PostCode": 40110,
            "Tambons": [
                "หนองปลาหมอ",
                "โนนแดง",
                "โนนศิลา",
                "เปือยใหญ่",
                "บ้านหัน"
            ]
        },
        "บ้านแฮด": {
            "PostCode": 40110,
            "Tambons": [
                "โคกสำราญ",
                "โนนสมบูรณ์",
                "บ้านแฮด",
                "หนองแซง"
            ]
        },
        "พล": {
            "PostCode": 40120,
            "Tambons": [
                "โคกสง่า",
                "โจดหนองแก",
                "โนนข่า",
                "เพ็กใหญ่",
                "เมืองพล",
                "หนองมะเขือ",
                "โสกนกเต็น",
                "หนองแวงนางเบ้า",
                "หนองแวงโสกพระ",
                "หัวทุ่ง",
                "ลอมคอม",
                "เก่างิ้ว"
            ]
        },
        "ชุมแพ": {
            "PostCode": 40130,
            "Tambons": [
                "ชุมแพ",
                "วังหินลาด",
                "ขัวเรียง",
                "ไชยสอ",
                "นาเพียง",
                "หนองเสาเล้า",
                "หนองไผ่",
                "โนนอุดม",
                "หนองเขียด",
                "นาหนองทุ่ม",
                "โนนหัน",
                "โนนสะอาด"
            ]
        },
        "น้ำพอง": {
            "PostCode": 40140,
            "Tambons": [
                "หนองกุง",
                "ท่ากระเสริม",
                "วังชัย",
                "พังทุย",
                "ทรายมูล",
                "บ้านขาม",
                "บัวใหญ่",
                "บัวเงิน",
                "น้ำพอง",
                "ม่วงหวาน",
                "สะอาด",
                "กุดน้ำใส",
                "น้ำพอง"
            ]
        },
        "เวียงเก่า": {
            "PostCode": 40150,
            "Tambons": [
                "ในเมือง",
                "เขาน้อย",
                "เมืองเก่าพัฒนา"
            ]
        },
        "หนองนาคำ": {
            "PostCode": 40150,
            "Tambons": [
                "บ้านโคก",
                "กุดธาตุ",
                "ขนวน"
            ]
        },
        "ภูเวียง": {
            "PostCode": 40150,
            "Tambons": [
                "หนองกุงธนสาร",
                "หนองกุงเซิน",
                "กุดขอนแก่น",
                "สงเปือย",
                "ดินดำ",
                "ทุ่งชมพู",
                "หว้าทอง",
                "นาชุมแสง",
                "ภูเวียง",
                "นาหว้า",
                "บ้านเรือ"
            ]
        },
        "มัญจาคีรี": {
            "PostCode": 40160,
            "Tambons": [
                "สวนหม่อน",
                "โพนเพ็ก",
                "กุดเค้า",
                "ท่าศาลา",
                "นางาม",
                "นาข่า",
                "คำแคน",
                "หนองแปน"
            ]
        },
        "โคกโพธิ์ไชย": {
            "PostCode": 40160,
            "Tambons": [
                "นาแพง",
                "โพธิ์ไชย",
                "บ้านโคก",
                "ซับสมบูรณ์"
            ]
        },
        "ซำสูง": {
            "PostCode": 40170,
            "Tambons": [
                "ห้วยเตย",
                "บ้านโนน",
                "คูคำ",
                "คำแมด",
                "กระนวน"
            ]
        },
        "กระนวน": {
            "PostCode": 40170,
            "Tambons": [
                "หัวนาคำ",
                "ห้วยยาง",
                "ดูนสาด",
                "น้ำอ้อม",
                "บ้านฝาง",
                "หนองกุงใหญ่",
                "หนองโก",
                "หนองโน",
                "ห้วยโจด"
            ]
        },
        "ชนบท": {
            "PostCode": 40180,
            "Tambons": [
                "ห้วยแก",
                "ศรีบุญเรือง",
                "กุดเพียขอม",
                "บ้านแท่น",
                "โนนพะยอม",
                "วังแสง",
                "ปอแดง",
                "ชนบท"
            ]
        },
        "หนองสองห้อง": {
            "PostCode": 40190,
            "Tambons": [
                "ดงเค็ง",
                "หันโจด",
                "หนองสองห้อง",
                "หนองเม็ก",
                "หนองไผ่ล้อม",
                "สำโรง",
                "โนนธาตุ",
                "วังหิน",
                "ดอนดั่ง",
                "ตะกั่วป่า",
                "ดอนดู่",
                "คึมชาด"
            ]
        },
        "หนองเรือ": {
            "PostCode": 40210,
            "Tambons": [
                "โนนทัน",
                "กุดกว้าง",
                "โนนทอง",
                "หนองเรือ",
                "โนนสะอาด",
                "บ้านเม็ง",
                "บ้านผือ",
                "บ้านกง",
                "จระเข้",
                "ยางคำ"
            ]
        },
        "สีชมพู": {
            "PostCode": 40220,
            "Tambons": [
                "ดงลาน",
                "นาจาน",
                "บริบูรณ์",
                "บ้านใหม่",
                "ภูห่าน",
                "วังเพิ่ม",
                "ศรีสุข",
                "หนองแดง",
                "ซำยาง",
                "สีชมพู"
            ]
        },
        "แวงน้อย": {
            "PostCode": 40230,
            "Tambons": [
                "ท่านางแนว",
                "แวงน้อย",
                "ละหานนา",
                "ท่าวัด",
                "ทางขวาง",
                "ก้านเหลือง"
            ]
        },
        "อุบลรัตน์": {
            "PostCode": 40250,
            "Tambons": [
                "ทุ่งโป่ง",
                "ศรีสุขสำราญ",
                "เขื่อนอุบลรัตน์",
                "บ้านดง",
                "โคกสูง",
                "นาคำ"
            ]
        },
        "บ้านฝาง": {
            "PostCode": 40270,
            "Tambons": [
                "หนองบัว",
                "ป่าหวายนั่ง",
                "ป่ามะนาว",
                "บ้านเหล่า",
                "บ้านฝาง",
                "โนนฆ้อง",
                "โคกงาม"
            ]
        },
        "เขาสวนกวาง": {
            "PostCode": 40280,
            "Tambons": [
                "ดงเมืองแอม",
                "คำม่วง",
                "เขาสวนกวาง",
                "นางิ้ว",
                "โนนสมบูรณ์"
            ]
        },
        "พระยืน": {
            "PostCode": 40320,
            "Tambons": [
                "หนองแวง",
                "พระยืน",
                "ขามป้อม",
                "พระบุ",
                "บ้านโต้น"
            ]
        },
        "แวงใหญ่": {
            "PostCode": 40330,
            "Tambons": [
                "คอนฉิม",
                "ใหม่นาเพียง",
                "โนนทอง",
                "โนนสะอาด",
                "แวงใหญ่"
            ]
        },
        "เปือยน้อย": {
            "PostCode": 40340,
            "Tambons": [
                "วังม่วง",
                "สระแก้ว",
                "ขามป้อม",
                "เปือยน้อย"
            ]
        },
        "ภูผาม่าน": {
            "PostCode": 40350,
            "Tambons": [
                "ภูผาม่าน",
                "ห้วยม่วง",
                "วังสวาบ",
                "นาฝาย",
                "โนนคอม"
            ]
        }
    },
    "อุดรธานี": {
        "เมืองอุดรธานี": {
            "PostCode": 41000,
            "Tambons": [
                "นาข่า",
                "เชียงพิณ",
                "หมากแข้ง",
                "นาดี",
                "หนองบัว",
                "โคกสะอาด",
                "บ้านตาด",
                "บ้านจั่น",
                "หมูม่น",
                "บ้านเลื่อม",
                "นากว้าง",
                "บ้านขาว",
                "เชียงยืน",
                "กุดสระ",
                "นิคมสงเคราะห์",
                "หนองไฮ",
                "สามพร้าว",
                "หนองนาคำ",
                "หนองขอนกว้าง",
                "โนนสูง",
                "หนองไผ่"
            ]
        },
        "กุมภวาปี": {
            "PostCode": 41110,
            "Tambons": [
                "สีออ",
                "ห้วยเกิ้ง",
                "เชียงแหว",
                "หนองหว้า",
                "เวียงคำ",
                "ตูมใต้",
                "ท่าลี่",
                "แชแล",
                "กุมภวาปี",
                "พันดอน",
                "เสอเพลอ",
                "ปะโค",
                "ผาสุก"
            ]
        },
        "ประจักษ์ศิลปาคม": {
            "PostCode": 41110,
            "Tambons": [
                "นาม่วง",
                "ห้วยสามพาด",
                "อุ่มจาน"
            ]
        },
        "หนองหาน": {
            "PostCode": 41130,
            "Tambons": [
                "หนองเม็ก",
                "พังงู",
                "โพนงาม",
                "ผักตบ",
                "หนองไผ่",
                "ดอนหายโศก",
                "สร้อยพร้าว",
                "หนองหาน",
                "สะแบง",
                "หนองสระปลา",
                "บ้านยา",
                "บ้านเชียง"
            ]
        },
        "พิบูลย์รักษ์": {
            "PostCode": 41130,
            "Tambons": [
                "บ้านแดง",
                "นาทราย",
                "ดอนกลอย"
            ]
        },
        "กู่แก้ว": {
            "PostCode": 41130,
            "Tambons": [
                "บ้านจีต",
                "โนนทองอินทร์",
                "ค้อใหญ่",
                "คอนสาย"
            ]
        },
        "เพ็ญ": {
            "PostCode": 41150,
            "Tambons": [
                "เพ็ญ",
                "นาพู่",
                "เชียงหวาง",
                "บ้านธาตุ",
                "นาบัว",
                "สุมเส้า",
                "จอมศรี",
                "เตาไห",
                "โคกกลาง",
                "สร้างแป้น",
                "บ้านเหล่า"
            ]
        },
        "บ้านผือ": {
            "PostCode": 41160,
            "Tambons": [
                "หนองหัวคู",
                "หนองแวง",
                "คำด้วง",
                "เมืองพาน",
                "บ้านค้อ",
                "กลางใหญ่",
                "หายโศก",
                "เขือน้ำ",
                "คำบง",
                "จำปาโมง",
                "ข้าวสาร",
                "โนนทอง",
                "บ้านผือ"
            ]
        },
        "บ้านดุง": {
            "PostCode": 41190,
            "Tambons": [
                "บ้านจันทน์",
                "บ้านชัย",
                "อ้อมกอ",
                "โพนสูง",
                "ดงเย็น",
                "บ้านตาด",
                "ศรีสุทโธ",
                "วังทอง",
                "บ้านม่วง",
                "นาคำ",
                "นาไหม",
                "บ้านดุง",
                "ถ่อนนาลับ"
            ]
        },
        "น้ำโสม": {
            "PostCode": 41210,
            "Tambons": [
                "น้ำโสม",
                "โสมเยี่ยม",
                "บ้านหยวก",
                "นางัว",
                "หนองแวง",
                "สามัคคี",
                "ศรีสำราญ"
            ]
        },
        "หนองวัวซอ": {
            "PostCode": 41220,
            "Tambons": [
                "หนองอ้อ",
                "อูบมุง",
                "กุดหมากไฟ",
                "โนนหวาย",
                "น้ำพ่น",
                "หนองบัวบาน",
                "หมากหญ้า",
                "หนองวัวซอ"
            ]
        },
        "ศรีธาตุ": {
            "PostCode": 41230,
            "Tambons": [
                "นายูง",
                "หนองนกเขียน",
                "หัวนาคำ",
                "บ้านโปร่ง",
                "จำปี",
                "ศรีธาตุ",
                "ตาดทอง"
            ]
        },
        "โนนสะอาด": {
            "PostCode": 41240,
            "Tambons": [
                "ทมนางาม",
                "บุ่งแก้ว",
                "โพธิ์ศรีสำราญ",
                "หนองกุงศรี",
                "โนนสะอาด",
                "โคกกลาง"
            ]
        },
        "กุดจับ": {
            "PostCode": 41250,
            "Tambons": [
                "ปะโค",
                "กุดจับ",
                "เมืองเพีย",
                "ขอนยูง",
                "ตาลเลียน",
                "สร้างก่อ",
                "เชียงเพ็ง"
            ]
        },
        "สร้างคอม": {
            "PostCode": 41260,
            "Tambons": [
                "บ้านหินโงม",
                "นาสะอาด",
                "บ้านโคก",
                "บ้านยวด",
                "สร้างคอม",
                "เชียงดา"
            ]
        },
        "วังสามหมอ": {
            "PostCode": 41280,
            "Tambons": [
                "หนองกุงทับม้า",
                "วังสามหมอ",
                "บะยาว",
                "หนองหญ้าไซ",
                "ผาสุก",
                "คำโคกสูง"
            ]
        },
        "ไชยวาน": {
            "PostCode": 41290,
            "Tambons": [
                "โพนสูง",
                "คำเลาะ",
                "หนองหลัก",
                "ไชยวาน"
            ]
        },
        "ทุ่งฝน": {
            "PostCode": 41310,
            "Tambons": [
                "ทุ่งฝน",
                "ทุ่งใหญ่",
                "นาชุมแสง",
                "นาทม"
            ]
        },
        "หนองแสง": {
            "PostCode": 41340,
            "Tambons": [
                "ทับกุง",
                "แสงสว่าง",
                "หนองแสง",
                "นาดี"
            ]
        },
        "นายูง": {
            "PostCode": 41380,
            "Tambons": [
                "โนนทอง",
                "นาแค",
                "บ้านก้อง",
                "นายูง"
            ]
        }
    },
    "เลย": {
        "เมืองเลย": {
            "PostCode": 42000,
            "Tambons": [
                "กกทอง",
                "นาแขม",
                "ชัยพฤกษ์",
                "น้ำสวย",
                "นาดินดำ",
                "นาโป่ง",
                "เสี้ยว",
                "น้ำหมาน",
                "กกดู่",
                "เมือง",
                "กุดป่อง",
                "นาอาน",
                "นาอ้อ",
                "ศรีสองรัก"
            ]
        },
        "เชียงคาน": {
            "PostCode": 42110,
            "Tambons": [
                "หาดทรายขาว",
                "จอมศรี",
                "บุฮม",
                "ปากตม",
                "เขาแก้ว",
                "นาซ่าว",
                "ธาตุ",
                "เชียงคาน"
            ]
        },
        "ด่านซ้าย": {
            "PostCode": 42120,
            "Tambons": [
                "นาหอ",
                "วังยาว",
                "โป่ง",
                "อิปุ่ม",
                "โพนสูง",
                "โคกงาม",
                "กกสะทอน",
                "ปากหมัน",
                "ด่านซ้าย",
                "นาดี"
            ]
        },
        "วังสะพุง": {
            "PostCode": 42130,
            "Tambons": [
                "ศรีสงคราม",
                "โคกขมิ้น",
                "เขาหลวง",
                "ผาบิ้ง",
                "ผาน้อย",
                "ปากปวน",
                "หนองงิ้ว",
                "หนองหญ้าปล้อง",
                "ทรายขาว",
                "วังสะพุง"
            ]
        },
        "ท่าลี่": {
            "PostCode": 42140,
            "Tambons": [
                "น้ำทูน",
                "โคกใหญ่",
                "อาฮี",
                "หนองผือ",
                "ท่าลี่",
                "น้ำแคม"
            ]
        },
        "ปากชม": {
            "PostCode": 42150,
            "Tambons": [
                "ปากชม",
                "เชียงกลม",
                "หาดคัมภีร์",
                "ห้วยบ่อซืน",
                "ชมเจริญ",
                "ห้วยพิชัย"
            ]
        },
        "ภูเรือ": {
            "PostCode": 42160,
            "Tambons": [
                "สานตม",
                "ลาดค่าง",
                "ปลาบ่า",
                "ร่องจิก",
                "ท่าศาลา",
                "หนองบัว"
            ]
        },
        "นาแห้ว": {
            "PostCode": 42170,
            "Tambons": [
                "นาแห้ว",
                "แสงภา",
                "นาพึง",
                "นามาลา",
                "เหล่ากอหก"
            ]
        },
        "ภูกระดึง": {
            "PostCode": 42180,
            "Tambons": [
                "ศรีฐาน",
                "ผานกเค้า",
                "ภูกระดึง",
                "ห้วยส้ม"
            ]
        },
        "หนองหิน": {
            "PostCode": 42190,
            "Tambons": [
                "ตาดข่า",
                "หนองหิน",
                "ปวนพุ"
            ]
        },
        "นาด้วง": {
            "PostCode": 42210,
            "Tambons": [
                "ท่าสะอาด",
                "นาด้วง",
                "นาดอกคำ",
                "ท่าสวรรค์"
            ]
        },
        "เอราวัณ": {
            "PostCode": 42220,
            "Tambons": [
                "ทรัพย์ไพวัลย์",
                "เอราวัณ",
                "ผาสามยอด",
                "ผาอินทร์แปลง"
            ]
        },
        "ภูหลวง": {
            "PostCode": 42230,
            "Tambons": [
                "เลยวังไสย์",
                "ห้วยสีเสียด",
                "หนองคัน",
                "แก่งศรีภูมิ",
                "ภูหอ"
            ]
        },
        "ผาขาว": {
            "PostCode": 42240,
            "Tambons": [
                "ผาขาว",
                "โนนป่าซาง",
                "โนนปอแดง",
                "ท่าช้างคล้อง",
                "บ้านเพิ่ม"
            ]
        }
    },
    "หนองคาย": {
        "เมืองหนองคาย": {
            "PostCode": 43000,
            "Tambons": [
                "บ้านเดื่อ",
                "สีกาย",
                "เมืองหมี",
                "ปะโค",
                "หนองกอมเกาะ",
                "หินโงม",
                "กวนวัน",
                "วัดธาตุ",
                "เวียงคุก",
                "โพธิ์ชัย",
                "มีชัย",
                "ในเมือง",
                "หาดคำ",
                "ค่ายบกหวาน",
                "โพนสว่าง",
                "พระธาตุบังพวน"
            ]
        },
        "สระใคร": {
            "PostCode": 43100,
            "Tambons": [
                "สระใคร",
                "คอกช้าง",
                "บ้านฝาง"
            ]
        },
        "ท่าบ่อ": {
            "PostCode": 43110,
            "Tambons": [
                "หนองนาง",
                "โพนสา",
                "นาข่า",
                "บ้านว่าน",
                "บ้านเดื่อ",
                "โคกคอน",
                "กองนาง",
                "น้ำโมง",
                "ท่าบ่อ",
                "บ้านถ่อน"
            ]
        },
        "รัตนวาปี": {
            "PostCode": 43120,
            "Tambons": [
                "รัตนวาปี",
                "พระบาทนาสิงห์",
                "โพนแพง",
                "บ้านต้อน",
                "นาทับไฮ"
            ]
        },
        "โพนพิสัย": {
            "PostCode": 43120,
            "Tambons": [
                "บ้านโพธิ์",
                "สร้างนางขาว",
                "บ้านผือ",
                "เซิม",
                "เหล่าต่างคำ",
                "ทุ่งหลวง",
                "ชุมช้าง",
                "กุดบง",
                "จุมพล",
                "นาหนัง",
                "วัดหลวง"
            ]
        },
        "โพธิ์ตาก": {
            "PostCode": 43130,
            "Tambons": [
                "โพนทอง",
                "ด่านศรีสุข",
                "โพธิ์ตาก"
            ]
        },
        "ศรีเชียงใหม่": {
            "PostCode": 43130,
            "Tambons": [
                "พานพร้าว",
                "บ้านหม้อ",
                "หนองปลาปาก",
                "พระพุทธบาท"
            ]
        },
        "สังคม": {
            "PostCode": 43160,
            "Tambons": [
                "นางิ้ว",
                "สังคม",
                "ผาตั้ง",
                "บ้านม่วง",
                "แก้งไก่"
            ]
        },
        "เฝ้าไร่": {
            "PostCode": 43230,
            "Tambons": [
                "อุดมพร",
                "วังหลวง",
                "หนองหลวง",
                "นาดี",
                "เฝ้าไร่"
            ]
        }
    },
    "มหาสารคาม": {
        "เมืองมหาสารคาม": {
            "PostCode": 44000,
            "Tambons": [
                "บัวค้อ",
                "หนองโน",
                "ห้วยแอ่ง",
                "ตลาด",
                "ลาดพัฒนา",
                "ท่าสองคอน",
                "เขวา",
                "แก่งเลิงจาน",
                "เกิ้ง",
                "ดอนหว่าน",
                "โคกก่อ",
                "แวงน่าง",
                "ท่าตูม",
                "หนองปลิง"
            ]
        },
        "พยัคฆภูมิพิสัย": {
            "PostCode": 44110,
            "Tambons": [
                "ปะหลาน",
                "ก้ามปู",
                "เวียงสะอาด",
                "นาสีนวล",
                "ราษฎร์เจริญ",
                "หนองบัวแก้ว",
                "เมืองเตา",
                "ลานสะแก",
                "เวียงชัย",
                "หนองบัว",
                "เมืองเสือ",
                "ภารแอ่น",
                "เม็กดำ",
                "ราษฎร์พัฒนา"
            ]
        },
        "วาปีปทุม": {
            "PostCode": 44120,
            "Tambons": [
                "หนองทุ่ม",
                "นาข่า",
                "ดงใหญ่",
                "เสือโก้ก",
                "ขามป้อม",
                "แคน",
                "งัวบา",
                "หนองแสง",
                "บ้านหวาย",
                "โพธิ์ชัย",
                "หนองไฮ",
                "หนองแสน",
                "โคกสีทองหลาง",
                "ประชาพัฒนา",
                "หัวเรือ"
            ]
        },
        "บรบือ": {
            "PostCode": 44130,
            "Tambons": [
                "ดอนงัว",
                "หนองโก",
                "บ่อใหญ่",
                "หนองสิม",
                "บรบือ",
                "ยาง",
                "วังใหม่",
                "หนองคูขาด",
                "หนองจิก",
                "บัวมาศ",
                "โนนราษี",
                "กำพี้",
                "หนองม่วง",
                "วังไชย",
                "โนนแดง"
            ]
        },
        "กุดรัง": {
            "PostCode": 44130,
            "Tambons": [
                "กุดรัง",
                "นาโพธิ์",
                "เลิงแฝก",
                "หนองแวง",
                "ห้วยเตย"
            ]
        },
        "โกสุมพิสัย": {
            "PostCode": 44140,
            "Tambons": [
                "หนองบัว",
                "หนองบอน",
                "เหล่า",
                "หนองเหล็ก",
                "หัวขวาง",
                "แพง",
                "เขวาไร่",
                "วังยาว",
                "ยางน้อย",
                "โพนงาม",
                "แก้งแก",
                "ยางท่าแจ้ง",
                "เขื่อน",
                "หนองกุงสวรรค์",
                "เลิงใต้",
                "ดอนกลาง",
                "แห่ใต้"
            ]
        },
        "กันทรวิชัย": {
            "PostCode": 44150,
            "Tambons": [
                "ศรีสุข",
                "ขามเรียง",
                "ขามเฒ่าพัฒนา",
                "นาสีนวน",
                "ท่าขอนยาง",
                "เขวาใหญ่",
                "มะค่า",
                "คันธารราษฎร์",
                "โคกพระ",
                "กุดใส้จ่อ"
            ]
        },
        "เชียงยืน": {
            "PostCode": 44160,
            "Tambons": [
                "นาทอง",
                "กู่ทอง",
                "ดอนเงิน",
                "เสือเฒ่า",
                "หนองซอน",
                "โพนทอง",
                "เหล่าบัวบาน",
                "เชียงยืน"
            ]
        },
        "ชื่นชม": {
            "PostCode": 44160,
            "Tambons": [
                "ชื่นชม",
                "กุดปลาดุก",
                "เหล่าดอกไม้",
                "หนองกุง"
            ]
        },
        "นาเชือก": {
            "PostCode": 44170,
            "Tambons": [
                "นาเชือก",
                "หนองกุง",
                "สำโรง",
                "เขวาไร่",
                "หนองเม็ก",
                "สันป่าตอง",
                "หนองเรือ",
                "หนองแดง",
                "ปอพาน",
                "หนองโพธิ์"
            ]
        },
        "นาดูน": {
            "PostCode": 44180,
            "Tambons": [
                "นาดูน",
                "หนองไผ่",
                "ดงยาง",
                "หนองคู",
                "กู่สันตรัตน์",
                "ดงดวน",
                "พระธาตุ",
                "หัวดง",
                "ดงบัง"
            ]
        },
        "แกดำ": {
            "PostCode": 44190,
            "Tambons": [
                "แกดำ",
                "วังแสง",
                "มิตรภาพ",
                "หนองกุง",
                "โนนภิบาล"
            ]
        },
        "ยางสีสุราช": {
            "PostCode": 44210,
            "Tambons": [
                "ยางสีสุราช",
                "นาภู",
                "บ้านกู่",
                "ดงเมือง",
                "สร้างแซ่ง",
                "แวงดง",
                "หนองบัวสันตุ"
            ]
        }
    },
    "ร้อยเอ็ด": {
        "เมืองร้อยเอ็ด": {
            "PostCode": 45000,
            "Tambons": [
                "หนองแก้ว",
                "หนองแวง",
                "นาโพธิ์",
                "ในเมือง",
                "รอบเมือง",
                "เหนือเมือง",
                "สะอาดสมบูรณ์",
                "ขอนแก่น",
                "โนนรัง",
                "แคนใหญ่",
                "ปอภาร",
                "เมืองทอง",
                "สีแก้ว",
                "ดงลาน",
                "โนนตาล"
            ]
        },
        "จังหาร": {
            "PostCode": 45000,
            "Tambons": [
                "ม่วงลาด",
                "จังหาร",
                "ดงสิงห์",
                "ยางใหญ่",
                "ผักแว่น",
                "แสนชาติ",
                "ปาฝา",
                "ดินดำ"
            ]
        },
        "เชียงขวัญ": {
            "PostCode": 45000,
            "Tambons": [
                "เชียงขวัญ",
                "พระธาตุ",
                "พระเจ้า",
                "บ้านเขือง",
                "พลับพลา",
                "หมูม้น"
            ]
        },
        "ศรีสมเด็จ": {
            "PostCode": 45000,
            "Tambons": [
                "โพธิ์ทอง",
                "ศรีสมเด็จ",
                "เมืองเปลือย",
                "หนองแวงควง",
                "บ้านบาก",
                "หนองใหญ่",
                "โพธิ์สัย",
                "สวนจิก"
            ]
        },
        "โพนทอง": {
            "PostCode": 45110,
            "Tambons": [
                "โพธิ์ทอง",
                "หนองใหญ่",
                "โนนชัยศรี",
                "สว่าง",
                "นาอุดม",
                "อุ่มเม่า",
                "วังสามัคคี",
                "คำนาดี",
                "พรมสวรรค์",
                "โคกกกม่วง",
                "โคกสูง",
                "แวง",
                "โพธิ์ศรีสว่าง",
                "สระนกแก้ว"
            ]
        },
        "เสลภูมิ": {
            "PostCode": 45120,
            "Tambons": [
                "ภูเงิน",
                "กลาง",
                "นางาม",
                "ขวาว",
                "นาเลิง",
                "ศรีวิลัย",
                "โพธิ์ทอง",
                "เกาะแก้ว",
                "หนองหลวง",
                "เหล่าน้อย",
                "พรสวรรค์",
                "ขวัญเมือง",
                "บึงเกลือ",
                "นาเมือง",
                "นาแซง",
                "เมืองไพร",
                "วังหลวง",
                "ท่าม่วง"
            ]
        },
        "สุวรรณภูมิ": {
            "PostCode": 45130,
            "Tambons": [
                "หินกอง",
                "สระคู",
                "ดอกไม้",
                "ทุ่งศรีเมือง",
                "เมืองทุ่ง",
                "หัวโทน",
                "บ่อพันขัน",
                "ทุ่งหลวง",
                "หัวช้าง",
                "น้ำคำ",
                "ห้วยหินลาด",
                "ช้างเผือก",
                "ทุ่งกุลา",
                "นาใหญ่",
                "จำปาขัน"
            ]
        },
        "หนองฮี": {
            "PostCode": 45140,
            "Tambons": [
                "สาวแห",
                "ดูกอึ่ง",
                "เด่นราษฎร์",
                "หนองฮี"
            ]
        },
        "พนมไพร": {
            "PostCode": 45140,
            "Tambons": [
                "หนองทัพไทย",
                "คำไฮ",
                "ชานุวรรณ",
                "นานวล",
                "สระแก้ว",
                "แสนสุข",
                "ค้อใหญ่",
                "โพธิ์ชัย",
                "กุดน้ำใส",
                "โคกสว่าง",
                "พนมไพร",
                "วารีสวัสดิ์",
                "โพธิ์ใหญ่"
            ]
        },
        "เกษตรวิสัย": {
            "PostCode": 45150,
            "Tambons": [
                "หนองแวง",
                "น้ำอ้อม",
                "ดงครั่งใหญ่",
                "กำแพง",
                "โนนสว่าง",
                "เมืองบัว",
                "เหล่าหลวง",
                "สิงห์โคก",
                "ทุ่งทอง",
                "ดงครั่งน้อย",
                "บ้านฝาง",
                "เกษตรวิสัย",
                "กู่กาสิงห์"
            ]
        },
        "อาจสามารถ": {
            "PostCode": 45160,
            "Tambons": [
                "โพนเมือง",
                "บ้านแจ้ง",
                "หน่อม",
                "หนองหมื่นถ่าน",
                "ขี้เหล็ก",
                "หนองบัว",
                "โหรา",
                "อาจสามารถ",
                "หนองขาม",
                "บ้านดู่"
            ]
        },
        "ธวัชบุรี": {
            "PostCode": 45170,
            "Tambons": [
                "เขวาทุ่ง",
                "ธวัชบุรี",
                "นิเวศน์",
                "อุ่มเม้า",
                "มะอึ",
                "ไพศาล",
                "เมืองน้อย",
                "บึงนคร",
                "ราชธานี",
                "หนองพอก",
                "ธงธานี",
                "หนองไผ่"
            ]
        },
        "ทุ่งเขาหลวง": {
            "PostCode": 45170,
            "Tambons": [
                "เหล่า",
                "มะบ้า",
                "บึงงาม",
                "เทอดไทย",
                "ทุ่งเขาหลวง"
            ]
        },
        "จตุรพักตรพิมาน": {
            "PostCode": 45180,
            "Tambons": [
                "น้ำใส",
                "โคกล่าม",
                "ดงแดง",
                "ดงกลาง",
                "หัวช้าง",
                "ศรีโคตร",
                "ป่าสังข์",
                "ดู่น้อย",
                "อีง่อง",
                "ลิ้นฟ้า",
                "เมืองหงส์",
                "หนองผือ"
            ]
        },
        "ปทุมรัตต์": {
            "PostCode": 45190,
            "Tambons": [
                "ขี้เหล็ก",
                "ดอกล้ำ",
                "บัวแดง",
                "โนนสง่า",
                "สระบัว",
                "โนนสวรรค์",
                "โพนสูง",
                "หนองแคน"
            ]
        },
        "หนองพอก": {
            "PostCode": 45210,
            "Tambons": [
                "หนองพอก",
                "กกโพธิ์",
                "โคกสว่าง",
                "บึงงาม",
                "ภูเขาทอง",
                "ผาน้ำย้อย",
                "หนองขุ่นใหญ่",
                "ท่าสีดา",
                "รอบเมือง"
            ]
        },
        "เมืองสรวง": {
            "PostCode": 45220,
            "Tambons": [
                "คูเมือง",
                "เมืองสรวง",
                "หนองผือ",
                "หนองหิน",
                "กกกุง"
            ]
        },
        "โพธิ์ชัย": {
            "PostCode": 45230,
            "Tambons": [
                "โพธิ์ศรี",
                "ขามเปี้ย",
                "ดอนโอง",
                "เชียงใหม่",
                "บัวคำ",
                "หนองตาไก้",
                "คำพอุง",
                "อัคคะคำ",
                "สะอาด"
            ]
        },
        "โพนทราย": {
            "PostCode": 45240,
            "Tambons": [
                "ท่าหาดยาว",
                "ยางคำ",
                "สามขา",
                "โพนทราย",
                "ศรีสว่าง"
            ]
        },
        "เมยวดี": {
            "PostCode": 45250,
            "Tambons": [
                "บุ่งเลิศ",
                "เมยวดี",
                "ชุมพร",
                "ชมสะอาด"
            ]
        }
    },
    "กาฬสินธุ์": {
        "เมืองกาฬสินธุ์": {
            "PostCode": 46000,
            "Tambons": [
                "ไผ่",
                "บึงวิชัย",
                "นาจารย์",
                "เชียงเครือ",
                "กลางหมื่น",
                "โพนทอง",
                "ขมิ้น",
                "ภูดิน",
                "กาฬสินธุ์",
                "ลำคลอง",
                "ลำปาว",
                "ลำพาน",
                "หนองกุง",
                "หลุบ",
                "ห้วยโพธิ์",
                "เหนือ",
                "ภูปอ"
            ]
        },
        "ดอนจาน": {
            "PostCode": 46000,
            "Tambons": [
                "นาจำปา",
                "สะอาดไชยศรี",
                "ม่วงนา",
                "ดอนจาน",
                "ดงพยุง"
            ]
        },
        "กุฉินารายณ์": {
            "PostCode": 46110,
            "Tambons": [
                "สามขา",
                "สมสะอาด",
                "นาขาม",
                "กุดหว้า",
                "แจนแลน",
                "จุมจัง",
                "หนองห้าง",
                "กุดค้าว",
                "นาโก",
                "เหล่าใหญ่",
                "บัวขาว",
                "เหล่าไฮงาม"
            ]
        },
        "ยางตลาด": {
            "PostCode": 46120,
            "Tambons": [
                "โนนสูง",
                "หนองตอกแป้น",
                "อุ่มเม่า",
                "เว่อ",
                "เขาพระนอน",
                "ดอนสมบูรณ์",
                "คลองขาม",
                "นาเชือก",
                "นาดี",
                "หัวงัว",
                "บัวบาน",
                "หัวนาคำ",
                "อิตื้อ",
                "ยางตลาด",
                "หนองอิเฒ่า"
            ]
        },
        "กมลาไสย": {
            "PostCode": 46130,
            "Tambons": [
                "เจ้าท่า",
                "กมลาไสย",
                "โคกสมบูรณ์",
                "หลักเมือง",
                "ธัญญา",
                "โพนงาม",
                "หนองแปน",
                "ดงลิง"
            ]
        },
        "ฆ้องชัย": {
            "PostCode": 46130,
            "Tambons": [
                "เหล่ากลาง",
                "ลำชี",
                "ฆ้องชัยพัฒนา",
                "โคกสะอาด",
                "โนนศิลาเลิง"
            ]
        },
        "สหัสขันธ์": {
            "PostCode": 46140,
            "Tambons": [
                "นามะเขือ",
                "นิคม",
                "โนนน้ำเกลี้ยง",
                "โนนบุรี",
                "โนนศิลา",
                "โนนแหลมทอง",
                "ภูสิงห์",
                "สหัสขันธ์"
            ]
        },
        "สมเด็จ": {
            "PostCode": 46150,
            "Tambons": [
                "ลำห้วยหลัว",
                "ผาเสวย",
                "มหาไชย",
                "ศรีสมเด็จ",
                "สมเด็จ",
                "หนองแวง",
                "หมูม่น",
                "แซงบาดาล"
            ]
        },
        "นาคู": {
            "PostCode": 46160,
            "Tambons": [
                "บ่อแก้ว",
                "นาคู",
                "โนนนาจาน",
                "สายนาวัง",
                "ภูแล่นช้าง"
            ]
        },
        "เขาวง": {
            "PostCode": 46160,
            "Tambons": [
                "หนองผือ",
                "สระพังทอง",
                "สงเปลือย",
                "คุ้มเก่า",
                "กุดสิมคุ้มใหม่",
                "กุดปลาค้าว"
            ]
        },
        "ห้วยเม็ก": {
            "PostCode": 46170,
            "Tambons": [
                "หัวหิน",
                "กุดโดน",
                "คำเหมือดแก้ว",
                "คำใหญ่",
                "ทรายทอง",
                "โนนสะอาด",
                "บึงนาเรียง",
                "พิมูล",
                "ห้วยเม็ก"
            ]
        },
        "สามชัย": {
            "PostCode": 46180,
            "Tambons": [
                "คำสร้างเที่ยง",
                "สำราญ",
                "หนองช้าง",
                "สำราญใต้"
            ]
        },
        "คำม่วง": {
            "PostCode": 46180,
            "Tambons": [
                "ดินจี่",
                "โพน",
                "ทุ่งคลอง",
                "นาทัน",
                "เนินยาง",
                "นาบอน"
            ]
        },
        "ท่าคันโท": {
            "PostCode": 46190,
            "Tambons": [
                "ยางอู้ม",
                "กุงเก่า",
                "นาตาล",
                "กุดจิก",
                "ดงสมบูรณ์",
                "ท่าคันโท"
            ]
        },
        "ร่องคำ": {
            "PostCode": 46210,
            "Tambons": [
                "เหล่าอ้อย",
                "สามัคคี",
                "ร่องคำ"
            ]
        },
        "หนองกุงศรี": {
            "PostCode": 46220,
            "Tambons": [
                "ลำหนองแสน",
                "หนองใหญ่",
                "หนองสรวง",
                "หนองบัว",
                "หนองกุงศรี",
                "เสาเล้า",
                "โคกเครือ",
                "หนองหิน",
                "ดงมูล"
            ]
        },
        "นามน": {
            "PostCode": 46230,
            "Tambons": [
                "ยอดแกง",
                "นามน",
                "สงเปลือย",
                "หนองบัว",
                "หลักเหลี่ยม"
            ]
        },
        "ห้วยผึ้ง": {
            "PostCode": 46240,
            "Tambons": [
                "นิคมห้วยผึ้ง",
                "ไค้นุ่น",
                "คำบง",
                "หนองอีบุตร"
            ]
        }
    },
    "สกลนคร": {
        "เมืองสกลนคร": {
            "PostCode": 47000,
            "Tambons": [
                "ห้วยยาง",
                "ฮางโฮง",
                "ธาตุเชิงชุม",
                "โคกก่อง",
                "ดงชน",
                "เหล่าปอแดง",
                "ธาตุนาเวง",
                "ดงมะไฟ",
                "พังขว้าง",
                "ม่วงลาย",
                "งิ้วด่อน",
                "โนนหอม",
                "เชียงเครือ",
                "ขมิ้น",
                "หนองลาด",
                "ท่าแร่"
            ]
        },
        "สว่างแดนดิน": {
            "PostCode": 47110,
            "Tambons": [
                "บงเหนือ",
                "คำสะอาด",
                "โพนสูง",
                "บ้านต้าย",
                "สว่างแดนดิน",
                "โคกสี",
                "ทรายมูล",
                "หนองหลวง",
                "ค้อใต้",
                "บ้านถ่อน",
                "บงใต้",
                "ธาตุทอง",
                "ตาลเนิ้ง",
                "ตาลโกน",
                "แวง",
                "พันนา"
            ]
        },
        "วานรนิวาส": {
            "PostCode": 47120,
            "Tambons": [
                "คูสะคาม",
                "หนองสนม",
                "หนองแวง",
                "ขัวก่าย",
                "เดื่อศรีคันไชย",
                "วานรนิวาส",
                "หนองแวงใต้",
                "กุดเรือคำ",
                "คอนสวรรค์",
                "นาคำ",
                "อินทร์แปลง",
                "นาซอ",
                "ศรีวิชัย",
                "ธาตุ"
            ]
        },
        "พรรณานิคม": {
            "PostCode": 47130,
            "Tambons": [
                "พรรณา",
                "วังยาง",
                "ไร่",
                "ช้างมิ่ง",
                "นาใน",
                "สว่าง",
                "บะฮี",
                "เชิงชุม",
                "นาหัวบ่อ",
                "พอกน้อย"
            ]
        },
        "บ้านม่วง": {
            "PostCode": 47140,
            "Tambons": [
                "มาย",
                "ดงหม้อทอง",
                "ดงเหนือ",
                "ดงหม้อทองใต้",
                "ห้วยหลัว",
                "ม่วง",
                "หนองกวั่ง",
                "บ่อแก้ว",
                "โนนสะอาด"
            ]
        },
        "วาริชภูมิ": {
            "PostCode": 47150,
            "Tambons": [
                "ค้อเขียว",
                "หนองลาด",
                "คำบ่อ",
                "ปลาโหล",
                "วาริชภูมิ"
            ]
        },
        "พังโคน": {
            "PostCode": 47160,
            "Tambons": [
                "แร่",
                "ต้นผึ้ง",
                "ไฮหย่อง",
                "ม่วงไข่",
                "พังโคน"
            ]
        },
        "อากาศอำนวย": {
            "PostCode": 47170,
            "Tambons": [
                "บะหว้า",
                "นาฮี",
                "สามัคคีพัฒนา",
                "โพนงาม",
                "วาใหญ่",
                "โพนแพง",
                "อากาศ",
                "ท่าก้อน"
            ]
        },
        "กุดบาก": {
            "PostCode": 47180,
            "Tambons": [
                "นาม่อง",
                "กุดบาก",
                "กุดไห"
            ]
        },
        "ภูพาน": {
            "PostCode": 47180,
            "Tambons": [
                "โคกภู",
                "กกปลาซิว",
                "สร้างค้อ",
                "หลุบเลา"
            ]
        },
        "ส่องดาว": {
            "PostCode": 47190,
            "Tambons": [
                "ปทุมวาปี",
                "ท่าศิลา",
                "ส่องดาว",
                "วัฒนา"
            ]
        },
        "กุสุมาลย์": {
            "PostCode": 47210,
            "Tambons": [
                "กุสุมาลย์",
                "นาโพธิ์",
                "โพธิไพศาล",
                "นาเพียง",
                "อุ่มจาน"
            ]
        },
        "โพนนาแก้ว": {
            "PostCode": 47230,
            "Tambons": [
                "บ้านโพน",
                "เชียงสือ",
                "นาแก้ว",
                "นาตงวัฒนา",
                "บ้านแป้น"
            ]
        },
        "คำตากล้า": {
            "PostCode": 47250,
            "Tambons": [
                "นาแต้",
                "หนองบัวสิม",
                "คำตากล้า",
                "แพด"
            ]
        },
        "เต่างอย": {
            "PostCode": 47260,
            "Tambons": [
                "นาตาล",
                "จันทร์เพ็ญ",
                "เต่างอย",
                "บึงทวาย"
            ]
        },
        "นิคมน้ำอูน": {
            "PostCode": 47270,
            "Tambons": [
                "สุวรรณคาม",
                "หนองบัว",
                "นิคมน้ำอูน",
                "หนองปลิง"
            ]
        },
        "โคกศรีสุพรรณ": {
            "PostCode": 47280,
            "Tambons": [
                "เหล่าโพนค้อ",
                "ตองโขบ",
                "ด่านม่วงคำ",
                "แมดนาท่ม"
            ]
        },
        "เจริญศิลป์": {
            "PostCode": 47290,
            "Tambons": [
                "ทุ่งแก",
                "เจริญศิลป์",
                "บ้านเหล่า",
                "หนองแปน",
                "โคกศิลา"
            ]
        }
    },
    "นครพนม": {
        "เมืองนครพนม": {
            "PostCode": 48000,
            "Tambons": [
                "โพธิ์ตาก",
                "ในเมือง",
                "หนองแสง",
                "นาทราย",
                "นาราชควาย",
                "บ้านผึ้ง",
                "อาจสามารถ",
                "กุรุคุ",
                "บ้านกลาง",
                "ท่าค้อ",
                "คำเตย",
                "หนองญาติ",
                "ดงขวาง",
                "วังตามัว",
                "ขามเฒ่า"
            ]
        },
        "ธาตุพนม": {
            "PostCode": 48110,
            "Tambons": [
                "ธาตุพนม",
                "ฝั่งแดง",
                "โพนแพง",
                "พระกลางทุ่ง",
                "นาถ่อน",
                "แสนพัน",
                "ธาตุพนมเหนือ",
                "กุดฉิม",
                "นาหนาด",
                "อุ่มเหม้า",
                "ดอนนางหงส์",
                "น้ำก่ำ"
            ]
        },
        "ท่าอุเทน": {
            "PostCode": 48120,
            "Tambons": [
                "ท่าอุเทน",
                "โนนตาล",
                "ท่าจำปา",
                "ไชยบุรี",
                "พนอม",
                "พะทาย",
                "เวินพระบาท",
                "รามราช",
                "หนองเทา"
            ]
        },
        "วังยาง": {
            "PostCode": 48130,
            "Tambons": [
                "หนองโพธิ์",
                "ยอดชาด",
                "โคกสี",
                "วังยาง"
            ]
        },
        "นาแก": {
            "PostCode": 48130,
            "Tambons": [
                "นาแก",
                "บ้านแก้ง",
                "สีชมพู",
                "คำพี้",
                "นาเลียง",
                "หนองบ่อ",
                "ก้านเหลือง",
                "พุ่มแก",
                "นาคู่",
                "พิมาน",
                "พระซอง",
                "หนองสังข์"
            ]
        },
        "นาทม": {
            "PostCode": 48140,
            "Tambons": [
                "หนองซน",
                "นาทม",
                "ดอนเตย"
            ]
        },
        "บ้านแพง": {
            "PostCode": 48140,
            "Tambons": [
                "บ้านแพง",
                "ไผ่ล้อม",
                "โพนทอง",
                "หนองแวง",
                "นางัว",
                "นาเข"
            ]
        },
        "ศรีสงคราม": {
            "PostCode": 48150,
            "Tambons": [
                "บ้านเอื้อง",
                "ศรีสงคราม",
                "สามผง",
                "นาเดื่อ",
                "ท่าบ่อสงคราม",
                "บ้านข่า",
                "นาคำ",
                "โพนสว่าง",
                "หาดแพง"
            ]
        },
        "ปลาปาก": {
            "PostCode": 48160,
            "Tambons": [
                "ปลาปาก",
                "มหาชัย",
                "โคกสูง",
                "โคกสว่าง",
                "กุตาไก้",
                "หนองฮี",
                "นามะเขือ",
                "หนองเทาใหญ่"
            ]
        },
        "เรณูนคร": {
            "PostCode": 48170,
            "Tambons": [
                "เรณูใต้",
                "หนองย่างชิ้น",
                "โคกหินแฮ่",
                "นางาม",
                "ท่าลาด",
                "โพนทอง",
                "เรณู",
                "นาขาม"
            ]
        },
        "นาหว้า": {
            "PostCode": 48180,
            "Tambons": [
                "นางัว",
                "บ้านเสียว",
                "นาคูณใหญ่",
                "เหล่าพัฒนา",
                "ท่าเรือ",
                "นาหว้า"
            ]
        },
        "โพนสวรรค์": {
            "PostCode": 48190,
            "Tambons": [
                "โพนสวรรค์",
                "นาหัวบ่อ",
                "นาใน",
                "โพนจาน",
                "บ้านค้อ",
                "นาขมิ้น",
                "โพนบก"
            ]
        }
    },
    "มุกดาหาร": {
        "เมืองมุกดาหาร": {
            "PostCode": 49000,
            "Tambons": [
                "คำป่าหลาย",
                "นาโสก",
                "นาสีนวน",
                "บางทรายใหญ่",
                "คำอาฮวน",
                "ดงเย็น",
                "กุดแข้",
                "ผึ่งแดด",
                "บ้านโคก",
                "ศรีบุญเรือง",
                "มุกดาหาร",
                "ดงมอน",
                "โพนทราย"
            ]
        },
        "คำชะอี": {
            "PostCode": 49110,
            "Tambons": [
                "คำบก",
                "บ้านซ่ง",
                "คำชะอี",
                "หนองเอี่ยน",
                "บ้านค้อ",
                "บ้านเหล่า",
                "เหล่าสร้างถ่อ",
                "โพนงาม",
                "น้ำเที่ยง"
            ]
        },
        "ดอนตาล": {
            "PostCode": 49120,
            "Tambons": [
                "เหล่าหมี",
                "ป่าไร่",
                "บ้านบาก",
                "นาสะเม็ง",
                "บ้านแก้ง",
                "โพธิ์ไทร",
                "ดอนตาล"
            ]
        },
        "นิคมคำสร้อย": {
            "PostCode": 49130,
            "Tambons": [
                "โชคชัย",
                "กกแดง",
                "หนองแวง",
                "นากอก",
                "นิคมคำสร้อย",
                "ร่มเกล้า",
                "นาอุดม"
            ]
        },
        "ดงหลวง": {
            "PostCode": 49140,
            "Tambons": [
                "พังแดง",
                "ชะโนดน้อย",
                "กกตูม",
                "หนองบัว",
                "ดงหลวง",
                "หนองแคน"
            ]
        },
        "หว้านใหญ่": {
            "PostCode": 49150,
            "Tambons": [
                "ป่งขาม",
                "หว้านใหญ่",
                "ดงหมู",
                "ชะโนด",
                "บางทรายน้อย"
            ]
        },
        "หนองสูง": {
            "PostCode": 49160,
            "Tambons": [
                "บ้านเป้า",
                "ภูวง",
                "โนนยาง",
                "หนองสูง",
                "หนองสูงใต้",
                "หนองสูงเหนือ"
            ]
        }
    },
    "เชียงใหม่": {
        "เมืองเชียงใหม่": {
            "PostCode": 50000,
            "Tambons": [
                "หนองหอย",
                "หนองป่าครั่ง",
                "ฟ้าฮ่าม",
                "ท่าศาลา",
                "วัดเกต",
                "ช้างคลาน",
                "หายยา",
                "แม่เหียะ",
                "ป่าแดด",
                "ศรีภูมิ",
                "พระสิงห์",
                "สุเทพ",
                "สันผีเสื้อ",
                "ป่าตัน",
                "ช้างเผือก",
                "ช้างม่อย",
                "สันผีเสื้อ"
            ]
        },
        "ฝาง": {
            "PostCode": 50110,
            "Tambons": [
                "สันทราย",
                "เวียง",
                "แม่สูน",
                "แม่คะ",
                "ม่อนปิ่น",
                "โป่งน้ำร้อน",
                "แม่ข่า",
                "แม่งอน"
            ]
        },
        "สันป่าตอง": {
            "PostCode": 50120,
            "Tambons": [
                "น้ำบ่อหลวง",
                "บ้านกลาง",
                "บ้านแม",
                "ทุ่งสะโตก",
                "มะขามหลวง",
                "มะขุนหวาน",
                "สันกลาง",
                "ยุหว่า",
                "แม่ก๊า",
                "ทุ่งต้อม",
                "ท่าวังพร้าว"
            ]
        },
        "สันกำแพง": {
            "PostCode": 50130,
            "Tambons": [
                "ร้องวัวแดง",
                "แช่ช้าง",
                "แม่ปูคา",
                "ต้นเปา",
                "ทรายมูล",
                "ออนใต้",
                "ห้วยทราย",
                "สันกำแพง",
                "บวกค้าง",
                "สันกลาง"
            ]
        },
        "แม่ออน": {
            "PostCode": 50130,
            "Tambons": [
                "ทาเหนือ",
                "บ้านสหกรณ์",
                "ออนเหนือ",
                "แม่ทา",
                "ห้วยแก้ว",
                "ออนกลาง"
            ]
        },
        "สารภี": {
            "PostCode": 50140,
            "Tambons": [
                "สารภี",
                "ป่าบง",
                "ขัวมุง",
                "ชมภู",
                "ไชยสถาน",
                "ดอนแก้ว",
                "ท่ากว้าง",
                "ท่าวังตาล",
                "หนองแฝก",
                "หนองผึ้ง",
                "ยางเนิ้ง",
                "สันทราย"
            ]
        },
        "แม่แตง": {
            "PostCode": 50150,
            "Tambons": [
                "สันมหาพน",
                "เมืองก๋าย",
                "อินทขิล",
                "แม่แตง",
                "แม่หอพระ",
                "บ้านเป้า",
                "กื้ดช้าง",
                "ขี้เหล็ก",
                "ป่าแป๋",
                "ช่อแล",
                "บ้านช้าง",
                "สบเปิง",
                "สันป่ายาง",
                "สบเปิง"
            ]
        },
        "จอมทอง": {
            "PostCode": 50160,
            "Tambons": [
                "บ้านหลวง",
                "ดอยแก้ว",
                "ข่วงเปา",
                "สบเตี๊ยะ",
                "แม่สอย",
                "บ้านแปะ",
                "แม่สอย"
            ]
        },
        "ดอยหล่อ": {
            "PostCode": 50160,
            "Tambons": [
                "สันติสุข",
                "สองแคว",
                "ดอยหล่อ",
                "ยางคราม"
            ]
        },
        "เชียงดาว": {
            "PostCode": 50170,
            "Tambons": [
                "เมืองคอง",
                "เมืองงาย",
                "ปิงโค้ง",
                "ทุ่งข้าวพวง",
                "เชียงดาว",
                "แม่นะ",
                "เมืองนะ"
            ]
        },
        "แม่ริม": {
            "PostCode": 50180,
            "Tambons": [
                "แม่สา",
                "สันโป่ง",
                "ห้วยทราย",
                "แม่แรม",
                "โป่งแยง",
                "ดอนแก้ว",
                "ริมใต้",
                "ขี้เหล็ก",
                "ริมเหนือ",
                "เหมืองแก้ว",
                "สะลวง"
            ]
        },
        "พร้าว": {
            "PostCode": 50190,
            "Tambons": [
                "เวียง",
                "ทุ่งหลวง",
                "สันทราย",
                "แม่แวน",
                "โหล่งขอด",
                "น้ำแพร่",
                "ป่าไหน่",
                "บ้านโป่ง",
                "ป่าตุ้ม",
                "แม่ปั๋ง",
                "เขื่อนผาก"
            ]
        },
        "สันทราย": {
            "PostCode": 50210,
            "Tambons": [
                "ป่าไผ่",
                "เมืองเล็น",
                "สันทรายน้อย",
                "สันทรายหลวง",
                "สันนาเม็ง",
                "สันป่าเปา",
                "สันพระเนตร",
                "หนองแหย่ง",
                "หนองจ๊อม",
                "หนองหาร",
                "แม่แฝกใหม่",
                "แม่แฝก",
                "หนองจ๊อม"
            ]
        },
        "ดอยสะเก็ด": {
            "PostCode": 50220,
            "Tambons": [
                "ลวงเหนือ",
                "สันปูเลย",
                "สง่าบ้าน",
                "แม่ฮ้อยเงิน",
                "แม่โป่ง",
                "แม่คือ",
                "ป่าลาน",
                "ป่าเมี่ยง",
                "ป่าป้อง",
                "เทพเสด็จ",
                "ตลาดใหญ่",
                "ตลาดขวัญ",
                "สำราญราษฎร์",
                "เชิงดอย"
            ]
        },
        "หางดง": {
            "PostCode": 50230,
            "Tambons": [
                "บ้านปง",
                "หางดง",
                "หนองแก๋ว",
                "หารแก้ว",
                "น้ำแพร่",
                "หนองควาย",
                "สันผักหวาน",
                "บ้านแหวน",
                "ขุนคง",
                "สบแม่ข่า",
                "หนองตอง"
            ]
        },
        "ฮอด": {
            "PostCode": 50240,
            "Tambons": [
                "นาคอเรือ",
                "บ่อสลี",
                "หางดง",
                "ฮอด",
                "บ้านตาล",
                "บ่อหลวง"
            ]
        },
        "สะเมิง": {
            "PostCode": 50250,
            "Tambons": [
                "ยั้งเมิน",
                "สะเมิงเหนือ",
                "บ่อแก้ว",
                "สะเมิงใต้",
                "แม่สาบ"
            ]
        },
        "ดอยเต่า": {
            "PostCode": 50260,
            "Tambons": [
                "มืดกา",
                "โปงทุ่ง",
                "ดอยเต่า",
                "บ้านแอ่น",
                "บงตัน",
                "ท่าเดื่อ"
            ]
        },
        "แม่แจ่ม": {
            "PostCode": 50270,
            "Tambons": [
                "แม่ศึก",
                "แม่นาจร",
                "ปางหินฝน",
                "บ้านทับ",
                "ท่าผา",
                "กองแขก",
                "ช่างเคิ่ง"
            ]
        },
        "แม่อาย": {
            "PostCode": 50280,
            "Tambons": [
                "สันต้นหมื้อ",
                "แม่อาย",
                "ท่าตอน",
                "บ้านหลวง",
                "มะลิกา",
                "แม่นาวาง",
                "แม่สาว"
            ]
        },
        "อมก๋อย": {
            "PostCode": 50310,
            "Tambons": [
                "สบโขง",
                "แม่ตื่น",
                "ม่อนจอง",
                "อมก๋อย",
                "นาเกียน",
                "ยางเปียง"
            ]
        },
        "ไชยปราการ": {
            "PostCode": 50320,
            "Tambons": [
                "ปงตำ",
                "แม่ทะลบ",
                "หนองบัว",
                "ศรีดงเย็น"
            ]
        },
        "เวียงแหง": {
            "PostCode": 50350,
            "Tambons": [
                "เปียงหลวง",
                "เมืองแหง",
                "แสนไห"
            ]
        },
        "แม่วาง": {
            "PostCode": 50360,
            "Tambons": [
                "แม่วิน",
                "บ้านกาด",
                "ทุ่งปี๊",
                "ทุ่งรวงทอง",
                "ดอนเปา"
            ]
        },
        "กัลยาณิวัฒนา": {
            "PostCode": 58130,
            "Tambons": [
                "แม่แดด",
                "แจ่มหลวง",
                "บ้านจันทร์"
            ]
        }
    },
    "ลำพูน": {
        "เมืองลำพูน": {
            "PostCode": 51000,
            "Tambons": [
                "ในเมือง",
                "เหมืองง่า",
                "ป่าสัก",
                "ริมปิง",
                "ประตูป่า",
                "ศรีบัวบาน",
                "มะเขือแจ้",
                "บ้านกลาง",
                "หนองหนาม",
                "เหมืองจี้",
                "บ้านแป้น",
                "ต้นธง",
                "เวียงยอง",
                "หนองช้างคืน",
                "อุโมงค์"
            ]
        },
        "ลี้": {
            "PostCode": 51110,
            "Tambons": [
                "ศรีวิชัย",
                "ป่าไผ่",
                "แม่ลาน",
                "ลี้",
                "แม่ตืน",
                "ก้อ",
                "ดงดำ",
                "นาทราย"
            ]
        },
        "เวียงหนองล่อง": {
            "PostCode": 51120,
            "Tambons": [
                "หนองล่อง",
                "หนองยวง",
                "วังผาง"
            ]
        },
        "ป่าซาง": {
            "PostCode": 51120,
            "Tambons": [
                "นครเจดีย์",
                "น้ำดิบ",
                "ท่าตุ้ม",
                "มะกอก",
                "บ้านเรือน",
                "ม่วงน้อย",
                "ปากบ่อง",
                "ป่าซาง",
                "แม่แรง"
            ]
        },
        "บ้านโฮ่ง": {
            "PostCode": 51130,
            "Tambons": [
                "หนองปลาสะวาย",
                "ศรีเตี้ย",
                "เหล่ายาว",
                "ป่าพลู",
                "บ้านโฮ่ง"
            ]
        },
        "แม่ทา": {
            "PostCode": 51140,
            "Tambons": [
                "ทาปลาดุก",
                "ทาสบเส้า",
                "ทาทุ่งหลวง",
                "ทาขุมเงิน",
                "ทากาศ",
                "ทาแม่ลอบ"
            ]
        },
        "ทุ่งหัวช้าง": {
            "PostCode": 51160,
            "Tambons": [
                "บ้านปวง",
                "ทุ่งหัวช้าง",
                "ตะเคียนปม"
            ]
        },
        "บ้านธิ": {
            "PostCode": 51180,
            "Tambons": [
                "บ้านธิ",
                "ห้วยยาบ"
            ]
        }
    },
    "ลำปาง": {
        "เมืองลำปาง": {
            "PostCode": 52000,
            "Tambons": [
                "เวียงเหนือ",
                "ทุ่งฝาย",
                "พิชัย",
                "บ้านเสด็จ",
                "บ้านแลง",
                "ต้นธงชัย",
                "นิคมพัฒนา",
                "บุญนาคพัฒนา",
                "กล้วยแพะ",
                "หัวเวียง",
                "พระบาท",
                "สวนดอก",
                "สบตุ๋ย",
                "ชมพู",
                "บ้านเป้า",
                "บ่อแฮ้ว",
                "ปงแสนทอง",
                "บ้านเอื้อม",
                "บ้านค่า",
                "พระบาท"
            ]
        },
        "แม่เมาะ": {
            "PostCode": 52000,
            "Tambons": [
                "บ้านดง",
                "นาสัก",
                "สบป้าด",
                "แม่เมาะ",
                "จางเหนือ",
                "บ้านดง"
            ]
        },
        "งาว": {
            "PostCode": 52110,
            "Tambons": [
                "ปงเตา",
                "บ้านร้อง",
                "บ้านโป่ง",
                "หลวงใต้",
                "หลวงเหนือ",
                "แม่ตีบ",
                "นาแก",
                "บ้านหวด",
                "บ้านแหง",
                "บ้านอ้อน"
            ]
        },
        "แจ้ห่ม": {
            "PostCode": 52120,
            "Tambons": [
                "บ้านสา",
                "วิเชตนคร",
                "ทุ่งผึ้ง",
                "เมืองมาย",
                "แม่สุก",
                "แจ้ห่ม",
                "ปงดอน"
            ]
        },
        "เกาะคา": {
            "PostCode": 52130,
            "Tambons": [
                "นาแก้ว",
                "ใหม่พัฒนา",
                "ท่าผา",
                "นาแส่ง",
                "เกาะคา",
                "ศาลา",
                "ลำปางหลวง",
                "ไหล่หิน",
                "วังพร้าว"
            ]
        },
        "วังเหนือ": {
            "PostCode": 52140,
            "Tambons": [
                "วังแก้ว",
                "ทุ่งฮั้ว",
                "วังเหนือ",
                "วังใต้",
                "ร่องเคาะ",
                "วังทอง",
                "วังซ้าย",
                "วังทรายคำ"
            ]
        },
        "แม่ทะ": {
            "PostCode": 52150,
            "Tambons": [
                "วังเงิน",
                "หัวเสือ",
                "ดอนไฟ",
                "น้ำโจ้",
                "บ้านบอม",
                "บ้านกิ่ว",
                "ป่าตัน",
                "นาครัว",
                "สันดอนแก้ว",
                "แม่ทะ",
                "แม่ทะ"
            ]
        },
        "เถิน": {
            "PostCode": 52160,
            "Tambons": [
                "เวียงมอก",
                "นาโป่ง",
                "แม่ถอด",
                "เถินบุรี",
                "ล้อมแรด",
                "แม่ปะ",
                "แม่มอก",
                "แม่วะ"
            ]
        },
        "สบปราบ": {
            "PostCode": 52170,
            "Tambons": [
                "แม่กัวะ",
                "นายาง",
                "สมัย",
                "สบปราบ"
            ]
        },
        "แม่พริก": {
            "PostCode": 52180,
            "Tambons": [
                "แม่ปุ",
                "แม่พริก",
                "ผาปัง",
                "พระบาทวังตวง",
                "พระบาทวังตวง"
            ]
        },
        "ห้างฉัตร": {
            "PostCode": 52190,
            "Tambons": [
                "หนองหล่ม",
                "ห้างฉัตร",
                "เวียงตาล",
                "แม่สัน",
                "วอแก้ว",
                "เมืองยาว",
                "ปงยางคก"
            ]
        },
        "เสริมงาม": {
            "PostCode": 52210,
            "Tambons": [
                "เสริมซ้าย",
                "เสริมกลาง",
                "เสริมขวา",
                "ทุ่งงาม"
            ]
        },
        "เมืองปาน": {
            "PostCode": 52240,
            "Tambons": [
                "แจ้ซ้อน",
                "ทุ่งกว๋าว",
                "หัวเมือง",
                "เมืองปาน",
                "บ้านขอ"
            ]
        }
    },
    "อุตรดิตถ์": {
        "เมืองอุตรดิตถ์": {
            "PostCode": 53000,
            "Tambons": [
                "หาดกรวด",
                "ท่าเสา",
                "คุ้งตะเภา",
                "งิ้วงาม",
                "บ้านด่านนาขาม",
                "บ้านด่าน",
                "ผาจุก",
                "น้ำริด",
                "ป่าเซ่า",
                "วังดิน",
                "ท่าอิฐ",
                "แสนตอ",
                "ขุนฝาง",
                "ถ้ำฉลอง",
                "หาดงิ้ว",
                "บ้านเกาะ",
                "วังกะพี้",
                "บ้านเกาะ"
            ]
        },
        "น้ำปาด": {
            "PostCode": 53110,
            "Tambons": [
                "ห้วยมุ่น",
                "น้ำไคร้",
                "เด่นเหล็ก",
                "น้ำไผ่",
                "แสนตอ",
                "บ้านฝาย",
                "ท่าแฝก"
            ]
        },
        "พิชัย": {
            "PostCode": 53120,
            "Tambons": [
                "ในเมือง",
                "ไร่อ้อย",
                "คอรุม",
                "บ้านหม้อ",
                "บ้านโคน",
                "พญาแมน",
                "นายาง",
                "ท่ามะเฟือง",
                "นาอิน",
                "ท่าสัก",
                "บ้านดารา"
            ]
        },
        "ลับแล": {
            "PostCode": 53130,
            "Tambons": [
                "ฝายหลวง",
                "ชัยจุมพล",
                "นานกกก",
                "แม่พูล",
                "ศรีพนมมาศ",
                "ไผ่ล้อม",
                "ทุ่งยั้ง",
                "ด่านแม่คำมัน"
            ]
        },
        "ตรอน": {
            "PostCode": 53140,
            "Tambons": [
                "บ้านแก่ง",
                "วังแดง",
                "หาดสองแคว",
                "น้ำอ่าง",
                "ข่อยสูง"
            ]
        },
        "ท่าปลา": {
            "PostCode": 53150,
            "Tambons": [
                "น้ำหมัน",
                "นางพญา",
                "จริม",
                "ท่าปลา",
                "หาดล้า",
                "ผาเลือด",
                "ร่วมจิต",
                "หาดล้า"
            ]
        },
        "ฟากท่า": {
            "PostCode": 53160,
            "Tambons": [
                "สองห้อง",
                "บ้านเสี้ยว",
                "สองคอน",
                "ฟากท่า"
            ]
        },
        "บ้านโคก": {
            "PostCode": 53180,
            "Tambons": [
                "ม่วงเจ็ดต้น",
                "บ้านโคก",
                "นาขุม",
                "บ่อเบี้ย"
            ]
        },
        "ทองแสนขัน": {
            "PostCode": 53230,
            "Tambons": [
                "ป่าคาย",
                "บ่อทอง",
                "ผักขวง",
                "น้ำพี้"
            ]
        }
    },
    "แพร่": {
        "เมืองแพร่": {
            "PostCode": 54000,
            "Tambons": [
                "ป่าแมต",
                "บ้านถิ่น",
                "ในเวียง",
                "เหมืองหม้อ",
                "ทุ่งโฮ้ง",
                "ป่าแดง",
                "น้ำชำ",
                "นาจักร",
                "สวนเขื่อน",
                "วังหงส์",
                "ห้วยม้า",
                "วังธง",
                "แม่หล่าย",
                "ท่าข้าม",
                "แม่ยม",
                "ช่อแฮ",
                "ร่องฟอง",
                "กาญจนา",
                "แม่คำมี",
                "ทุ่งกวาว"
            ]
        },
        "สูงเม่น": {
            "PostCode": 54000,
            "Tambons": [
                "เวียงทอง",
                "หัวฝาย",
                "ดอนมูล",
                "บ้านเหล่า",
                "บ้านกวาง",
                "บ้านกาศ",
                "ร่องกาศ",
                "สบสาย",
                "พระหลวง",
                "น้ำชำ",
                "บ้านปง",
                "สูงเม่น"
            ]
        },
        "เด่นชัย": {
            "PostCode": 54110,
            "Tambons": [
                "เด่นชัย",
                "แม่จั๊วะ",
                "ไทรย้อย",
                "ห้วยไร่",
                "ปงป่าหวาย"
            ]
        },
        "สอง": {
            "PostCode": 54120,
            "Tambons": [
                "ทุ่งน้าว",
                "บ้านหนุน",
                "สะเอียบ",
                "หัวเมือง",
                "เตาปูน",
                "บ้านกลาง",
                "ห้วยหม้าย",
                "แดนชุมพล"
            ]
        },
        "ร้องกวาง": {
            "PostCode": 54140,
            "Tambons": [
                "แม่ยางร้อง",
                "ห้วยโรง",
                "น้ำเลา",
                "บ้านเวียง",
                "ทุ่งศรี",
                "แม่ยางตาล",
                "แม่ยางฮ่อ",
                "ไผ่โทน",
                "ร้องกวาง",
                "ร้องเข็ม",
                "แม่ทราย"
            ]
        },
        "ลอง": {
            "PostCode": 54150,
            "Tambons": [
                "ห้วยอ้อ",
                "บ้านปิน",
                "แม่ปาน",
                "บ่อเหล็กลอง",
                "ทุ่งแล้ง",
                "ต้าผามอก",
                "หัวทุ่ง",
                "ปากกาง",
                "เวียงต้า"
            ]
        },
        "วังชิ้น": {
            "PostCode": 54160,
            "Tambons": [
                "ป่าสัก",
                "แม่ป้าก",
                "สรอย",
                "แม่เกิ๋ง",
                "วังชิ้น",
                "แม่พุง",
                "นาพูน"
            ]
        },
        "หนองม่วงไข่": {
            "PostCode": 54170,
            "Tambons": [
                "แม่คำมี",
                "น้ำรัด",
                "ทุ่งแค้ว",
                "หนองม่วงไข่",
                "วังหลวง",
                "ตำหนักธรรม"
            ]
        }
    },
    "น่าน": {
        "เมืองน่าน": {
            "PostCode": 55000,
            "Tambons": [
                "เรือง",
                "ดู่ใต้",
                "ผาสิงห์",
                "กองควาย",
                "บ่อ",
                "ในเวียง",
                "บ่อสวก",
                "สะเนียน",
                "นาซาว",
                "ถืมตอง",
                "ไชยสถาน"
            ]
        },
        "ภูเพียง": {
            "PostCode": 55000,
            "Tambons": [
                "ม่วงตึ๊ด",
                "น้ำแก่น",
                "นาปัง",
                "น้ำเกี๋ยน",
                "เมืองจัง",
                "ท่าน้าว",
                "ฝายแก้ว"
            ]
        },
        "เวียงสา": {
            "PostCode": 55110,
            "Tambons": [
                "ส้าน",
                "ทุ่งศรีทอง",
                "แม่สา",
                "น้ำมวบ",
                "ตาลชุม",
                "จอมจันทร์",
                "นาเหลือง",
                "ส้านนาหนองใหม่",
                "ปงสนุก",
                "ไหล่น่าน",
                "กลางเวียง",
                "แม่สาคร",
                "อ่ายนาไลย",
                "น้ำปั้ว",
                "ยาบหัวนา",
                "แม่ขะนิง",
                "ขึ่ง"
            ]
        },
        "ปัว": {
            "PostCode": 55120,
            "Tambons": [
                "ปัว",
                "ภูคา",
                "แงง",
                "ป่ากลาง",
                "วรนคร",
                "สถาน",
                "เจดีย์ชัย",
                "ศิลาแลง",
                "ศิลาเพชร",
                "สกาด",
                "อวน",
                "ไชยวัฒนา"
            ]
        },
        "ทุ่งช้าง": {
            "PostCode": 55130,
            "Tambons": [
                "ปอน",
                "งอบ",
                "และ",
                "ทุ่งช้าง"
            ]
        },
        "เฉลิมพระเกียรติ": {
            "PostCode": 55130,
            "Tambons": [
                "ห้วยโก๋น",
                "ขุนน่าน"
            ]
        },
        "ท่าวังผา": {
            "PostCode": 55140,
            "Tambons": [
                "แสนทอง",
                "ศรีภูมิ",
                "ตาลชุม",
                "ยม",
                "ผาตอ",
                "ท่าวังผา",
                "ป่าคา",
                "ผาทอง",
                "ริม",
                "จอมพระ"
            ]
        },
        "นาน้อย": {
            "PostCode": 55150,
            "Tambons": [
                "สถาน",
                "ศรีษะเกษ",
                "น้ำตก",
                "บัวใหญ่",
                "สันทะ",
                "นาน้อย",
                "เชียงของ"
            ]
        },
        "เชียงกลาง": {
            "PostCode": 55160,
            "Tambons": [
                "เชียงคาน",
                "พญาแก้ว",
                "เปือ",
                "พระพุทธบาท",
                "เชียงกลาง",
                "พระธาตุ"
            ]
        },
        "สองแคว": {
            "PostCode": 55160,
            "Tambons": [
                "ยอด",
                "ชนแดน",
                "นาไร่หลวง"
            ]
        },
        "แม่จริม": {
            "PostCode": 55170,
            "Tambons": [
                "น้ำปาย",
                "น้ำพาง",
                "หมอเมือง",
                "หนองแดง",
                "แม่จริม"
            ]
        },
        "นาหมื่น": {
            "PostCode": 55180,
            "Tambons": [
                "นาทะนุง",
                "ปิงหลวง",
                "บ่อแก้ว",
                "เมืองลี"
            ]
        },
        "บ้านหลวง": {
            "PostCode": 55190,
            "Tambons": [
                "บ้านฟ้า",
                "ป่าคาหลวง",
                "สวด",
                "บ้านพี้"
            ]
        },
        "สันติสุข": {
            "PostCode": 55210,
            "Tambons": [
                "พงษ์",
                "ป่าแลวหลวง",
                "ดู่พงษ์"
            ]
        },
        "บ่อเกลือ": {
            "PostCode": 55220,
            "Tambons": [
                "บ่อเกลือใต้",
                "ภูฟ้า",
                "ดงพญา",
                "บ่อเกลือเหนือ"
            ]
        }
    },
    "พะเยา": {
        "เมืองพะเยา": {
            "PostCode": 56000,
            "Tambons": [
                "สันป่าม่วง",
                "บ้านต๋อม",
                "แม่ต๋ำ",
                "บ้านต๊ำ",
                "ท่าวังทอง",
                "บ้านตุ่น",
                "แม่ใส",
                "จำป่าหวาย",
                "แม่ปืม",
                "เวียง",
                "แม่กา",
                "บ้านใหม่",
                "ท่าจำปี",
                "บ้านสาง",
                "แม่นาเรือ"
            ]
        },
        "ภูกามยาว": {
            "PostCode": 56000,
            "Tambons": [
                "แม่อิง",
                "ห้วยแก้ว",
                "ดงเจน"
            ]
        },
        "เชียงคำ": {
            "PostCode": 56110,
            "Tambons": [
                "อ่างทอง",
                "เชียงบาน",
                "ทุ่งผาสุข",
                "แม่ลาว",
                "ร่มเย็น",
                "เจดีย์คำ",
                "เวียง",
                "น้ำแวน",
                "หย่วน",
                "ฝายกวาง"
            ]
        },
        "ภูซาง": {
            "PostCode": 56110,
            "Tambons": [
                "สบบง",
                "เชียงแรง",
                "ทุ่งกล้วย",
                "ป่าสัก",
                "ภูซาง"
            ]
        },
        "ดอกคำใต้": {
            "PostCode": 56120,
            "Tambons": [
                "คือเวียง",
                "บุญเกิด",
                "บ้านถ้ำ",
                "ดอนศรีชุม",
                "สว่างอารมณ์",
                "บ้านปิน",
                "ห้วยลาน",
                "สันโค้ง",
                "ป่าซาง",
                "หนองหล่ม",
                "ดอกคำใต้",
                "ดงสุวรรณ"
            ]
        },
        "แม่ใจ": {
            "PostCode": 56130,
            "Tambons": [
                "ศรีถ้อย",
                "เจริญราษฎร์",
                "บ้านเหล่า",
                "ป่าแฝก",
                "แม่สุก",
                "แม่ใจ"
            ]
        },
        "ปง": {
            "PostCode": 56140,
            "Tambons": [
                "ปง",
                "ควร",
                "ออย",
                "งิม",
                "ผาช้างน้อย",
                "นาปรัง",
                "ขุนควร"
            ]
        },
        "จุน": {
            "PostCode": 56150,
            "Tambons": [
                "ทุ่งรวงทอง",
                "พระธาตุขิงแกง",
                "ห้วยยางขาม",
                "หงส์หิน",
                "ลอ",
                "จุน",
                "ห้วยข้าวก่ำ"
            ]
        },
        "เชียงม่วน": {
            "PostCode": 56160,
            "Tambons": [
                "เชียงม่วน",
                "บ้านมาง",
                "สระ"
            ]
        }
    },
    "เชียงราย": {
        "แม่ลาว": {
            "PostCode": 57000,
            "Tambons": [
                "โป่งแพร่",
                "จอมหมอกแก้ว",
                "ดงมะดะ",
                "บัวสลี",
                "ป่าก่อดำ"
            ]
        },
        "เมืองเชียงราย": {
            "PostCode": 57000,
            "Tambons": [
                "ห้วยสัก",
                "ห้วยชมภู",
                "สันทราย",
                "เวียง",
                "รอบเวียง",
                "ท่าสาย",
                "แม่กรณ์",
                "ดอยฮาง",
                "ป่าอ้อดอนชัย",
                "ดอยลาน",
                "แม่ข้าวต้ม",
                "แม่ยาว",
                "นางแล",
                "ท่าสุด",
                "บ้านดู่",
                "ริมกก"
            ]
        },
        "ดอยหลวง": {
            "PostCode": 57110,
            "Tambons": [
                "ปงน้อย",
                "หนองป่าก่อ",
                "โชคชัย"
            ]
        },
        "แม่จัน": {
            "PostCode": 57110,
            "Tambons": [
                "แม่จัน",
                "ศรีค้ำ",
                "สันทราย",
                "ป่าตึง",
                "ป่าซาง",
                "ท่าข้าวเปลือก",
                "จอมสวรรค์",
                "แม่คำ",
                "แม่ไร่",
                "จันจว้า",
                "จันจว้าใต้"
            ]
        },
        "แม่ฟ้าหลวง": {
            "PostCode": 57110,
            "Tambons": [
                "แม่สลองใน",
                "แม่สลองนอก",
                "แม่ฟ้าหลวง",
                "เทอดไทย"
            ]
        },
        "พาน": {
            "PostCode": 57120,
            "Tambons": [
                "ม่วงคำ",
                "เมืองพาน",
                "สันมะเค็ด",
                "สันติสุข",
                "แม่อ้อ",
                "หัวง้ม",
                "ป่าหุ่ง",
                "เวียงห้าว",
                "ทรายขาว",
                "ดอยงาม",
                "สันกลาง",
                "เจริญเมือง",
                "ธารทอง",
                "ทานตะวัน",
                "แม่เย็น"
            ]
        },
        "แม่สาย": {
            "PostCode": 57130,
            "Tambons": [
                "ศรีเมืองชุม",
                "เกาะช้าง",
                "โป่งงาม",
                "โป่งผา",
                "แม่สาย",
                "เวียงพางคำ",
                "บ้านด้าย",
                "ห้วยไคร้"
            ]
        },
        "เชียงของ": {
            "PostCode": 57140,
            "Tambons": [
                "ครึ่ง",
                "บุญเรือง",
                "ริมโขง",
                "เวียง",
                "ศรีดอนชัย",
                "สถาน",
                "ห้วยซ้อ"
            ]
        },
        "เชียงแสน": {
            "PostCode": 57150,
            "Tambons": [
                "โยนก",
                "ศรีดอนมูล",
                "ป่าสัก",
                "เวียง",
                "แม่เงิน",
                "บ้านแซว"
            ]
        },
        "เทิง": {
            "PostCode": 57160,
            "Tambons": [
                "สันทรายงาม",
                "เวียง",
                "หงาว",
                "ตับเต่า",
                "งิ้ว",
                "หนองแรด",
                "ศรีดอนไชย",
                "แม่ลอย",
                "ปล้อง",
                "เชียงเคี่ยน",
                "งิ้ว"
            ]
        },
        "เวียงป่าเป้า": {
            "PostCode": 57170,
            "Tambons": [
                "ป่างิ้ว",
                "สันสลี",
                "เวียง",
                "บ้านโป่ง",
                "แม่เจดีย์ใหม่",
                "เวียงกาหลง",
                "แม่เจดีย์"
            ]
        },
        "แม่สรวย": {
            "PostCode": 57180,
            "Tambons": [
                "แม่พริก",
                "ท่าก๊อ",
                "ป่าแดด",
                "วาวี",
                "แม่สรวย",
                "เจดีย์หลวง",
                "ศรีถ้อย"
            ]
        },
        "ป่าแดด": {
            "PostCode": 57190,
            "Tambons": [
                "ป่าแงะ",
                "สันมะค่า",
                "ศรีโพธิ์เงิน",
                "โรงช้าง",
                "ป่าแดด"
            ]
        },
        "เวียงเชียงรุ้ง": {
            "PostCode": 57210,
            "Tambons": [
                "ป่าซาง",
                "ทุ่งก่อ",
                "ดงมหาวัน"
            ]
        },
        "เวียงชัย": {
            "PostCode": 57210,
            "Tambons": [
                "ดอนศิลา",
                "เวียงเหนือ",
                "ผางาม",
                "เวียงชัย",
                "เมืองชุม"
            ]
        },
        "พญาเม็งราย": {
            "PostCode": 57290,
            "Tambons": [
                "แม่เปา",
                "แม่ต๋ำ",
                "เม็งราย",
                "ตาดควัน",
                "ไม้ยา"
            ]
        },
        "เวียงแก่น": {
            "PostCode": 57310,
            "Tambons": [
                "หล่ายงาว",
                "ม่วงยาย",
                "ปอ",
                "ท่าข้าม"
            ]
        },
        "ขุนตาล": {
            "PostCode": 57340,
            "Tambons": [
                "ป่าตาล",
                "ยางฮอม",
                "ต้า"
            ]
        }
    },
    "แม่ฮ่องสอน": {
        "เมืองแม่ฮ่องสอน": {
            "PostCode": 58000,
            "Tambons": [
                "หมอกจำแป่",
                "จองคำ",
                "ห้วยปูลิง",
                "ห้วยผา",
                "ห้วยโป่ง",
                "ปางหมู",
                "ผาบ่อง"
            ]
        },
        "แม่สะเรียง": {
            "PostCode": 58110,
            "Tambons": [
                "แม่เหาะ",
                "แม่ยวม",
                "เสาหิน",
                "บ้านกาศ",
                "ป่าแป๋",
                "แม่คง",
                "แม่สะเรียง"
            ]
        },
        "สบเมย": {
            "PostCode": 58110,
            "Tambons": [
                "แม่สามแลบ",
                "ป่าโปง",
                "แม่สวด",
                "สบเมย",
                "แม่คะตวน",
                "กองก๋อย"
            ]
        },
        "แม่ลาน้อย": {
            "PostCode": 58120,
            "Tambons": [
                "ท่าผาปุ้ม",
                "ขุนแม่ลาน้อย",
                "สันติคีรี",
                "แม่นาจาง",
                "ห้วยห้อม",
                "แม่โถ",
                "แม่ลาน้อย",
                "แม่ลาหลวง"
            ]
        },
        "ปาย": {
            "PostCode": 58130,
            "Tambons": [
                "เวียงใต้",
                "โป่งสา",
                "เมืองแปง",
                "เวียงเหนือ",
                "แม่นาเติง",
                "แม่ฮี้",
                "ทุ่งยาว"
            ]
        },
        "ขุนยวม": {
            "PostCode": 58140,
            "Tambons": [
                "แม่กิ๊",
                "แม่ยวมน้อย",
                "เมืองปอน",
                "ขุนยวม",
                "แม่อูคอ",
                "แม่เงา"
            ]
        },
        "ปางมะผ้า": {
            "PostCode": 58150,
            "Tambons": [
                "นาปู่ป้อม",
                "สบป่อง",
                "ถ้ำลอด",
                "ปางมะผ้า"
            ]
        }
    },
    "นครสวรรค์": {
        "เมืองนครสวรรค์": {
            "PostCode": 60000,
            "Tambons": [
                "ตะเคียนเลื่อน",
                "พระนอน",
                "หนองปลิง",
                "บึงเสนาท",
                "แควใหญ่",
                "บ้านมะเกลือ",
                "บ้านแก่ง",
                "บางพระหลวง",
                "เกรียงไกร",
                "นครสวรรค์ตก",
                "บางม่วง",
                "กลางแดด",
                "นครสวรรค์ออก",
                "ปากน้ำโพ",
                "วัดไทร",
                "หนองกรด",
                "หนองกระโดน"
            ]
        },
        "หนองบัว": {
            "PostCode": 60110,
            "Tambons": [
                "ธารทหาร",
                "ห้วยร่วม",
                "ห้วยถั่วใต้",
                "ห้วยถั่วเหนือ",
                "หนองบัว",
                "ห้วยใหญ่",
                "ทุ่งทอง",
                "วังบ่อ",
                "หนองกลับ"
            ]
        },
        "ชุมแสง": {
            "PostCode": 60120,
            "Tambons": [
                "หนองกระเจา",
                "พิกุล",
                "ฆะมัง",
                "ไผ่สิงห์",
                "โคกหม้อ",
                "บางเคียน",
                "ชุมแสง",
                "ท่าไม้",
                "เกยไชย",
                "ทับกฤชใต้",
                "พันลาน",
                "ทับกฤช"
            ]
        },
        "พยุหะคีรี": {
            "PostCode": 60130,
            "Tambons": [
                "สระทะเล",
                "เขาทอง",
                "ย่านมัทรี",
                "ยางขาว",
                "ม่วงหัก",
                "เขากะลา",
                "นิคมเขาบ่อแก้ว",
                "เนินมะกอก",
                "พยุหะ",
                "ท่าน้ำอ้อย",
                "น้ำทรง"
            ]
        },
        "ตาคลี": {
            "PostCode": 60140,
            "Tambons": [
                "ตาคลี",
                "หัวหวาย",
                "หนองโพ",
                "หนองหม้อ",
                "พรหมนิมิต",
                "สร้อยทอง",
                "ห้วยหอม",
                "ช่องแค",
                "ลาดทิพรส",
                "จันเสน"
            ]
        },
        "แม่วงก์": {
            "PostCode": 60150,
            "Tambons": [
                "แม่เล่ย์",
                "เขาชนกัน",
                "แม่วงก์",
                "วังซ่าน"
            ]
        },
        "แม่เปิน": {
            "PostCode": 60150,
            "Tambons": [
                "แม่เปิน"
            ]
        },
        "ลาดยาว": {
            "PostCode": 60150,
            "Tambons": [
                "ลาดยาว",
                "สระแก้ว",
                "ศาลเจ้าไก่ต่อ",
                "เนินขี้เหล็ก",
                "บ้านไร่",
                "หนองนมวัว",
                "หนองยาว",
                "มาบแก",
                "สร้อยละคร",
                "วังเมือง",
                "วังม้า",
                "ห้วยน้ำหอม"
            ]
        },
        "ชุมตาบง": {
            "PostCode": 60150,
            "Tambons": [
                "ปางสวรรค์",
                "ชุมตาบง"
            ]
        },
        "ท่าตะโก": {
            "PostCode": 60160,
            "Tambons": [
                "วังใหญ่",
                "ทำนบ",
                "หนองหลวง",
                "วังมหากร",
                "สายลำโพง",
                "หัวถนน",
                "พนมเศษ",
                "พนมรอก",
                "ดอนคา",
                "ท่าตะโก"
            ]
        },
        "โกรกพระ": {
            "PostCode": 60170,
            "Tambons": [
                "เนินศาลา",
                "หาดสูง",
                "เนินกว้าว",
                "ศาลาแดง",
                "นากลาง",
                "บางประมุง",
                "บางมะฝ่อ",
                "ยางตาล",
                "โกรกพระ"
            ]
        },
        "บรรพตพิสัย": {
            "PostCode": 60180,
            "Tambons": [
                "ด่านช้าง",
                "ตาสัง",
                "บางแก้ว",
                "บ้านแดน",
                "หนองกรด",
                "อ่างทอง",
                "หนองตางู",
                "บึงปลาทู",
                "ตาขีด",
                "ท่างิ้ว",
                "หูกวาง",
                "เจริญผล",
                "บางตาหงาย"
            ]
        },
        "ตากฟ้า": {
            "PostCode": 60190,
            "Tambons": [
                "ตากฟ้า",
                "ลำพยนต์",
                "สุขสำราญ",
                "หนองพิกุล",
                "พุนกยูง",
                "อุดมธัญญา",
                "เขาชายธง"
            ]
        },
        "ไพศาลี": {
            "PostCode": 60220,
            "Tambons": [
                "นาขอม",
                "วังข่อย",
                "โพธิ์ประสาท",
                "ตะคร้อ",
                "วังน้ำลัด",
                "สำโรงชัย",
                "โคกเดื่อ",
                "ไพศาลี"
            ]
        },
        "เก้าเลี้ยว": {
            "PostCode": 60230,
            "Tambons": [
                "มหาโพธิ",
                "เขาดิน",
                "หนองเต่า",
                "เก้าเลี้ยว",
                "หัวดง"
            ]
        }
    },
    "อุทัยธานี": {
        "เมืองอุทัยธานี": {
            "PostCode": 61000,
            "Tambons": [
                "เนินแจง",
                "หนองพังค่า",
                "หนองไผ่แบน",
                "หนองเต่า",
                "โนนเหล็ก",
                "หนองแก",
                "ทุ่งใหญ่",
                "เกาะเทโพ",
                "อุทัยใหม่",
                "น้ำซึม",
                "ท่าซุง",
                "ดอนขวาง",
                "หาดทนง",
                "สะแกกรัง"
            ]
        },
        "หนองฉาง": {
            "PostCode": 61110,
            "Tambons": [
                "เขากวางทอง",
                "ทุ่งโพ",
                "บ้านเก่า",
                "หนองสรวง",
                "หนองนางนวล",
                "หนองยาง",
                "หนองฉาง",
                "ทุ่งพง",
                "อุทัยเก่า",
                "เขาบางแกรก"
            ]
        },
        "ทัพทัน": {
            "PostCode": 61120,
            "Tambons": [
                "หนองกระทุ่ม",
                "ทัพทัน",
                "ทุ่งนาไทย",
                "เขาขี้ฝอย",
                "หนองหญ้าปล้อง",
                "โคกหม้อ",
                "หนองยายดา",
                "หนองสระ",
                "หนองกลางดง",
                "ตลุกดู่"
            ]
        },
        "หนองขาหย่าง": {
            "PostCode": 61130,
            "Tambons": [
                "หลุมเข้า",
                "ดงขวาง",
                "หมกแถว",
                "ท่าโพ",
                "ทุ่งพึ่ง",
                "ห้วยรอบ",
                "หนองไผ่",
                "ดอนกลอย",
                "หนองขาหย่าง"
            ]
        },
        "บ้านไร่": {
            "PostCode": 61140,
            "Tambons": [
                "คอกควาย",
                "บ้านบึง",
                "เจ้าวัด",
                "แก่นมะกรูด",
                "ห้วยแห้ง",
                "ทัพหลวง",
                "บ้านไร่",
                "หูช้าง",
                "วังหิน",
                "เมืองการุ้ง",
                "หนองบ่มกล้วย",
                "บ้านใหม่คลองเคียน",
                "หนองจอก"
            ]
        },
        "สว่างอารมณ์": {
            "PostCode": 61150,
            "Tambons": [
                "บ่อยาง",
                "พลวงสองนาง",
                "หนองหลวง",
                "สว่างอารมณ์",
                "ไผ่เขียว"
            ]
        },
        "ลานสัก": {
            "PostCode": 61160,
            "Tambons": [
                "ทุ่งนางาม",
                "น้ำรอบ",
                "ระบำ",
                "ป่าอ้อ",
                "ประดู่ยืน",
                "ลานสัก"
            ]
        },
        "ห้วยคต": {
            "PostCode": 61170,
            "Tambons": [
                "สุขฤทัย",
                "ทองหลาง",
                "ห้วยคต"
            ]
        }
    },
    "กำแพงเพชร": {
        "โกสัมพีนคร": {
            "PostCode": 62000,
            "Tambons": [
                "ลานดอกไม้ตก",
                "เพชรชมภู",
                "โกสัมพี"
            ]
        },
        "เมืองกำแพงเพชร": {
            "PostCode": 62000,
            "Tambons": [
                "คณฑี",
                "คลองแม่ลาย",
                "ทรงธรรม",
                "ท่าขุนราม",
                "เทพนคร",
                "นครชุม",
                "นาบ่อคำ",
                "นิคมทุ่งโพธิ์ทะเล",
                "ในเมือง",
                "ลานดอกไม้",
                "วังทอง",
                "สระแก้ว",
                "หนองปลิง",
                "อ่างทอง",
                "ธำมรงค์",
                "ไตรตรึงษ์"
            ]
        },
        "พรานกระต่าย": {
            "PostCode": 62110,
            "Tambons": [
                "คุยบ้านโอง",
                "ถ้ำกระต่ายทอง",
                "ท่าไม้",
                "เขาคีริส",
                "วังควง",
                "วังตะแบก",
                "หนองหัววัว",
                "ห้วยยั้ง",
                "คลองพิไกร",
                "พรานกระต่าย"
            ]
        },
        "ปางศิลาทอง": {
            "PostCode": 62120,
            "Tambons": [
                "ปางตาไว",
                "โพธิ์ทอง",
                "หินดาต"
            ]
        },
        "คลองขลุง": {
            "PostCode": 62120,
            "Tambons": [
                "คลองขลุง",
                "คลองสมบูรณ์",
                "ท่าพุทรา",
                "ท่ามะเขือ",
                "แม่ลาด",
                "วังแขม",
                "วังไทร",
                "วังบัว",
                "หัวถนน",
                "วังยาง"
            ]
        },
        "ขาณุวรลักษบุรี": {
            "PostCode": 62130,
            "Tambons": [
                "ยางสูง",
                "แสนตอ",
                "ป่าพุทรา",
                "เกาะตาล",
                "วังชะพลู",
                "วังหามแห",
                "สลกบาตร",
                "ปางมะค่า",
                "โค้งไผ่",
                "ดอนแตง",
                "บ่อถ้ำ"
            ]
        },
        "ไทรงาม": {
            "PostCode": 62150,
            "Tambons": [
                "หนองทอง",
                "หนองคล้า",
                "มหาชัย",
                "พานทอง",
                "ไทรงาม",
                "หนองแม่แตง",
                "หนองไม้กอง"
            ]
        },
        "ลานกระบือ": {
            "PostCode": 62170,
            "Tambons": [
                "ประชาสุขสันต์",
                "บึงทับแรต",
                "ช่องลม",
                "ลานกระบือ",
                "โนนพลวง",
                "จันทิมา",
                "หนองหลวง"
            ]
        },
        "คลองลาน": {
            "PostCode": 62180,
            "Tambons": [
                "คลองน้ำไหล",
                "โป่งน้ำร้อน",
                "สักงาม",
                "คลองลานพัฒนา"
            ]
        },
        "ทรายทองวัฒนา": {
            "PostCode": 62190,
            "Tambons": [
                "ทุ่งทอง",
                "ทุ่งทราย",
                "ถาวรวัฒนา"
            ]
        },
        "บึงสามัคคี": {
            "PostCode": 62210,
            "Tambons": [
                "บึงสามัคคี",
                "เทพนิมิต",
                "วังชะโอน",
                "ระหาน"
            ]
        }
    },
    "ตาก": {
        "เมืองตาก": {
            "PostCode": 63000,
            "Tambons": [
                "วังหิน",
                "วังประจบ",
                "ระแหง",
                "ไม้งาม",
                "น้ำรึม",
                "ป่ามะม่วง",
                "ตลุกกลางทุ่ง",
                "เชียงเงิน",
                "หนองบัวใต้",
                "แม่ท้อ",
                "หนองบัวเหนือ",
                "โป่งแดง",
                "หนองหลวง",
                "หัวเดียด"
            ]
        },
        "แม่สอด": {
            "PostCode": 63110,
            "Tambons": [
                "มหาวัน",
                "พะวอ",
                "พระธาตุผาแดง",
                "แม่กาษา",
                "ท่าสายลวด",
                "ด่านแม่ละเมา",
                "แม่กุ",
                "แม่สอด",
                "แม่ตาว",
                "แม่ปะ"
            ]
        },
        "บ้านตาก": {
            "PostCode": 63120,
            "Tambons": [
                "เกาะตะเภา",
                "ตากตก",
                "ตากออก",
                "ท้องฟ้า",
                "ทุ่งกระเชาะ",
                "แม่สลิด",
                "สมอโคน"
            ]
        },
        "สามเงา": {
            "PostCode": 63130,
            "Tambons": [
                "บ้านนา",
                "วังหมัน",
                "วังจันทร์",
                "สามเงา",
                "ยกกระบัตร",
                "ย่านรี"
            ]
        },
        "แม่ระมาด": {
            "PostCode": 63140,
            "Tambons": [
                "แม่จะเรา",
                "ขะเนจื้อ",
                "พระธาตุ",
                "สามหมื่น",
                "แม่ระมาด",
                "แม่ตื่น"
            ]
        },
        "ท่าสองยาง": {
            "PostCode": 63150,
            "Tambons": [
                "ท่าสองยาง",
                "แม่สอง",
                "แม่วะหลวง",
                "แม่ต้าน",
                "แม่หละ",
                "แม่อุสุ"
            ]
        },
        "พบพระ": {
            "PostCode": 63160,
            "Tambons": [
                "คีรีราษฎร์",
                "ช่องแคบ",
                "พบพระ",
                "รวมไทยพัฒนา",
                "วาเล่ย์"
            ]
        },
        "อุ้มผาง": {
            "PostCode": 63170,
            "Tambons": [
                "อุ้มผาง",
                "หนองหลวง",
                "โมโกร",
                "แม่กลอง",
                "แม่ละมุ้ง",
                "แม่จัน"
            ]
        },
        "วังเจ้า": {
            "PostCode": 63180,
            "Tambons": [
                "นาโบสถ์",
                "เชียงทอง",
                "ประดาง"
            ]
        }
    },
    "สุโขทัย": {
        "เมืองสุโขทัย": {
            "PostCode": 64000,
            "Tambons": [
                "ธานี",
                "ปากแคว",
                "ยางซ้าย",
                "บ้านหลุม",
                "ปากพระ",
                "บ้านกล้วย",
                "วังทองแดง",
                "เมืองเก่า",
                "บ้านกล้วย",
                "บ้านสวน",
                "ตาลเตี้ย"
            ]
        },
        "สวรรคโลก": {
            "PostCode": 64110,
            "Tambons": [
                "ในเมือง",
                "เมืองบางยม",
                "คลองยาง",
                "นาทุ่ง",
                "วังพิณพาทย์",
                "ท่าทอง",
                "คลองกระจง",
                "เมืองสวรรคโลก",
                "ย่านยาว",
                "ปากน้ำ",
                "วังไม้ขอน",
                "เมืองบางขลัง",
                "หนองกลับ",
                "ป่ากุมเกาะ"
            ]
        },
        "ศรีสำโรง": {
            "PostCode": 64120,
            "Tambons": [
                "ทับผึ้ง",
                "บ้านนา",
                "สามเรือน",
                "วังลึก",
                "คลองตาล",
                "บ้านซ่าน",
                "วังใหญ่",
                "ราวต้นจันทร์",
                "นาขุนไกร",
                "วัดเกาะ",
                "บ้านไร่",
                "วังทอง",
                "เกาะตาเลี้ยง"
            ]
        },
        "ศรีสัชนาลัย": {
            "PostCode": 64130,
            "Tambons": [
                "ป่างิ้ว",
                "หาดเสี้ยว",
                "แม่สำ",
                "แม่สิน",
                "บ้านตึก",
                "หนองอ้อ",
                "ดงคู่",
                "บ้านแก่ง",
                "สารจิตร",
                "ศรีสัชนาลัย",
                "ท่าชัย"
            ]
        },
        "บ้านด่านลานหอย": {
            "PostCode": 64140,
            "Tambons": [
                "บ้านด่าน",
                "ลานหอย",
                "วังลึก",
                "วังตะคร้อ",
                "วังน้ำขาว",
                "หนองหญ้าปล้อง",
                "ตลิ่งชัน"
            ]
        },
        "ทุ่งเสลี่ยม": {
            "PostCode": 64150,
            "Tambons": [
                "ไทยชนะศึก",
                "กลางดง",
                "ทุ่งเสลี่ยม",
                "เขาแก้วศรีสมบูรณ์",
                "บ้านใหม่ไชยมงคล"
            ]
        },
        "คีรีมาศ": {
            "PostCode": 64160,
            "Tambons": [
                "โตนด",
                "สามพวง",
                "บ้านป้อม",
                "ศรีคีรีมาศ",
                "ทุ่งยางเมือง",
                "บ้านน้ำพุ",
                "นาเชิงคีรี",
                "หนองจิก",
                "หนองกระดิ่ง",
                "ทุ่งหลวง"
            ]
        },
        "กงไกรลาศ": {
            "PostCode": 64170,
            "Tambons": [
                "บ้านใหม่สุขเกษม",
                "หนองตูม",
                "กกแรต",
                "ป่าแฝก",
                "ดงเดือย",
                "ไกรใน",
                "ไกรกลาง",
                "ไกรนอก",
                "บ้านกร่าง",
                "กง",
                "ท่าฉนวน"
            ]
        },
        "ศรีนคร": {
            "PostCode": 64180,
            "Tambons": [
                "ศรีนคร",
                "นครเดิฐ",
                "คลองมะพลับ",
                "หนองบัว",
                "น้ำขุม"
            ]
        }
    },
    "พิษณุโลก": {
        "เมืองพิษณุโลก": {
            "PostCode": 65000,
            "Tambons": [
                "วัดจันทร์",
                "ท่าโพธิ์",
                "สมอแข",
                "ดอนทอง",
                "บ้านป่า",
                "ปากโทก",
                "หัวรอ",
                "จอมทอง",
                "พลายชุมพล",
                "บ้านคลอง",
                "ในเมือง",
                "มะขามสูง",
                "ท่าทอง",
                "บึงพระ",
                "ไผ่ขอดอน",
                "บ้านกร่าง",
                "อรัญญิก",
                "วังน้ำคู้",
                "วัดพริก",
                "งิ้วงาม"
            ]
        },
        "บางกระทุ่ม": {
            "PostCode": 65110,
            "Tambons": [
                "สนามคลี",
                "นครป่าหมาก",
                "บางกระทุ่ม",
                "บ้านไร่",
                "โคกสลุด",
                "ไผ่ล้อม",
                "ท่าตาล",
                "เนินกุ่ม",
                "วัดตายม"
            ]
        },
        "นครไทย": {
            "PostCode": 65120,
            "Tambons": [
                "นครไทย",
                "บ้านแยง",
                "เนินเพิ่ม",
                "นาบัว",
                "นครชุม",
                "น้ำกุ่ม",
                "ยางโกลน",
                "บ่อโพธิ์",
                "บ้านพร้าว",
                "ห้วยเฮี้ย",
                "หนองกะท้าว"
            ]
        },
        "วังทอง": {
            "PostCode": 65130,
            "Tambons": [
                "วังทอง",
                "พันชาลี",
                "แม่ระกา",
                "วังพิกุล",
                "ชัยนาม",
                "วังนกแอ่น",
                "หนองพระ",
                "ดินทอง",
                "ท่าหมื่นราม",
                "แก่งโสภา",
                "บ้านกลาง"
            ]
        },
        "บางระกำ": {
            "PostCode": 65140,
            "Tambons": [
                "ท่านางงาม",
                "บ่อทอง",
                "วังอิทก",
                "หนองกุลา",
                "บางระกำ",
                "ปลักแรด",
                "พันเสา",
                "นิคมพัฒนา",
                "บึงกอก",
                "ชุมแสงสงคราม",
                "คุยม่วง"
            ]
        },
        "พรหมพิราม": {
            "PostCode": 65150,
            "Tambons": [
                "พรหมพิราม",
                "ท่าช้าง",
                "มะตูม",
                "หอกลอง",
                "วังวน",
                "หนองแขม",
                "ทับยายเชียง",
                "วงฆ้อง",
                "ศรีภิรมย์",
                "มะต้อง",
                "ดงประคำ",
                "ตลุกเทียม"
            ]
        },
        "วัดโบสถ์": {
            "PostCode": 65160,
            "Tambons": [
                "หินลาด",
                "บ้านยาง",
                "ท้อแท้",
                "คันโช้ง",
                "วัดโบสถ์",
                "ท่างาม"
            ]
        },
        "ชาติตระการ": {
            "PostCode": 65170,
            "Tambons": [
                "ป่าแดง",
                "ชาติตระการ",
                "สวนเมี่ยง",
                "บ่อภาค",
                "ท่าสะแก",
                "บ้านดง"
            ]
        },
        "เนินมะปราง": {
            "PostCode": 65190,
            "Tambons": [
                "ชมพู",
                "บ้านมุง",
                "ไทรย้อย",
                "วังโพรง",
                "บ้านน้อยซุ้มขี้เหล็ก",
                "เนินมะปราง",
                "วังยาง"
            ]
        }
    },
    "พิจิตร": {
        "เมืองพิจิตร": {
            "PostCode": 66000,
            "Tambons": [
                "ป่ามะคาบ",
                "สายคำโห้",
                "บ้านบุ่ง",
                "เมืองเก่า",
                "โรงช้าง",
                "คลองคะเชนทร์",
                "ท่าหลวง",
                "ท่าฬ่อ",
                "ย่านยาว",
                "ไผ่ขวาง",
                "ในเมือง",
                "ปากทาง",
                "ฆะมัง",
                "หัวดง",
                "ดงป่าคำ",
                "ดงกลาง",
                "ฆะมัง"
            ]
        },
        "ตะพานหิน": {
            "PostCode": 66110,
            "Tambons": [
                "วังหว้า",
                "ดงตะขบ",
                "หนองพยอม",
                "ไทรโรงโขน",
                "ห้วยเกตุ",
                "ตะพานหิน",
                "ทับหมัน",
                "ไผ่หลวง",
                "คลองคูณ",
                "งิ้วราย",
                "วังสำโรง",
                "วังหลุม",
                "ทุ่งโพธิ์"
            ]
        },
        "บางมูลนาก": {
            "PostCode": 66120,
            "Tambons": [
                "บางไผ่",
                "ลำประดา",
                "วังกรด",
                "เนินมะกอก",
                "วังสำโรง",
                "ภูมิ",
                "หอไกร",
                "ห้วยเขน",
                "บางมูลนาก",
                "วังตะกู"
            ]
        },
        "โพทะเล": {
            "PostCode": 66130,
            "Tambons": [
                "ทุ่งน้อย",
                "โพทะเล",
                "ท้ายน้ำ",
                "ทะนง",
                "ท่าบัว",
                "ท่าเสา",
                "บางคลาน",
                "ท่านั่ง",
                "บ้านน้อย",
                "วัดขวาง",
                "ท่าขมิ้น"
            ]
        },
        "บึงนาราง": {
            "PostCode": 66130,
            "Tambons": [
                "แหลมรัง",
                "โพธิ์ไทรงาม",
                "ห้วยแก้ว",
                "บางลาย",
                "บึงนาราง"
            ]
        },
        "สามง่าม": {
            "PostCode": 66140,
            "Tambons": [
                "สามง่าม",
                "หนองโสน",
                "เนินปอ",
                "รังนก",
                "กำแพงดิน"
            ]
        },
        "วชิรบารมี": {
            "PostCode": 66140,
            "Tambons": [
                "บ้านนา",
                "บึงบัว",
                "วังโมกข์",
                "หนองหลุม"
            ]
        },
        "ทับคล้อ": {
            "PostCode": 66150,
            "Tambons": [
                "ทับคล้อ",
                "ท้ายทุ่ง",
                "เขาเจ็ดลูก",
                "เขาทราย"
            ]
        },
        "สากเหล็ก": {
            "PostCode": 66160,
            "Tambons": [
                "สากเหล็ก",
                "ท่าเยี่ยม",
                "วังทับไทร",
                "คลองทราย",
                "หนองหญ้าไทร"
            ]
        },
        "วังทรายพูน": {
            "PostCode": 66180,
            "Tambons": [
                "หนองปลาไหล",
                "หนองพระ",
                "หนองปล้อง",
                "วังทรายพูน"
            ]
        },
        "โพธิ์ประทับช้าง": {
            "PostCode": 66190,
            "Tambons": [
                "ดงเสือเหลือง",
                "ไผ่รอบ",
                "วังจิก",
                "ทุ่งใหญ่",
                "โพธิ์ประทับช้าง",
                "เนินสว่าง",
                "ไผ่ท่าโพ"
            ]
        },
        "ดงเจริญ": {
            "PostCode": 66210,
            "Tambons": [
                "ห้วยพุก",
                "วังงิ้วใต้",
                "สำนักขุนเณร",
                "วังงิ้ว",
                "ห้วยร่วม"
            ]
        }
    },
    "เพชรบูรณ์": {
        "เมืองเพชรบูรณ์": {
            "PostCode": 67000,
            "Tambons": [
                "บ้านโคก",
                "บ้านโตก",
                "สะเดียง",
                "ป่าเลา",
                "นางั่ว",
                "ในเมือง",
                "ตะเบาะ",
                "ดงมูลเหล็ก",
                "ชอนไพร",
                "ห้วยใหญ่",
                "น้ำร้อน",
                "นาป่า",
                "วังชมภู",
                "ระวิง",
                "นายม",
                "ห้วยสะแก",
                "ท่าพล"
            ]
        },
        "หล่มสัก": {
            "PostCode": 67110,
            "Tambons": [
                "หนองไขว่",
                "น้ำชุน",
                "บ้านไร่",
                "น้ำก้อ",
                "ห้วยไร่",
                "บ้านติ้ว",
                "บ้านโสก",
                "สักหลง",
                "น้ำเฮี้ย",
                "หนองสว่าง",
                "ฝายนาแซง",
                "ตาลเดี่ยว",
                "วัดป่า",
                "หล่มสัก",
                "ท่าอิบุญ",
                "ช้างตะลูด",
                "ปากช่อง",
                "ลานบ่า",
                "ปากดุก",
                "บ้านกลาง",
                "บ้านหวาย",
                "บุ่งน้ำเต้า",
                "บุ่งคล้า"
            ]
        },
        "หล่มเก่า": {
            "PostCode": 67120,
            "Tambons": [
                "นาแซง",
                "นาซำ",
                "วังบาล",
                "หล่มเก่า",
                "ศิลา",
                "ตาดกลอย",
                "นาเกาะ",
                "บ้านเนิน",
                "หินฮาว"
            ]
        },
        "วิเชียรบุรี": {
            "PostCode": 67130,
            "Tambons": [
                "บึงกระจับ",
                "โคกปรง",
                "น้ำร้อน",
                "บ่อรัง",
                "สามแยก",
                "ท่าโรง",
                "ยางสาว",
                "สระประดู่",
                "ภูน้ำหยด",
                "พุเตย",
                "ซับน้อย",
                "พุขาม",
                "วังใหญ่",
                "ซับสมบูรณ์"
            ]
        },
        "หนองไผ่": {
            "PostCode": 67140,
            "Tambons": [
                "บ่อไทย",
                "หนองไผ่",
                "วังโบสถ์",
                "กองทูล",
                "ท่าแดง",
                "ท่าด้วง",
                "บ้านโภชน์",
                "วังท่าดี",
                "บัววัฒนา",
                "เพชรละคร",
                "นาเฉลียง",
                "ห้วยโป่ง",
                "ยางงาม"
            ]
        },
        "ชนแดน": {
            "PostCode": 67150,
            "Tambons": [
                "ซับพุทรา",
                "ศาลาลาย",
                "ชนแดน",
                "ลาดแค",
                "พุทธบาท",
                "ท่าข้าม",
                "ดงขุย",
                "ตะกุดไร",
                "บ้านกล้วย"
            ]
        },
        "บึงสามพัน": {
            "PostCode": 67160,
            "Tambons": [
                "ศรีมงคล",
                "ซับไม้แดง",
                "กันจุ",
                "สระแก้ว",
                "บึงสามพัน",
                "ซับสมอทอด",
                "หนองแจง",
                "พญาวัง",
                "วังพิกุล"
            ]
        },
        "ศรีเทพ": {
            "PostCode": 67170,
            "Tambons": [
                "นาสนุ่น",
                "โคกสะอาด",
                "คลองกระจัง",
                "ประดู่งาม",
                "หนองย่างทอย",
                "สระกรวด",
                "ศรีเทพ"
            ]
        },
        "วังโป่ง": {
            "PostCode": 67240,
            "Tambons": [
                "ท้ายดง",
                "ซับเปิบ",
                "วังหิน",
                "วังโป่ง",
                "วังศาล"
            ]
        },
        "น้ำหนาว": {
            "PostCode": 67260,
            "Tambons": [
                "โคกมน",
                "น้ำหนาว",
                "หลักด่าน",
                "วังกวาง"
            ]
        },
        "เขาค้อ": {
            "PostCode": 67270,
            "Tambons": [
                "หนองแม่นา",
                "สะเดาะพง",
                "ริมสีม่วง",
                "เขาค้อ",
                "ทุ่งสมอ",
                "เข็กน้อย",
                "แคมป์สน"
            ]
        }
    },
    "ราชบุรี": {
        "เมืองราชบุรี": {
            "PostCode": 70000,
            "Tambons": [
                "พิกุลทอง",
                "ท่าราบ",
                "เกาะพลับพลา",
                "บ้านไร่",
                "หลุมดิน",
                "บางป่า",
                "พงสวาย",
                "หินกอง",
                "น้ำพุ",
                "ดอนแร่",
                "เขาแร้ง",
                "คูบัว",
                "สามเรือน",
                "หนองกลางนา",
                "ดอนตะโก",
                "โคกหม้อ",
                "เจดีย์หัก",
                "หน้าเมือง",
                "ห้วยไผ่",
                "คุ้งน้ำวน",
                "อ่างทอง",
                "คุ้งกระถิน"
            ]
        },
        "บ้านโป่ง": {
            "PostCode": 70110,
            "Tambons": [
                "ท่าผา",
                "ลาดบัวขาว",
                "เบิกไพร",
                "เขาขลุง",
                "นครชุมน์",
                "ปากแรต",
                "หนองกบ",
                "หนองอ้อ",
                "หนองปลาหมอ",
                "บ้านโป่ง",
                "คุ้งพยอม",
                "บ้านม่วง",
                "ดอนกระเบื้อง",
                "สวนกล้วย",
                "กรับใหญ่"
            ]
        },
        "โพธาราม": {
            "PostCode": 70120,
            "Tambons": [
                "คลองตาคต",
                "บ้านฆ้อง",
                "หนองโพ",
                "บ้านเลือก",
                "นางแก้ว",
                "ดอนทราย",
                "เจ็ดเสมียน",
                "คลองข่อย",
                "ชำแระ",
                "สร้อยฟ้า",
                "ท่าชุมพล",
                "บางโตนด",
                "เตาปูน",
                "โพธาราม",
                "ธรรมเสน",
                "เขาชะงุ้ม",
                "หนองกวาง",
                "บ้านสิงห์",
                "ดอนกระเบื้อง"
            ]
        },
        "ดำเนินสะดวก": {
            "PostCode": 70130,
            "Tambons": [
                "ดอนไผ่",
                "ดอนคลัง",
                "ขุนพิทักษ์",
                "ท่านัด",
                "สี่หมื่น",
                "แพงพวย",
                "บ้านไร่",
                "ศรีสุราษฎร์",
                "ดำเนินสะดวก",
                "ดอนกรวย",
                "ตาหลวง",
                "บัวงาม",
                "ประสาทสิทธิ์"
            ]
        },
        "ปากท่อ": {
            "PostCode": 70140,
            "Tambons": [
                "ทุ่งหลวง",
                "ห้วยยางโทน",
                "ป่าไก่",
                "ปากท่อ",
                "ยางหัก",
                "บ่อกระดาน",
                "วันดาว",
                "วังมะนาว",
                "หนองกระทุ่ม",
                "อ่างหิน",
                "ดอนทราย",
                "วัดยางงาม"
            ]
        },
        "จอมบึง": {
            "PostCode": 70150,
            "Tambons": [
                "รางบัว",
                "แก้มอ้น",
                "ด่านทับตะโก",
                "เบิกไพร",
                "ปากช่อง",
                "จอมบึง"
            ]
        },
        "บางแพ": {
            "PostCode": 70160,
            "Tambons": [
                "โพหัก",
                "ดอนคา",
                "วังเย็น",
                "ดอนใหญ่",
                "วัดแก้ว",
                "หัวโพ",
                "บางแพ"
            ]
        },
        "วัดเพลง": {
            "PostCode": 70170,
            "Tambons": [
                "เกาะศาลพระ",
                "จอมประทัด",
                "วัดเพลง"
            ]
        },
        "บ้านคา": {
            "PostCode": 70180,
            "Tambons": [
                "หนองพันจันทร์",
                "บ้านบึง",
                "บ้านคา"
            ]
        },
        "สวนผึ้ง": {
            "PostCode": 70180,
            "Tambons": [
                "ท่าเคย",
                "สวนผึ้ง",
                "ป่าหวาย",
                "ตะนาวศรี"
            ]
        }
    },
    "กาญจนบุรี": {
        "ท่ามะกา": {
            "PostCode": 70190,
            "Tambons": [
                "สนามแย้",
                "ท่ามะกา",
                "ท่าไม้",
                "โคกตะบอง",
                "พงตึก",
                "ยางม่วง",
                "หวายเหนียว",
                "เขาสามสิบหาบ",
                "ท่าเสา",
                "ดอนขมิ้น",
                "ดอนชะเอม",
                "ตะคร้ำเอน",
                "ท่าเรือ",
                "พระแท่น",
                "แสนตอ",
                "หนองลาน",
                "อุโลกสี่หมื่น"
            ]
        },
        "เมืองกาญจนบุรี": {
            "PostCode": 71000,
            "Tambons": [
                "หนองหญ้า",
                "วังเย็น",
                "บ้านเหนือ",
                "บ้านใต้",
                "บ้านเก่า",
                "ท่ามะขาม",
                "แก่งเสี้ยน",
                "เกาะสำโรง",
                "ปากแพรก",
                "วังด้ง",
                "ช่องสะเดา",
                "ลาดหญ้า",
                "หนองบัว"
            ]
        },
        "ท่าม่วง": {
            "PostCode": 71000,
            "Tambons": [
                "ท่าล้อ",
                "หนองขาว",
                "ม่วงชุม",
                "ทุ่งทอง",
                "บ้านใหม่",
                "รางสาลี่",
                "ท่าม่วง",
                "เขาน้อย",
                "หนองตากยา",
                "วังขนาย",
                "พังตรุ",
                "ท่าล้อ",
                "วังศาลา",
                "ท่าตะคร้อ",
                "วังศาลา"
            ]
        },
        "พนมทวน": {
            "PostCode": 71140,
            "Tambons": [
                "ทุ่งสมอ",
                "ดอนเจดีย์",
                "พนมทวน",
                "พังตรุ",
                "หนองโรง",
                "หนองสาหร่าย",
                "ดอนตาเพชร",
                "รางหวาย"
            ]
        },
        "ไทรโยค": {
            "PostCode": 71150,
            "Tambons": [
                "สิงห์",
                "วังกระแจะ",
                "ลุ่มสุ่ม",
                "ท่าเสา",
                "ศรีมงคล",
                "ไทรโยค",
                "บ้องตี้"
            ]
        },
        "บ่อพลอย": {
            "PostCode": 71160,
            "Tambons": [
                "ช่องด่าน",
                "บ่อพลอย",
                "หนองกุ่ม",
                "หลุมรัง",
                "หนองรี",
                "หนองกร่าง"
            ]
        },
        "ห้วยกระเจา": {
            "PostCode": 71170,
            "Tambons": [
                "วังไผ่",
                "สระลงเรือ",
                "ดอนแสลบ",
                "ห้วยกระเจา"
            ]
        },
        "ทองผาภูมิ": {
            "PostCode": 71180,
            "Tambons": [
                "สหกรณ์นิคม",
                "ท่าขนุน",
                "หินดาด",
                "ห้วยเขย่ง",
                "ลิ่นถิ่น",
                "ปิล๊อก",
                "ชะแล"
            ]
        },
        "เลาขวัญ": {
            "PostCode": 71210,
            "Tambons": [
                "หนองนกแก้ว",
                "หนองประดู่",
                "เลาขวัญ",
                "หนองโสน",
                "หนองปลิง",
                "ทุ่งกระบ่ำ",
                "หนองฝ้าย"
            ]
        },
        "หนองปรือ": {
            "PostCode": 71220,
            "Tambons": [
                "สมเด็จเจริญ",
                "หนองปรือ",
                "หนองปลาไหล"
            ]
        },
        "ศรีสวัสดิ์": {
            "PostCode": 71220,
            "Tambons": [
                "เขาโจด",
                "ด่านแม่แฉลบ",
                "ท่ากระดาน",
                "นาสวน",
                "แม่กระบุง",
                "หนองเป็ด"
            ]
        },
        "สังขละบุรี": {
            "PostCode": 71240,
            "Tambons": [
                "ปรังเผล",
                "ไล่โว่",
                "หนองลู"
            ]
        },
        "ด่านมะขามเตี้ย": {
            "PostCode": 71260,
            "Tambons": [
                "จรเข้เผือก",
                "ด่านมะขามเตี้ย",
                "หนองไผ่",
                "กลอนโด"
            ]
        }
    },
    "สมุทรสาคร": {
        "บ้านแพ้ว": {
            "PostCode": 70210,
            "Tambons": [
                "หนองสองห้อง",
                "โรงเข้",
                "สวนส้ม",
                "หลักสอง",
                "อำแพง",
                "คลองตัน",
                "เกษตรพัฒนา",
                "เจ็ดริ้ว",
                "หนองบัว",
                "ยกกระบัตร",
                "หลักสาม",
                "บ้านแพ้ว",
                "หนองสองห้อง",
                "โรงเข้"
            ]
        },
        "เมืองสมุทรสาคร": {
            "PostCode": 74000,
            "Tambons": [
                "บ้านบ่อ",
                "บางโทรัด",
                "บางกระเจ้า",
                "ชัยมงคล",
                "บางหญ้าแพรก",
                "บ้านเกาะ",
                "โคกขาม",
                "พันท้ายนรสิงห์",
                "บางน้ำจืด",
                "ท่าทราย",
                "คอกกระบือ",
                "ท่าจีน",
                "นาโคก",
                "กาหลง",
                "มหาชัย",
                "ท่าฉลอม",
                "โกรกกราก",
                "นาดี"
            ]
        },
        "กระทุ่มแบน": {
            "PostCode": 74110,
            "Tambons": [
                "คลองมะเดื่อ",
                "ดอนไก่ดี",
                "ท่าเสา",
                "หนองนกไข่",
                "บางยาง",
                "แคราย",
                "ท่าไม้",
                "ตลาดกระทุ่มแบน",
                "สวนหลวง",
                "อ้อมน้อย"
            ]
        }
    },
    "สุพรรณบุรี": {
        "สองพี่น้อง": {
            "PostCode": 71170,
            "Tambons": [
                "หนองบ่อ",
                "ต้นตาล",
                "สองพี่น้อง",
                "บางพลับ",
                "บางเลน",
                "เนินพระปรางค์",
                "หัวโพธิ์",
                "บางตะเคียน",
                "บ้านกุ่ม",
                "ดอนมะนาว",
                "บางตาเถร",
                "บ้านช้าง",
                "ศรีสำราญ",
                "ทุ่งคอก",
                "บ่อสุพรรณ",
                "หนองบ่อ",
                "ทุ่งคอก",
                "ศรีสำราญ"
            ]
        },
        "อู่ทอง": {
            "PostCode": 71170,
            "Tambons": [
                "จรเข้สามพัน",
                "อู่ทอง",
                "ยุ้งทะลาย",
                "บ้านดอน",
                "หนองโอ่ง",
                "ดอนคา",
                "พลับพลาไชย",
                "บ้านโข้ง",
                "เจดีย์",
                "กระจัน",
                "จรเข้สามพัน",
                "สระพังลาน",
                "สระยายโสม",
                "ดอนมะเกลือ"
            ]
        },
        "เมืองสุพรรณบุรี": {
            "PostCode": 72000,
            "Tambons": [
                "ไผ่ขวาง",
                "โพธิ์พระยา",
                "รั้วใหญ่",
                "สนามชัย",
                "โคกโคเฒ่า",
                "ทับตีเหล็ก",
                "บ้านโพธิ์",
                "ดอนโพธิ์ทอง",
                "ท่าระหัด",
                "ดอนกำยาน",
                "ท่าพี่เลี้ยง",
                "พิหารแดง",
                "ดอนมะสังข์",
                "ดอนตาล",
                "ศาลาขาว",
                "สวนแตง",
                "บางกุ้ง",
                "สนามคลี",
                "สระแก้ว",
                "ตลิ่งชัน"
            ]
        },
        "เดิมบางนางบวช": {
            "PostCode": 72120,
            "Tambons": [
                "ป่าสะแก",
                "วังศรีราช",
                "ยางนอน",
                "หนองกระทุ่ม",
                "บ่อกรุ",
                "หัวนา",
                "หัวเขา",
                "โคกช้าง",
                "ทุ่งคลี",
                "ปากน้ำ",
                "เขาดิน",
                "เดิมบาง",
                "เขาพระ",
                "นางบวช"
            ]
        },
        "สามชุก": {
            "PostCode": 72130,
            "Tambons": [
                "ย่านยาว",
                "วังลึก",
                "หนองผักนาก",
                "บ้านสระ",
                "หนองสะเดา",
                "กระเสียว",
                "สามชุก"
            ]
        },
        "ศรีประจันต์": {
            "PostCode": 72140,
            "Tambons": [
                "วังยาง",
                "ศรีประจันต์",
                "บ้านกร่าง",
                "มดแดง",
                "บางงาม",
                "ดอนปรู",
                "ปลายนา",
                "วังหว้า",
                "วังน้ำซับ"
            ]
        },
        "บางปลาม้า": {
            "PostCode": 72150,
            "Tambons": [
                "องครักษ์",
                "สาลี",
                "จรเข้ใหญ่",
                "กฤษณา",
                "บางใหญ่",
                "ตะค่า",
                "โคกคราม",
                "ไผ่กองดิน",
                "วัดดาว",
                "วัดโบสถ์",
                "วังน้ำเย็น",
                "มะขามล้ม",
                "บ้านแหลม",
                "บางปลาม้า"
            ]
        },
        "ดอนเจดีย์": {
            "PostCode": 72170,
            "Tambons": [
                "หนองสาหร่าย",
                "ไร่รถ",
                "ดอนเจดีย์",
                "ทะเลบก",
                "สระกระโจม",
                "ทะเลบก"
            ]
        },
        "ด่านช้าง": {
            "PostCode": 72180,
            "Tambons": [
                "องค์พระ",
                "วังยาว",
                "หนองมะค่าโมง",
                "ด่านช้าง",
                "วังคัน",
                "ห้วยขมิ้น",
                "นิคมกระเสียว"
            ]
        },
        "หนองหญ้าไซ": {
            "PostCode": 72240,
            "Tambons": [
                "แจงงาม",
                "หนองโพธิ์",
                "หนองราชวัตร",
                "หนองขาม",
                "หนองหญ้าไซ",
                "ทัพหลวง"
            ]
        }
    },
    "นครปฐม": {
        "เมืองนครปฐม": {
            "PostCode": 73000,
            "Tambons": [
                "บางแขม",
                "พระปฐมเจดีย์",
                "นครปฐม",
                "ทุ่งน้อย",
                "ทัพหลวง",
                "ถนนขาด",
                "ธรรมศาลา",
                "บ่อพลับ",
                "บ้านยาง",
                "สระกะเทียม",
                "โพรงมะเดื่อ",
                "พระประโทน",
                "หนองปากโลง",
                "หนองดินแดง",
                "หนองงูเหลือม",
                "สามควายเผือก",
                "สวนป่าน",
                "ห้วยจรเข้",
                "สนามจันทร์",
                "ดอนยายหอม",
                "มาบแค",
                "ตาก้อง",
                "วังตะกู",
                "วังเย็น",
                "ลำพยา"
            ]
        },
        "สามพราน": {
            "PostCode": 73110,
            "Tambons": [
                "คลองจินดา",
                "คลองใหม่",
                "ตลาดจินดา",
                "ท่าตลาด",
                "บางช้าง",
                "บ้านใหม่",
                "ยายชา",
                "สามพราน",
                "หอมเกร็ด",
                "ท่าข้าม",
                "อ้อมใหญ่",
                "ทรงคนอง",
                "บางกระทึก",
                "บางเตย",
                "ไร่ขิง",
                "กระทุ่มล้ม"
            ]
        },
        "นครชัยศรี": {
            "PostCode": 73120,
            "Tambons": [
                "บางแก้ว",
                "ศรีมหาโพธิ์",
                "วัดละมุด",
                "ขุนแก้ว",
                "โคกพระเจดีย์",
                "งิ้วราย",
                "ดอนแฝก",
                "วัดแค",
                "ท่ากระชับ",
                "ท่าตำหนัก",
                "ท่าพระยา",
                "ไทยาวาส",
                "ลานตากฟ้า",
                "นครชัยศรี",
                "บางกระเบา",
                "บางแก้วฟ้า",
                "บางพระ",
                "วัดสำโรง",
                "พะเนียด",
                "บางระกำ",
                "สัมปทวน",
                "ห้วยพลู",
                "แหลมบัว",
                "ศรีษะทอง"
            ]
        },
        "บางเลน": {
            "PostCode": 73130,
            "Tambons": [
                "ลำพญา",
                "ไผ่หูช้าง",
                "บางเลน",
                "บางระกำ",
                "บางภาษี",
                "บางปลา",
                "บัวปากท่า",
                "นิลเพชร",
                "นราภิรมย์",
                "ไทรงาม",
                "ดอนตูม",
                "คลองนกกระทุง",
                "บางไทรป่า",
                "หินมูล",
                "บางหลวง"
            ]
        },
        "กำแพงแสน": {
            "PostCode": 73140,
            "Tambons": [
                "รางพิกุล",
                "วังน้ำเขียว",
                "หนองกระทุ่ม",
                "ทุ่งลูกนก",
                "ทุ่งบัว",
                "ห้วยขวาง",
                "ห้วยหมอนทอง",
                "ทุ่งขวาง",
                "ทุ่งกระพังโหม",
                "ดอนข่อย",
                "กำแพงแสน",
                "สระสี่มุม",
                "กระตีบ",
                "ห้วยม่วง",
                "สระพัฒนา",
                "สระสี่มุม"
            ]
        },
        "ดอนตูม": {
            "PostCode": 73150,
            "Tambons": [
                "ลำลูกบัว",
                "บ้านหลวง",
                "ดอนพุทรา",
                "สามง่าม",
                "ห้วยด้วน",
                "ห้วยพระ",
                "ลำเหย",
                "ดอนรวก"
            ]
        },
        "พุทธมณฑล": {
            "PostCode": 73170,
            "Tambons": [
                "คลองโยง",
                "ศาลายา",
                "มหาสวัสดิ์"
            ]
        }
    },
    "สมุทรสงคราม": {
        "เมืองสมุทรสงคราม": {
            "PostCode": 75000,
            "Tambons": [
                "ลาดใหญ่",
                "แหลมใหญ่",
                "ท้ายหาด",
                "บางแก้ว",
                "บ้านปรก",
                "แม่กลอง",
                "คลองเขิน",
                "คลองโคน",
                "บางจะเกร็ง",
                "บางขันแตก",
                "นางตะเคียน"
            ]
        },
        "อัมพวา": {
            "PostCode": 75110,
            "Tambons": [
                "ท่าคา",
                "อัมพวา",
                "แพรกหนามแดง",
                "สวนหลวง",
                "วัดประดู่",
                "ยี่สาร",
                "บางช้าง",
                "แควอ้อม",
                "ปลายโพงพาง",
                "บางแค",
                "บางนางลี่",
                "เหมืองใหม่"
            ]
        },
        "บางคนที": {
            "PostCode": 75120,
            "Tambons": [
                "บางคนที",
                "กระดังงา",
                "บางสะแก",
                "บางยี่รงค์",
                "โรงหีบ",
                "ดอนมะโนรา",
                "จอมปลวก",
                "บางพรม",
                "บางกุ้ง",
                "บางนกแขวก",
                "ยายแพง",
                "บางกระบือ",
                "บ้านปราโมทย์"
            ]
        }
    },
    "เพชรบุรี": {
        "เมืองเพชรบุรี": {
            "PostCode": 76000,
            "Tambons": [
                "เวียงคอย",
                "บางจาก",
                "บ้านหม้อ",
                "ต้นมะม่วง",
                "ช่องสะแก",
                "นาวุ้ง",
                "หัวสะพาน",
                "โพพระ",
                "ไร่ส้ม",
                "หนองพลับ",
                "ดอนยาง",
                "โพไร่หวาน",
                "สำมะโรง",
                "หนองโสน",
                "บ้านกุ่ม",
                "ต้นมะพร้าว",
                "ธงชัย",
                "นาพันสาม",
                "บางจาน",
                "คลองกระแชง",
                "ท่าราบ",
                "วังตะโก",
                "หนองขนาน",
                "หาดเจ้าสำราญ",
                "หนองขนาน"
            ]
        },
        "บ้านแหลม": {
            "PostCode": 76100,
            "Tambons": [
                "แหลมผักเบี้ย",
                "บางตะบูนออก",
                "บางแก้ว",
                "บางขุนไทร",
                "ปากทะเล",
                "บางตะบูน",
                "บ้านแหลม",
                "ท่าแร้ง",
                "บางครก",
                "ท่าแร้งออก"
            ]
        },
        "ชะอำ": {
            "PostCode": 76120,
            "Tambons": [
                "หนองศาลา",
                "นายาง",
                "บางเก่า",
                "ดอนขุนห้วย",
                "สามพระยา",
                "ชะอำ",
                "ห้วยทรายเหนือ",
                "เขาใหญ่",
                "ไร่ใหม่พัฒนา"
            ]
        },
        "ท่ายาง": {
            "PostCode": 76130,
            "Tambons": [
                "ท่ายาง",
                "ท่าคอย",
                "ยางหย่อง",
                "มาบปลาเค้า",
                "วังไคร้",
                "กลัดหลวง",
                "ปึกเตียน",
                "เขากระปุก",
                "ท่าแลง",
                "บ้านในดง",
                "หนองจอก",
                "ท่าไม้รวก"
            ]
        },
        "เขาย้อย": {
            "PostCode": 76140,
            "Tambons": [
                "สระพัง",
                "บางเค็ม",
                "เขาย้อย",
                "ทับคาง",
                "หนองปลาไหล",
                "หนองปรง",
                "หนองชุมพล",
                "ห้วยโรง",
                "ห้วยท่าช้าง",
                "หนองชุมพลเหนือ"
            ]
        },
        "บ้านลาด": {
            "PostCode": 76150,
            "Tambons": [
                "ไร่มะขาม",
                "ห้วยลึก",
                "ถ้ำรงค์",
                "ท่าช้าง",
                "สมอพลือ",
                "บ้านลาด",
                "ท่าเสน",
                "หนองกระเจ็ด",
                "หนองกะปุ",
                "ตำหรุ",
                "ลาดโพธิ์",
                "สะพานไกร",
                "บ้านทาน",
                "โรงเข้",
                "บ้านหาด",
                "ไร่โคก",
                "ห้วยข้อง",
                "ไร่สะท้อน"
            ]
        },
        "หนองหญ้าปล้อง": {
            "PostCode": 76160,
            "Tambons": [
                "ยางน้ำกลัดใต้",
                "ยางน้ำกลัดเหนือ",
                "หนองหญ้าปล้อง",
                "ท่าตะคร้อ"
            ]
        },
        "แก่งกระจาน": {
            "PostCode": 76170,
            "Tambons": [
                "วังจันทร์",
                "ห้วยแม่เพรียง",
                "พุสวรรค์",
                "ป่าเด็ง",
                "สองพี่น้อง",
                "แก่งกระจาน"
            ]
        }
    },
    "ประจวบคีรีขันธ์": {
        "เมืองประจวบคีรีขันธ์": {
            "PostCode": 77000,
            "Tambons": [
                "เกาะหลัก",
                "ประจวบคีรีขันธ์",
                "ห้วยทราย",
                "คลองวาฬ",
                "อ่าวน้อย",
                "บ่อนอก",
                "อ่าวน้อย"
            ]
        },
        "หัวหิน": {
            "PostCode": 77110,
            "Tambons": [
                "หัวหิน",
                "หนองพลับ",
                "ทับใต้",
                "หนองแก",
                "ห้วยสัตว์ใหญ่",
                "บึงนคร",
                "หินเหล็กไฟ"
            ]
        },
        "ปราณบุรี": {
            "PostCode": 77120,
            "Tambons": [
                "เขาจ้าว",
                "ปราณบุรี",
                "หนองตาแต้ม",
                "วังก์พง",
                "เขาน้อย",
                "เขาน้อย",
                "ปากน้ำปราณ"
            ]
        },
        "สามร้อยยอด": {
            "PostCode": 77120,
            "Tambons": [
                "สามร้อยยอด",
                "ไร่ใหม่",
                "ศาลาลัย",
                "ไร่เก่า",
                "ศิลาลอย"
            ]
        },
        "ทับสะแก": {
            "PostCode": 77130,
            "Tambons": [
                "อ่างทอง",
                "นาหูกวาง",
                "ทับสะแก",
                "ห้วยยาง",
                "แสงอรุณ",
                "เขาล้าน"
            ]
        },
        "บางสะพาน": {
            "PostCode": 77140,
            "Tambons": [
                "แม่รำพึง",
                "กำเนิดนพคุณ",
                "พงศ์ประศาสน์",
                "ธงชัย",
                "ชัยเกษม",
                "ร่อนทอง",
                "ทองมงคล"
            ]
        },
        "กุยบุรี": {
            "PostCode": 77150,
            "Tambons": [
                "หาดขาม",
                "สามกระทาย",
                "เขาแดง",
                "กุยเหนือ",
                "กุยบุรี",
                "ดอนยายหนู"
            ]
        },
        "บางสะพานน้อย": {
            "PostCode": 77170,
            "Tambons": [
                "ปากแพรก",
                "ช้างแรก",
                "ทรายทอง",
                "บางสะพาน",
                "ไชยราช"
            ]
        }
    },
    "นครศรีธรรมราช": {
        "เมืองนครศรีธรรมราช": {
            "PostCode": 80000,
            "Tambons": [
                "คลัง",
                "ในเมือง",
                "ปากนคร",
                "ท่าไร่",
                "ปากพูน",
                "นาเคียน",
                "ไชยมนตรี",
                "โพธิ์เสด็จ",
                "มะม่วงสองต้น",
                "ท่าซัก",
                "ท่าวัง",
                "ท่าเรือ",
                "ท่างิ้ว",
                "นาทราย",
                "กำแพงเซา",
                "ท่าเรือ",
                "บางจาก"
            ]
        },
        "พระพรหม": {
            "PostCode": 80000,
            "Tambons": [
                "ช้างซ้าย",
                "นาพรุ",
                "ท้ายสำเภา",
                "นาสาร"
            ]
        },
        "ทุ่งสง": {
            "PostCode": 80110,
            "Tambons": [
                "ชะมาย",
                "ควนกรด",
                "น้ำตก",
                "ถ้ำใหญ่",
                "นาหลวงเสน",
                "เขาขาว",
                "นาโพธิ์",
                "นาไม้ไผ่",
                "ปากแพรก",
                "หนองหงส์",
                "เขาโร",
                "ที่วัง",
                "กะปาง",
                "ที่วัง",
                "เขาโร"
            ]
        },
        "สิชล": {
            "PostCode": 80120,
            "Tambons": [
                "เปลี่ยน",
                "สี่ขีด",
                "เขาน้อย",
                "ฉลอง",
                "ทุ่งปรัง",
                "ทุ่งใส",
                "สิชล",
                "เทพราช",
                "เสาเภา"
            ]
        },
        "จุฬาภรณ์": {
            "PostCode": 80130,
            "Tambons": [
                "ทุ่งโพธิ์",
                "สามตำบล",
                "นาหมอบุญ",
                "ควนหนองคว้า",
                "บ้านควนมุด",
                "บ้านชะอวด"
            ]
        },
        "ร่อนพิบูลย์": {
            "PostCode": 80130,
            "Tambons": [
                "ร่อนพิบูลย์",
                "ควนเกย",
                "ควนชุม",
                "ควนพัง",
                "เสาธง",
                "หินตก"
            ]
        },
        "ปากพนัง": {
            "PostCode": 80140,
            "Tambons": [
                "แหลมตะลุมพุก",
                "ขนาบนาก",
                "หูล่อง",
                "ท่าพยา",
                "ป่าระกำ",
                "ปากแพรก",
                "ปากพนังฝั่งตะวันออก",
                "ปากพนัง",
                "ปากพนังฝั่งตะวันตก",
                "บ้านเพิง",
                "บางพระ",
                "บางศาลา",
                "บ้านใหม่",
                "คลองกระบือ",
                "บางตะพง",
                "ชะเมา",
                "เกาะทวด",
                "คลองน้อย"
            ]
        },
        "ฉวาง": {
            "PostCode": 80150,
            "Tambons": [
                "ไสหร้า",
                "นากะชะ",
                "นาแว",
                "ไม้เรียง",
                "ฉวาง",
                "จันดี",
                "ละอาย",
                "ฉวาง",
                "กะเปียด",
                "นาเขลียง",
                "ห้วยปริก",
                "นากะชะ",
                "ไม้เรียง",
                "นาแว"
            ]
        },
        "ท่าศาลา": {
            "PostCode": 80160,
            "Tambons": [
                "สระแก้ว",
                "โมคลาน",
                "ไทยบุรี",
                "ดอนตะโก",
                "ตลิ่งชัน",
                "ท่าขึ้น",
                "ท่าศาลา",
                "หัวตะพาน",
                "กลาย",
                "โพธิ์ทอง"
            ]
        },
        "นบพิตำ": {
            "PostCode": 80160,
            "Tambons": [
                "กะหรอ",
                "นบพิตำ",
                "กรุงชิง",
                "นาเหรง"
            ]
        },
        "หัวไทร": {
            "PostCode": 80170,
            "Tambons": [
                "หัวไทร",
                "ท่าซอม",
                "ทรายขาว",
                "ควนชะลิก",
                "แหลม",
                "เขาพังไกร",
                "บางนบ",
                "บ้านราม",
                "เกาะเพชร",
                "รามแก้ว",
                "หน้าสตน"
            ]
        },
        "ชะอวด": {
            "PostCode": 80180,
            "Tambons": [
                "วังอ่าง",
                "นางหลง",
                "ท่าเสม็ด",
                "ท่าประจะ",
                "ชะอวด",
                "เคร็ง",
                "บ้านตูล",
                "เขาพระทอง",
                "ขอนหาด",
                "เกาะขันธ์",
                "ควนหนองหงษ์"
            ]
        },
        "เชียรใหญ่": {
            "PostCode": 80190,
            "Tambons": [
                "ไสหมาก",
                "เสือหึง",
                "แม่เจ้าอยู่หัว",
                "บ้านเนิน",
                "บ้านกลาง",
                "ท้องลำเจียก",
                "เชียรใหญ่",
                "เขาพระบาท",
                "การะเกด",
                "ท่าขนาน"
            ]
        },
        "เฉลิมพระเกียรติ": {
            "PostCode": 80190,
            "Tambons": [
                "เชียรเขา",
                "สวนหลวง",
                "ดอนตรอ",
                "ทางพูน",
                "ทางพูน"
            ]
        },
        "ขนอม": {
            "PostCode": 80210,
            "Tambons": [
                "ขนอม",
                "ควนทอง",
                "ท้องเนียน"
            ]
        },
        "นาบอน": {
            "PostCode": 80220,
            "Tambons": [
                "นาบอน",
                "ทุ่งสง",
                "แก้วแสน",
                "แก้วแสน"
            ]
        },
        "ช้างกลาง": {
            "PostCode": 80220,
            "Tambons": [
                "ช้างกลาง",
                "สวนขัน",
                "หลักช้าง",
                "ช้างกลาง"
            ]
        },
        "ลานสกา": {
            "PostCode": 80230,
            "Tambons": [
                "ท่าดี",
                "เขาแก้ว",
                "ลานสกา",
                "กำโลน",
                "ขุนทะเล"
            ]
        },
        "ทุ่งใหญ่": {
            "PostCode": 80240,
            "Tambons": [
                "ปริก",
                "ท่ายาง",
                "กุแหระ",
                "กรุงหยัน",
                "บางรูป",
                "ทุ่งสัง",
                "ทุ่งใหญ่"
            ]
        },
        "ถ้ำพรรณรา": {
            "PostCode": 80260,
            "Tambons": [
                "ดุสิต",
                "ถ้ำพรรณรา",
                "คลองเส"
            ]
        },
        "พิปูน": {
            "PostCode": 80270,
            "Tambons": [
                "กะทูน",
                "ยางค้อม",
                "เขาพระ",
                "ควนกลาง",
                "พิปูน"
            ]
        },
        "พรหมคีรี": {
            "PostCode": 80320,
            "Tambons": [
                "พรหมโลก",
                "ทอนหงส์",
                "อินคีรี",
                "นาเรียง",
                "บ้านเกาะ"
            ]
        },
        "บางขัน": {
            "PostCode": 80360,
            "Tambons": [
                "บ้านนิคม",
                "บ้านลำนาว",
                "บางขัน",
                "วังหิน"
            ]
        }
    },
    "กระบี่": {
        "เขาพนม": {
            "PostCode": 80240,
            "Tambons": [
                "สินปุน",
                "โคกหาร",
                "พรุเตียว",
                "เขาดิน",
                "หน้าเขา",
                "เขาพนม"
            ]
        },
        "เมืองกระบี่": {
            "PostCode": 81000,
            "Tambons": [
                "หนองทะเล",
                "อ่าวนาง",
                "ปากน้ำ",
                "ทับปริก",
                "คลองประสงค์",
                "เขาทอง",
                "เขาคราม",
                "กระบี่ใหญ่",
                "กระบี่น้อย",
                "ไสไทย"
            ]
        },
        "อ่าวลึก": {
            "PostCode": 81110,
            "Tambons": [
                "คลองยา",
                "คลองหิน",
                "นาเหนือ",
                "แหลมสัก",
                "เขาใหญ่",
                "อ่าวลึกใต้",
                "อ่าวลึกเหนือ",
                "บ้านกลาง",
                "อ่าวลึกน้อย"
            ]
        },
        "คลองท่อม": {
            "PostCode": 81120,
            "Tambons": [
                "คลองท่อมเหนือ",
                "คลองท่อมใต้",
                "เพหลา",
                "ห้วยน้ำขาว",
                "พรุดินนา",
                "คลองพน",
                "ทรายขาว"
            ]
        },
        "เกาะลันตา": {
            "PostCode": 81120,
            "Tambons": [
                "คลองยาง",
                "เกาะกลาง",
                "เกาะลันตาน้อย",
                "เกาะลันตาใหญ่",
                "ศาลาด่าน"
            ]
        },
        "เหนือคลอง": {
            "PostCode": 81130,
            "Tambons": [
                "คลองขนาน",
                "คลองเขม้า",
                "โคกยาง",
                "เกาะศรีบอยา",
                "ปกาสัย",
                "ห้วยยูง",
                "ตลิ่งชัน",
                "เหนือคลอง"
            ]
        },
        "ปลายพระยา": {
            "PostCode": 81160,
            "Tambons": [
                "ปลายพระยา",
                "คีรีวง",
                "เขาต่อ",
                "เขาเขน"
            ]
        },
        "ลำทับ": {
            "PostCode": 81190,
            "Tambons": [
                "ลำทับ",
                "ดินอุดม",
                "ดินแดง",
                "ทุ่งไทรทอง"
            ]
        }
    },
    "พังงา": {
        "เมืองพังงา": {
            "PostCode": 82000,
            "Tambons": [
                "สองแพรก",
                "บางเตย",
                "ถ้ำน้ำผุด",
                "ทุ่งคาโงก",
                "เกาะปันหยี",
                "นบปริง",
                "ท้ายช้าง",
                "ป่ากอ",
                "ตากแดด"
            ]
        },
        "ตะกั่วป่า": {
            "PostCode": 82110,
            "Tambons": [
                "บางไทร",
                "บางนายสี",
                "ตะกั่วป่า",
                "ตำตัว",
                "โคกเคียน",
                "บางม่วง",
                "เกาะคอเขา",
                "คึกคัก",
                "บางม่วง"
            ]
        },
        "ท้ายเหมือง": {
            "PostCode": 82120,
            "Tambons": [
                "ลำภี",
                "ทุ่งมะพร้าว",
                "บางทอง",
                "นาเตย",
                "ท้ายเหมือง",
                "ลำแก่น",
                "ลำแก่น"
            ]
        },
        "ตะกั่วทุ่ง": {
            "PostCode": 82130,
            "Tambons": [
                "ถ้ำ",
                "คลองเคียน",
                "ท่าอยู่",
                "กะไหล",
                "กระโสม",
                "โคกกลอย",
                "หล่อยูง"
            ]
        },
        "คุระบุรี": {
            "PostCode": 82150,
            "Tambons": [
                "บางวัน",
                "เกาะพระทอง",
                "คุระ",
                "แม่นางขาว"
            ]
        },
        "เกาะยาว": {
            "PostCode": 82160,
            "Tambons": [
                "เกาะยาวใหญ่",
                "เกาะยาวน้อย",
                "พรุใน"
            ]
        },
        "กะปง": {
            "PostCode": 82170,
            "Tambons": [
                "ท่านา",
                "รมณีย์",
                "เหมาะ",
                "กะปง",
                "เหล"
            ]
        },
        "ทับปุด": {
            "PostCode": 82180,
            "Tambons": [
                "มะรุ่ย",
                "ทับปุด",
                "โคกเจริญ",
                "บ่อแสน",
                "บางเหรียง",
                "ถ้ำทองหลาง"
            ]
        }
    },
    "ภูเก็ต": {
        "เมืองภูเก็ต": {
            "PostCode": 83000,
            "Tambons": [
                "ตลาดใหญ่",
                "รัษฎา",
                "วิชิต",
                "เกาะแก้ว",
                "ตลาดเหนือ",
                "กะรน",
                "ฉลอง",
                "ราไวย์"
            ]
        },
        "ถลาง": {
            "PostCode": 83110,
            "Tambons": [
                "ศรีสุนทร",
                "เทพกระษัตรี",
                "เชิงทะเล",
                "ป่าคลอก",
                "ไม้ขาว",
                "สาคู"
            ]
        },
        "กะทู้": {
            "PostCode": 83120,
            "Tambons": [
                "กะทู้",
                "ป่าตอง",
                "กมลา"
            ]
        }
    },
    "สุราษฎร์ธานี": {
        "เมืองสุราษฎร์ธานี": {
            "PostCode": 84000,
            "Tambons": [
                "บางกุ้ง",
                "บางโพธิ์",
                "บางใบไม้",
                "คลองฉนาก",
                "บางไทร",
                "คลองน้อย",
                "บางชนะ",
                "ตลาด",
                "มะขามเตี้ย",
                "วัดประดู่",
                "ขุนทะเล"
            ]
        },
        "ไชยา": {
            "PostCode": 84110,
            "Tambons": [
                "พุมเรียง",
                "ตลาดไชยา",
                "ทุ่ง",
                "โมถ่าย",
                "ตะกรบ",
                "ป่าเว",
                "เวียง",
                "เลม็ด",
                "ปากหมาก"
            ]
        },
        "บ้านนาสาร": {
            "PostCode": 84120,
            "Tambons": [
                "นาสาร",
                "ทุ่งเตา",
                "ลำพูน",
                "คลองปราบ",
                "น้ำพุ",
                "ทุ่งเตาใหม่",
                "ท่าชี",
                "เพิ่มพูนทรัพย์",
                "ควนสุบรรณ",
                "ควนสุบรรณ",
                "ควนศรี",
                "พรุพี"
            ]
        },
        "พุนพิน": {
            "PostCode": 84130,
            "Tambons": [
                "ท่าข้าม",
                "พุนพิน",
                "กรูด",
                "ตะปาน",
                "เขาหัวควาย",
                "หนองไทร",
                "หัวเตย",
                "ท่าโรงช้าง",
                "มะลวน",
                "น้ำรอบ",
                "ศรีวิชัย",
                "บางงอน",
                "บางเดือน",
                "บางมะเดื่อ",
                "ลีเล็ด",
                "ท่าสะท้อน"
            ]
        },
        "เกาะสมุย": {
            "PostCode": 84140,
            "Tambons": [
                "หน้าเมือง",
                "ตลิ่งงาม",
                "ลิปะน้อย",
                "อ่างทอง",
                "อ่างทอง",
                "มะเร็ต",
                "บ่อผุด",
                "แม่น้ำ"
            ]
        },
        "ท่าฉาง": {
            "PostCode": 84150,
            "Tambons": [
                "ท่าฉาง",
                "ปากฉลุย",
                "เสวียด",
                "เขาถ่าน",
                "คลองไทร",
                "ท่าเคย"
            ]
        },
        "กาญจนดิษฐ์": {
            "PostCode": 84160,
            "Tambons": [
                "ตะเคียนทอง",
                "ช้างขวา",
                "ป่าร่อน",
                "คลองสระ",
                "ช้างซ้าย",
                "กรูด",
                "กะแดะ",
                "ท่าทอง",
                "พลายวาส",
                "ท่าอุแท",
                "ท่าทองใหม่",
                "ทุ่งรัง",
                "ทุ่งกง",
                "ท่าอุแท"
            ]
        },
        "ดอนสัก": {
            "PostCode": 84160,
            "Tambons": [
                "ชลคราม",
                "ดอนสัก",
                "ไชยคราม",
                "ปากแพรก"
            ]
        },
        "ท่าชนะ": {
            "PostCode": 84170,
            "Tambons": [
                "ท่าชนะ",
                "สมอทอง",
                "ประสงค์",
                "คันธุลี",
                "คลองพา",
                "วัง"
            ]
        },
        "คีรีรัฐนิคม": {
            "PostCode": 84180,
            "Tambons": [
                "ถ้ำสิงขร",
                "ย่านยาว",
                "ท่ากระดาน",
                "กะเปา",
                "น้ำหัก",
                "บ้านยาง",
                "ท่าขนอน",
                "บ้านทำเนียบ"
            ]
        },
        "เวียงสระ": {
            "PostCode": 84190,
            "Tambons": [
                "ทุ่งหลวง",
                "คลองฉนวน",
                "บ้านส้อง",
                "เวียงสระ",
                "เขานิพันธ์"
            ]
        },
        "พระแสง": {
            "PostCode": 84210,
            "Tambons": [
                "ไทรโสภา",
                "สินเจริญ",
                "ไทรขึง",
                "บางสวรรค์",
                "สินปุน",
                "อิปัน",
                "สาคู"
            ]
        },
        "เคียนซา": {
            "PostCode": 84210,
            "Tambons": [
                "พ่วงพรมคร",
                "อรัญคามวารี",
                "เขาตอก",
                "เคียนซา",
                "บ้านเสด็จ"
            ]
        },
        "บ้านตาขุน": {
            "PostCode": 84230,
            "Tambons": [
                "เขาพัง",
                "พรุไทย",
                "พะแสง",
                "เขาวง"
            ]
        },
        "บ้านนาเดิม": {
            "PostCode": 84240,
            "Tambons": [
                "ท่าเรือ",
                "บ้านนา",
                "นาใต้",
                "ทรัพย์ทวี"
            ]
        },
        "พนม": {
            "PostCode": 84250,
            "Tambons": [
                "พนม",
                "ต้นยวน",
                "คลองศก",
                "พลูเถื่อน",
                "พังกาญจน์",
                "คลองชะอุ่น"
            ]
        },
        "เกาะพะงัน": {
            "PostCode": 84280,
            "Tambons": [
                "เกาะพะงัน",
                "บ้านใต้",
                "เกาะเต่า"
            ]
        },
        "ชัยบุรี": {
            "PostCode": 84350,
            "Tambons": [
                "คลองน้อย",
                "ชัยบุรี",
                "ไทรทอง",
                "สองแพรก"
            ]
        },
        "วิภาวดี": {
            "PostCode": 84370,
            "Tambons": [
                "ตะกุกใต้",
                "ตะกุกเหนือ"
            ]
        }
    },
    "ระนอง": {
        "เมืองระนอง": {
            "PostCode": 85000,
            "Tambons": [
                "ราชกรูด",
                "หงาว",
                "บางริ้น",
                "เกาะพยาม",
                "หาดส้มแป้น",
                "บางนอน",
                "เขานิเวศน์",
                "ปากน้ำ",
                "ทรายแดง"
            ]
        },
        "กระบุรี": {
            "PostCode": 85110,
            "Tambons": [
                "น้ำจืดน้อย",
                "น้ำจืด",
                "บางใหญ่",
                "จ.ป.ร.",
                "ลำเลียง",
                "มะมุ",
                "ปากจั่น"
            ]
        },
        "กะเปอร์": {
            "PostCode": 85120,
            "Tambons": [
                "เชี่ยวเหลียง",
                "บางหิน",
                "บ้านนา",
                "ม่วงกลวง",
                "กะเปอร์"
            ]
        },
        "สุขสำราญ": {
            "PostCode": 85120,
            "Tambons": [
                "กำพวน",
                "นาคา"
            ]
        },
        "ละอุ่น": {
            "PostCode": 85130,
            "Tambons": [
                "ในวงเหนือ",
                "บางแก้ว",
                "บางพระเหนือ",
                "บางพระใต้",
                "ละอุ่นใต้",
                "ในวงใต้",
                "ละอุ่นเหนือ"
            ]
        }
    },
    "ชุมพร": {
        "เมืองชุมพร": {
            "PostCode": 86000,
            "Tambons": [
                "ท่าตะเภา",
                "นาชะอัง",
                "นาทุ่ง",
                "บางลึก",
                "บางหมาก",
                "หาดพันไกร",
                "ท่ายาง",
                "ขุนกระทิง",
                "ตากแดด",
                "วังไผ่",
                "วิสัยเหนือ",
                "ถ้ำสิงห์",
                "ทุ่งคา",
                "หาดทรายรี",
                "ปากน้ำ",
                "ท่ายาง",
                "บ้านนา",
                "วังใหม่",
                "ขุนกระทิง",
                "ตากแดด",
                "วังไผ่"
            ]
        },
        "หลังสวน": {
            "PostCode": 86110,
            "Tambons": [
                "ท่ามะพลา",
                "นาขา",
                "นาพญา",
                "บ้านควน",
                "พ้อแดง",
                "ขันเงิน",
                "หลังสวน",
                "หาดยาย",
                "แหลมทราย",
                "วังตะกอ",
                "บางมะพร้าว",
                "บางน้ำจืด",
                "ปากน้ำ",
                "บางมะพร้าว"
            ]
        },
        "สวี": {
            "PostCode": 86130,
            "Tambons": [
                "ด่านสวี",
                "เขาค่าย",
                "เขาทะลุ",
                "ครน",
                "ทุ่งระยะ",
                "ท่าหิน",
                "สวี",
                "วิสัยใต้",
                "ปากแพรก",
                "นาสัก",
                "นาโพธิ์"
            ]
        },
        "ท่าแซะ": {
            "PostCode": 86140,
            "Tambons": [
                "ท่าข้าม",
                "ท่าแซะ",
                "สองพี่น้อง",
                "หงษ์เจริญ",
                "ทรัพย์อนันต์",
                "สลุย",
                "คุริง",
                "นากระตาม",
                "รับร่อ",
                "หินแก้ว",
                "รับร่อ"
            ]
        },
        "ปะทิว": {
            "PostCode": 86160,
            "Tambons": [
                "ชุมโค",
                "บางสน",
                "ทะเลทรัพย์",
                "เขาไชยราช",
                "ดอนยาง",
                "ปากคลอง",
                "สะพลี"
            ]
        },
        "ละแม": {
            "PostCode": 86170,
            "Tambons": [
                "ทุ่งคาวัด",
                "ละแม",
                "สวนแตง",
                "ทุ่งหลวง"
            ]
        },
        "พะโต๊ะ": {
            "PostCode": 86180,
            "Tambons": [
                "พะโต๊ะ",
                "ปากทรง",
                "พระรักษ์",
                "ปังหวาน"
            ]
        },
        "ทุ่งตะโก": {
            "PostCode": 86220,
            "Tambons": [
                "ช่องไม้แก้ว",
                "ทุ่งตะไคร",
                "ปากตะโก",
                "ตะโก"
            ]
        }
    },
    "สงขลา": {
        "เมืองสงขลา": {
            "PostCode": 90000,
            "Tambons": [
                "ทุ่งหวัง",
                "เกาะแต้ว",
                "บ่อยาง",
                "เขารูปช้าง",
                "พะวง",
                "เกาะยอ"
            ]
        },
        "หาดใหญ่": {
            "PostCode": 90110,
            "Tambons": [
                "ฉลุง",
                "ทุ่งตำเสา",
                "หาดใหญ่",
                "คลองอู่ตะเภา",
                "ควนลัง",
                "คูเต่า",
                "ท่าข้าม",
                "คลองแห",
                "น้ำน้อย",
                "ทุ่งใหญ่",
                "คอหงส์",
                "คอหงส์",
                "พะตง",
                "บ้านพรุ"
            ]
        },
        "บางกล่ำ": {
            "PostCode": 90110,
            "Tambons": [
                "บางกล่ำ",
                "ท่าช้าง",
                "บ้านหาร",
                "แม่ทอม"
            ]
        },
        "คลองหอยโข่ง": {
            "PostCode": 90110,
            "Tambons": [
                "คลองหลา",
                "โคกม่วง",
                "คลองหอยโข่ง",
                "ทุ่งลาน",
                "โคกม่วง"
            ]
        },
        "สะเดา": {
            "PostCode": 90120,
            "Tambons": [
                "สำนักแต้ว",
                "สะเดา",
                "ปริก",
                "สำนักขาม",
                "พังลา",
                "ท่าโพธิ์",
                "เขามีเกียรติ",
                "ทุ่งหมอ",
                "ปาดังเบซาร์",
                "สำนักขาม"
            ]
        },
        "จะนะ": {
            "PostCode": 90130,
            "Tambons": [
                "ขุนตัดหวาย",
                "แค",
                "ตลิ่งชัน",
                "คู",
                "จะโหนง",
                "ท่าหมอไทร",
                "คลองเปียะ",
                "นาหว้า",
                "นาทับ",
                "สะกอม",
                "สะพานไม้แก่น",
                "ป่าชิง",
                "บ้านนา",
                "น้ำขาว"
            ]
        },
        "ระโนด": {
            "PostCode": 90140,
            "Tambons": [
                "ปากแตระ",
                "ระวะ",
                "แดนสงวน",
                "พังยาง",
                "บ่อตรุ",
                "วัดสน",
                "บ้านใหม่",
                "คลองแดน",
                "ตะเครียะ",
                "ท่าบอน",
                "ระโนด",
                "บ้านขาว"
            ]
        },
        "เทพา": {
            "PostCode": 90150,
            "Tambons": [
                "เทพา",
                "สะกอม",
                "เกาะสะบ้า",
                "ปากบาง",
                "ท่าม่วง",
                "วังใหญ่",
                "ลำไพล",
                "ท่าม่วง"
            ]
        },
        "นาทวี": {
            "PostCode": 90160,
            "Tambons": [
                "คลองกวาง",
                "ประกอบ",
                "นาทวี",
                "ทับช้าง",
                "นาหมอศรี",
                "สะท้อน",
                "ท่าประดู่",
                "ฉาง",
                "คลองทราย",
                "ปลักหนู"
            ]
        },
        "รัตภูมิ": {
            "PostCode": 90180,
            "Tambons": [
                "คูหาใต้",
                "กำแพงเพชร",
                "เขาพระ",
                "ท่าชะมวง",
                "ควนรู",
                "ควนรู"
            ]
        },
        "สทิงพระ": {
            "PostCode": 90190,
            "Tambons": [
                "คลองรี",
                "ชุมพล",
                "ดีหลวง",
                "สนามชัย",
                "กระดังงา",
                "จะทิ้งพระ",
                "ท่าหิน",
                "วัดจันทร์",
                "บ่อแดง",
                "คูขุด",
                "บ่อดาน"
            ]
        },
        "สะบ้าย้อย": {
            "PostCode": 90210,
            "Tambons": [
                "ธารคีรี",
                "สะบ้าย้อย",
                "เขาแดง",
                "บาโหย",
                "จะแหน",
                "บ้านโหนด",
                "ทุ่งพอ",
                "เปียน",
                "คูหา"
            ]
        },
        "ควนเนียง": {
            "PostCode": 90220,
            "Tambons": [
                "บางเหรียง",
                "รัตภูมิ",
                "ควนโส",
                "ห้วยลึก"
            ]
        },
        "กระแสสินธุ์": {
            "PostCode": 90270,
            "Tambons": [
                "เกาะใหญ่",
                "โรง",
                "เชิงแส",
                "กระแสสินธุ์"
            ]
        },
        "สิงหนคร": {
            "PostCode": 90280,
            "Tambons": [
                "ชิงโค",
                "สทิงหม้อ",
                "ทำนบ",
                "หัวเขา",
                "รำแดง",
                "วัดขนุน",
                "ชะแล้",
                "ปากรอ",
                "ม่วงงาม",
                "บางเขียด",
                "ป่าขาด"
            ]
        },
        "นาหม่อม": {
            "PostCode": 90310,
            "Tambons": [
                "นาหม่อม",
                "คลองหรัง",
                "พิจิตร",
                "ทุ่งขมิ้น"
            ]
        }
    },
    "สตูล": {
        "เมืองสตูล": {
            "PostCode": 91000,
            "Tambons": [
                "ตันหยงโป",
                "พิมาน",
                "คลองขุด",
                "ปูยู",
                "ตำมะลัง",
                "เจ๊ะบิลัง",
                "ควนขัน",
                "เกาะสาหร่าย",
                "เกาะสาหร่าย",
                "ควนโพธิ์",
                "เกตรี",
                "ฉลุง",
                "บ้านควน"
            ]
        },
        "ละงู": {
            "PostCode": 91110,
            "Tambons": [
                "ละงู",
                "น้ำผุด",
                "กำแพง",
                "เขาขาว",
                "ปากน้ำ",
                "แหลมสน"
            ]
        },
        "ทุ่งหว้า": {
            "PostCode": 91120,
            "Tambons": [
                "ขอนคลาน",
                "ทุ่งบุหลัง",
                "ทุ่งหว้า",
                "นาทอน",
                "ป่าแก่บ่อหิน"
            ]
        },
        "ควนกาหลง": {
            "PostCode": 91130,
            "Tambons": [
                "ควนกาหลง",
                "ทุ่งนุ้ย",
                "อุใดเจริญ"
            ]
        },
        "มะนัง": {
            "PostCode": 91130,
            "Tambons": [
                "นิคมพัฒนา",
                "ปาล์มพัฒนา"
            ]
        },
        "ท่าแพ": {
            "PostCode": 91150,
            "Tambons": [
                "แป-ระ",
                "ท่าแพ",
                "สาคร",
                "ท่าเรือ"
            ]
        },
        "ควนโดน": {
            "PostCode": 91160,
            "Tambons": [
                "ควนสตอ",
                "ย่านซื่อ",
                "ควนโดน",
                "วังประจัน"
            ]
        }
    },
    "ตรัง": {
        "เมืองตรัง": {
            "PostCode": 92000,
            "Tambons": [
                "หนองตรุด",
                "ทับเที่ยง",
                "บางรัก",
                "โคกหล่อ",
                "ควนปริง",
                "นาตาล่วง",
                "นาโต๊ะหมิง",
                "น้ำผุด",
                "นาพละ",
                "บ้านโพธิ์",
                "บ้านควน",
                "นาโยงใต้",
                "นาบินหลา",
                "นาท่ามใต้",
                "นาท่ามเหนือ"
            ]
        },
        "วังวิเศษ": {
            "PostCode": 92000,
            "Tambons": [
                "ท่าสะบ้า",
                "วังมะปราง",
                "วังมะปรางเหนือ",
                "เขาวิเศษ",
                "อ่าวตง"
            ]
        },
        "สิเกา": {
            "PostCode": 92000,
            "Tambons": [
                "นาเมืองเพชร",
                "เขาไม้แก้ว",
                "บ่อหิน",
                "ไม้ฝาด",
                "กะลาเส"
            ]
        },
        "กันตัง": {
            "PostCode": 92110,
            "Tambons": [
                "คลองชีล้อม",
                "เกาะลิบง",
                "วังวน",
                "ย่านซื่อ",
                "บางหมาก",
                "บางสัก",
                "บางเป้า",
                "บ่อน้ำร้อน",
                "นาเกลือ",
                "โคกยาง",
                "ควนธานี",
                "คลองลุ",
                "กันตังใต้",
                "กันตัง"
            ]
        },
        "หาดสำราญ": {
            "PostCode": 92120,
            "Tambons": [
                "บ้าหวี",
                "ตะเสะ",
                "หาดสำราญ"
            ]
        },
        "ปะเหลียน": {
            "PostCode": 92120,
            "Tambons": [
                "ท่าข้าม",
                "เกาะสุกร",
                "สุโสะ",
                "บ้านนา",
                "ท่าพญา",
                "บางด้วน",
                "แหลมสอม",
                "ลิพัง",
                "ปะเหลียน",
                "ทุ่งยาว"
            ]
        },
        "ห้วยยอด": {
            "PostCode": 92130,
            "Tambons": [
                "หนองช้างแล่น",
                "เขาปูน",
                "เขากอบ",
                "ท่างิ้ว",
                "ห้วยนาง",
                "ปากคม",
                "ในเตา",
                "ทุ่งต่อ",
                "เขาขาว",
                "ห้วยยอด",
                "ปากแจ่ม",
                "ลำภูรา",
                "บางดี",
                "บางกุ้ง",
                "นาวง",
                "วังคีรี"
            ]
        },
        "รัษฎา": {
            "PostCode": 92130,
            "Tambons": [
                "หนองปรือ",
                "หนองบัว",
                "ควนเมา",
                "คลองปาง",
                "เขาไพร"
            ]
        },
        "ย่านตาขาว": {
            "PostCode": 92140,
            "Tambons": [
                "หนองบ่อ",
                "ย่านตาขาว",
                "โพรงจระเข้",
                "เกาะเปียะ",
                "ทุ่งกระบือ",
                "ทุ่งค่าย",
                "นาชุมเห็ด",
                "ในควน"
            ]
        },
        "นาโยง": {
            "PostCode": 92170,
            "Tambons": [
                "นาหมื่นศรี",
                "โคกสะบ้า",
                "ละมอ",
                "ช่อง",
                "นาโยงเหนือ",
                "นาข้าวเสีย"
            ]
        }
    },
    "พัทลุง": {
        "เมืองพัทลุง": {
            "PostCode": 93000,
            "Tambons": [
                "ควนมะพร้าว",
                "คูหาสวรรค์",
                "เขาเจียก",
                "โคกชะงาย",
                "ชัยบุรี",
                "ท่าแค",
                "ตำนาน",
                "ท่ามิหรำ",
                "นาโหนด",
                "ปรางหมู่",
                "พญาขัน",
                "ร่มเมือง",
                "ลำปำ",
                "นาท่อม"
            ]
        },
        "กงหรา": {
            "PostCode": 93000,
            "Tambons": [
                "ชะรัด",
                "สมหวัง",
                "กงหรา",
                "คลองเฉลิม",
                "คลองทรายขาว"
            ]
        },
        "ศรีนครินทร์": {
            "PostCode": 93000,
            "Tambons": [
                "ชุมพล",
                "บ้านนา",
                "ลำสินธุ์",
                "อ่างทอง"
            ]
        },
        "ควนขนุน": {
            "PostCode": 93110,
            "Tambons": [
                "ปันแต",
                "แหลมโตนด",
                "พนมวังก์",
                "ดอนทราย",
                "ชะมวง",
                "โตนดด้วน",
                "ควนขนุน",
                "แพรกหา",
                "นาขยาด",
                "มะกอกเหนือ",
                "พนางตุง",
                "ทะเลน้อย"
            ]
        },
        "ปากพะยูน": {
            "PostCode": 93120,
            "Tambons": [
                "ดอนประดู่",
                "ปากพะยูน",
                "เกาะหมาก",
                "ฝาละมี",
                "เกาะนางคำ",
                "ดอนทราย",
                "หารเทา"
            ]
        },
        "เขาชัยสน": {
            "PostCode": 93130,
            "Tambons": [
                "จองถนน",
                "โคกม่วง",
                "หานโพธิ์",
                "เขาชัยสน",
                "ควนขนุน"
            ]
        },
        "บางแก้ว": {
            "PostCode": 93140,
            "Tambons": [
                "นาปะขอ",
                "ท่ามะเดื่อ",
                "โคกสัก",
                "โคกสัก"
            ]
        },
        "ตะโหมด": {
            "PostCode": 93160,
            "Tambons": [
                "คลองใหญ่",
                "ตะโหมด",
                "แม่ขรี"
            ]
        },
        "ป่าบอน": {
            "PostCode": 93170,
            "Tambons": [
                "วังใหม่",
                "โคกทราย",
                "ทุ่งนารี",
                "หนองธง",
                "ป่าบอน"
            ]
        },
        "ศรีบรรพต": {
            "PostCode": 93190,
            "Tambons": [
                "เขาปู่",
                "เขาย่า",
                "ตะแพน"
            ]
        },
        "ป่าพะยอม": {
            "PostCode": 93210,
            "Tambons": [
                "ป่าพะยอม",
                "ลานข่อย",
                "บ้านพร้าว",
                "เกาะเต่า"
            ]
        }
    },
    "ปัตตานี": {
        "เมืองปัตตานี": {
            "PostCode": 94000,
            "Tambons": [
                "ตันหยงลุโละ",
                "ตะลุโบะ",
                "จะบังติกอ",
                "ปะกาฮะรัง",
                "บาราเฮาะ",
                "อาเนาะรู",
                "กะมิยอ",
                "บานา",
                "ปุยุด",
                "รูสะมิแล",
                "สะบารัง",
                "คลองมานิง",
                "บาราโหม"
            ]
        },
        "สายบุรี": {
            "PostCode": 94110,
            "Tambons": [
                "กะดุนง",
                "บางเก่า",
                "ตะลุบัน",
                "ละหาร",
                "ตะบิ้ง",
                "แป้น",
                "ปะเสยะวอ",
                "มะนังดาลำ",
                "เตราะบอน",
                "บือเระ",
                "ทุ่งคล้า"
            ]
        },
        "โคกโพธิ์": {
            "PostCode": 94120,
            "Tambons": [
                "ช้างให้ตก",
                "มะกรูด",
                "บางโกระ",
                "โคกโพธิ์",
                "ป่าบอน",
                "ทรายขาว",
                "นาเกตุ",
                "ท่าเรือ",
                "ควนโนรี",
                "ทุ่งพลา",
                "นาประดู่",
                "ปากล่อ"
            ]
        },
        "ปะนาเระ": {
            "PostCode": 94130,
            "Tambons": [
                "ปะนาเระ",
                "พ่อมิ่ง",
                "คอกกระบือ",
                "บ้านน้ำบ่อ",
                "ท่าน้ำ",
                "บ้านนอก",
                "บ้านกลาง",
                "ท่าข้าม",
                "ดอน",
                "ควน",
                "ดอน"
            ]
        },
        "ทุ่งยางแดง": {
            "PostCode": 94140,
            "Tambons": [
                "ตะโละแมะนา",
                "น้ำดำ",
                "พิเทน",
                "ปากู"
            ]
        },
        "มายอ": {
            "PostCode": 94140,
            "Tambons": [
                "สาคอบน",
                "สาคอใต้",
                "ลุโบะยิไร",
                "สะกำ",
                "ปานัน",
                "ปะโด",
                "มายอ",
                "ตรัง",
                "เกาะจัน",
                "กระเสาะ",
                "ถนน",
                "กระหวะ",
                "ลางา",
                "กระหวะ"
            ]
        },
        "ยะหริ่ง": {
            "PostCode": 94150,
            "Tambons": [
                "จะรัง",
                "ตอหลัง",
                "ตะโละ",
                "ตะโละกาโปร์",
                "ตันหยงดาลอ",
                "ตาแกะ",
                "ตาลีอายร์",
                "บางปู",
                "ปิยามุมัง",
                "ปุลากง",
                "มะนังยง",
                "ยามู",
                "ราตาปันยัง",
                "สาบัน",
                "หนองแรต",
                "แหลมโพธิ์",
                "บาโลย",
                "ตันหยงจึงงา"
            ]
        },
        "ยะรัง": {
            "PostCode": 94160,
            "Tambons": [
                "กอลำ",
                "เขาตูม",
                "คลองใหม่",
                "ประจัน",
                "ปิตูมุดี",
                "วัด",
                "ระแว้ง",
                "กระโด",
                "สะดาวา",
                "สะนอ",
                "เมาะมาวี",
                "ยะรัง"
            ]
        },
        "หนองจิก": {
            "PostCode": 94170,
            "Tambons": [
                "ยาบี",
                "ดอนรัก",
                "ปุโละปุโย",
                "บางตาวา",
                "บางเขา",
                "บ่อทอง",
                "ลิปะสะโง",
                "ท่ากำชำ",
                "ตุยง",
                "ดาโต๊ะ",
                "เกาะเปาะ",
                "คอลอตันหยง"
            ]
        },
        "แม่ลาน": {
            "PostCode": 94180,
            "Tambons": [
                "ป่าไร่",
                "ม่วงเตี้ย",
                "แม่ลาน"
            ]
        },
        "ไม้แก่น": {
            "PostCode": 94220,
            "Tambons": [
                "ตะโละไกรทอง",
                "ไม้แก่น",
                "ไทรทอง",
                "ดอนทราย"
            ]
        },
        "กะพ้อ": {
            "PostCode": 94230,
            "Tambons": [
                "ปล่องหอย",
                "ตะโละดือรามัน",
                "กะรุบี"
            ]
        }
    },
    "ยะลา": {
        "เมืองยะลา": {
            "PostCode": 95000,
            "Tambons": [
                "บันนังสาเรง",
                "บุดี",
                "เปาะเส้ง",
                "ยะลา",
                "ยุโป",
                "ท่าสาป",
                "สะเตงนอก",
                "สะเตง",
                "ตาเซะ",
                "หน้าถ้ำ",
                "ลิดล",
                "ลำใหม่",
                "พร่อน",
                "ลำพะยา"
            ]
        },
        "กรงปินัง": {
            "PostCode": 95000,
            "Tambons": [
                "กรงปินัง",
                "สะเอะ",
                "ห้วยกระทิง",
                "ปุโรง"
            ]
        },
        "เบตง": {
            "PostCode": 95110,
            "Tambons": [
                "ยะรม",
                "อัยเยอร์เวง",
                "ธารน้ำทิพย์",
                "ตาเนาะแมเราะ",
                "เบตง"
            ]
        },
        "ยะหา": {
            "PostCode": 95120,
            "Tambons": [
                "ละแอ",
                "ยะหา",
                "ปะแต",
                "บาโร๊ะ",
                "บาโงยซิแน",
                "ตาชี",
                "กาตอง"
            ]
        },
        "กาบัง": {
            "PostCode": 95120,
            "Tambons": [
                "กาบัง",
                "บาละ"
            ]
        },
        "บันนังสตา": {
            "PostCode": 95130,
            "Tambons": [
                "เขื่อนบางลาง",
                "ตลิ่งชัน",
                "ตาเนาะปูเต๊ะ",
                "ถ้ำทะลุ",
                "บันนังสตา",
                "บาเจาะ"
            ]
        },
        "ธารโต": {
            "PostCode": 95130,
            "Tambons": [
                "แม่หวาด",
                "คีรีเขต",
                "ธารโต",
                "บ้านแหร",
                "แม่หวาด"
            ]
        },
        "รามัน": {
            "PostCode": 95140,
            "Tambons": [
                "บาลอ",
                "บาโงย",
                "บือมัง",
                "อาซ่อง",
                "เนินงาม",
                "ตะโล๊ะหะลอ",
                "วังพญา",
                "ท่าธง",
                "ยะต๊ะ",
                "เกะรอ",
                "โกตาบารู",
                "กอตอตือร๊ะ",
                "กาลอ",
                "กาลูปัง",
                "จะกว๊ะ",
                "กายูบอเกาะ"
            ]
        }
    },
    "นราธิวาส": {
        "เมืองนราธิวาส": {
            "PostCode": 96000,
            "Tambons": [
                "กะลุวอ",
                "โคกเคียน",
                "บางปอ",
                "กะลุวอเหนือ",
                "ลำภู",
                "บางนาค",
                "มะนังตายอ"
            ]
        },
        "ตากใบ": {
            "PostCode": 96110,
            "Tambons": [
                "นานาค",
                "เกาะสะท้อน",
                "บางขุนทอง",
                "โฆษิต",
                "พร่อน",
                "ไพรวัน",
                "เจ๊ะเห",
                "ศาลาใหม่"
            ]
        },
        "สุไหงโก-ลก": {
            "PostCode": 96120,
            "Tambons": [
                "ปูโยะ",
                "มูโนะ",
                "ปาเสมัส",
                "สุไหงโก-ลก"
            ]
        },
        "เจาะไอร้อง": {
            "PostCode": 96130,
            "Tambons": [
                "จวบ",
                "มะรือโบออก",
                "บูกิต"
            ]
        },
        "ระแงะ": {
            "PostCode": 96130,
            "Tambons": [
                "ตันหยงลิมอ",
                "มะรือโบตก",
                "เฉลิม",
                "บาโงสะโต",
                "กาลิซา",
                "ตันหยงมัส",
                "บองอ"
            ]
        },
        "สุไหงปาดี": {
            "PostCode": 96140,
            "Tambons": [
                "กาวะ",
                "ริโก๋",
                "สากอ",
                "โต๊ะเด็ง",
                "สุไหงปาดี",
                "ปะลุรู"
            ]
        },
        "รือเสาะ": {
            "PostCode": 96150,
            "Tambons": [
                "ลาโละ",
                "สุวารี",
                "โคกสะตอ",
                "รือเสาะออก",
                "เรียง",
                "สามัคคี",
                "สาวอ",
                "รือเสาะ",
                "บาตง"
            ]
        },
        "แว้ง": {
            "PostCode": 96160,
            "Tambons": [
                "กายูคละ",
                "แว้ง",
                "เอราวัณ",
                "ฆอเลาะ",
                "แม่ดง",
                "โละจูด"
            ]
        },
        "บาเจาะ": {
            "PostCode": 96170,
            "Tambons": [
                "บาเระเหนือ",
                "กาเยาะมาตี",
                "ลุโบะสาวอ",
                "ปะลุกาสาเมาะ",
                "บาเจาะ",
                "บาเระใต้"
            ]
        },
        "ยี่งอ": {
            "PostCode": 96180,
            "Tambons": [
                "ลุโบะบายะ",
                "จอเบาะ",
                "ละหาร",
                "ยี่งอ",
                "ตะปอเยาะ",
                "ลุโบะบือซา"
            ]
        },
        "สุคิริน": {
            "PostCode": 96190,
            "Tambons": [
                "ร่มไทร",
                "ภูเขาทอง",
                "เกียร์",
                "สุคิริน",
                "มาโมง"
            ]
        },
        "ศรีสาคร": {
            "PostCode": 96210,
            "Tambons": [
                "เชิงคีรี",
                "ศรีสาคร",
                "ตะมะยูง",
                "ซากอ",
                "กาหลง",
                "ศรีบรรพต"
            ]
        },
        "จะแนะ": {
            "PostCode": 96220,
            "Tambons": [
                "จะแนะ",
                "ดุซงญอ",
                "ผดุงมาตร",
                "ช้างเผือก"
            ]
        }
    }
}